
#Область ОбработчикиСобытийФормы
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивДанныхИнформации = УниверсальныеМеханизмыКлиент.ПолучитьИнформациюОПрограмме();
	
	ФорматированныйДокумент.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(МассивДанныхИнформации));
	
	Редактор = ЭтаФорма.Элементы.ФорматированныйДокумент;
	Редактор.УстановитьГраницыВыделения(ФорматированныйДокумент.ПолучитьЗакладкуНачала(), ФорматированныйДокумент.ПолучитьЗакладкуКонца());
	
КонецПроцедуры

#КонецОбласти 
 