#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("ВидОперации");
	Поля.Добавить("СозданАвтоматически");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

// Процедура формирует представление документа вида <ТИП> № <Номер> от <Дата>
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ВидОперации = Перечисления.ВидыОперацийРаботыСБонусами.Начисление Тогда
		Представление = НСтр("ru='Пополнение бонусов'");
		
	ИначеЕсли Данные.СозданАвтоматически Тогда
		Представление = НСтр("ru='Сгорание бонусов'");
		
	Иначе
		Представление = НСтр("ru='Списание бонусов'");
	КонецЕсли;
	
	Представление = Представление + " № " + Данные.Номер+ " от " + Данные.Дата;
	
КонецПроцедуры

#КонецОбласти
