#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движение = Движения.НакопленияПоСкидкам.Добавить();
	Если ВидОперации = Перечисления.ВидыОперацийРаботыСБонусами.Начисление Тогда	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период = Дата;
	Движение.Получатель	 = Получатель;
	Движение.ВидСкидки	 = ВидСкидки;
	Движение.Накопление	 = СуммаСписания;
	Движения.Записать();
	
	Если Не СозданАвтоматически Тогда
		ДатаСгорания = Дата;
		РаботаСоСкидками.КонтрольОтрицательныхОстатков(Отказ, Получатель, ВидСкидки, "ПроверкаCписания");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РаботаСоСкидками.КонтрольОтрицательныхОстатков(Отказ, Получатель, ВидСкидки, "ПроверкаОтменыПроведения");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Получатель", Получатель);
	КонецЕсли;                              
КонецПроцедуры

#КонецОбласти


