#Область ПрограммныйИнтерфейс

// Формирует полный текст документа HTML
//
// Параметры:
//  ТекстHTML	 - Строка	 - текст тела HTML.
// 
// Возвращаемое значение:
//   Строка.
//
Функция СформироватьПолныйТекстДокументаHTML(ТекстHTML) Экспорт
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML));
	
КонецФункции

// Формирует код тела HTML из кода документа
//
// Параметры:
//  ТекстHTML	 - Строка	 - текст HTML.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьКодТелаHTMLИзКодаДокумента(Знач ТекстHTML) Экспорт
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML));
	
КонецФункции

#КонецОбласти