#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.АктуальныеГрафикиХозяйственныхПроцедур.Записывать = Истина;
	Для Каждого ТекСтрокаФилиалы Из Филиалы Цикл 
		Для Каждого ТекСтрокаГрафики Из ГрафикиПоДнямНедели Цикл	
			Движение = Движения.АктуальныеГрафикиХозяйственныхПроцедур.Добавить();
			Движение.Дата = Дата;
			Движение.ДатаОкончания = ДатаОкончания;
			Движение.Филиал = ТекСтрокаФилиалы.Филиал;
			Движение.ДеньНедели = ТекСтрокаГрафики.ДеньНедели;
			Движение.ГрафикПроцедур = ТекСтрокаГрафики.График;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания < НачалоДня(Дата) Тогда 
		ОбщегоНазначения.СообщитьОбОшибке(Нстр("ru = 'Дата окончания меньше даты документа!'"), Истина);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОкончания = Дата(1,1,1);
	
КонецПроцедуры

#КонецОбласти
