
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))
		И ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Клиент") <> Неопределено
	Тогда
		ЭтотОбъект.Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		ПроверяемыеРеквизиты.Добавить("Обоснованность");
	КонецЕсли;
	
	Если ТипОбращения.ТипОбъектаОбратнойСвязи = Перечисления.ТипОбъектаОбратнойСвязи.НеУказывается Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ОбъектОбращения"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти