///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает массив доверенных сертификатов
//
// Возвращаемое значение:
//   Массив из Структура:
//    * Наименование - Строка
//    * Хранилище - Строка - Имя хранилища
//    * ДействителенДо - Дата
//    * Сертификат - Строка - сертификат в виде Base64
//
Функция СписокДоверенныхСертификатов() Экспорт
	
	Если Не МенеджерОборудования.ИспользуетсяБСП() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СертификатыНУЦМинцифрыПовтИсп.СписокДоверенныхСертификатовИзМакета();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истина если интегрирована минимально требуемая версия БСП
//
// Возвращаемое значение:
//  Булево - 
//
Функция ВерсияБСПДопустимаДляУстановкиКорневыхСертификатов() Экспорт
	
	Если Не МенеджерОборудования.ИспользуетсяБСП() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекущаяВерсияБСП = МенеджерОборудованияВызовСервера.ВерсияБСП();
	ТекущаяВерсияБСПБезНомераСборки = 
		ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(ТекущаяВерсияБСП);
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекущаяВерсияБСПБезНомераСборки, "3.1.7")=0 Тогда
		МинимальнаяВерсияБСП = "3.1.7.305";
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсияБСП, МинимальнаяВерсияБСП)>=0 Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекущаяВерсияБСПБезНомераСборки, "3.1.8")=0 Тогда
		МинимальнаяВерсияБСП = "3.1.8.208";
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсияБСП, МинимальнаяВерсияБСП)>=0 Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ТекущаяВерсияБСПБезНомераСборки, "3.1.8")>0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

