#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма =  "ФормаПредопределенногоЭлемента";
			Иначе
				ВыбраннаяФорма =  "ФормаЭлемента";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура - Импортировать
//
// Параметры:
//  Данные	 - ДвоичныеДанные	 - Двоичные данные макета справочинка.
//
Процедура Импортировать(Данные) Экспорт
	ПутьКФайлуВыгрузки 							= ПолучитьИмяВременногоФайла("xml");
	УниверсальныйОбмен 							= Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальныйОбмен.ИмяФайлаОбмена 			= ПутьКФайлуВыгрузки;
	УниверсальныйОбмен.РежимОтладкиАлгоритмов 	= Истина;
	УниверсальныйОбмен.РежимОбмена 				= "Загрузка";
	
	Данные.Записать(ПутьКФайлуВыгрузки);
	УниверсальныйОбмен.ВыполнитьЗагрузку();
КонецПроцедуры

#КонецОбласти