#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
	Иначе
		Элементы.Клиент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура demandContent(Команда)
	demandContentНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура demandContentНаСервере()
	Ответ = ИнтеграцияЕГИСЗ_РЭМД.ЗапроситьДокументИзРЭМД(Объект.ИдентификаторРЭМД, Клиент);
	Если ЗначениеЗаполнено(Ответ) Тогда
		Сообщить("Идентификатор отправленного сообщения: " + Ответ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти