
// Вызывается при инициализации клиента лицензирования
//
// Параметры:
//  ПараметрыИнициализации - Структура - Открытые параметры инициализации клиента лицензирования. 
Процедура ИнициализацияПродукта(ПараметрыИнициализации) Экспорт

	// В продукте доступен выбор версии продукта (например, ПРОФ, Стандарт и т.д.)
	// Вместе с этим параметром, должен быть заполнен обработчик ниже ПриОткрытииФормыВыбораВерсииПродукта()
	ПараметрыИнициализации.ДоступенВыборВерсииПродукта = Ложь;
	
	// Инициализация основного продукта	
	БИТ_Защита_Конфигурации.ПриНачалеРаботыСистемы();	
КонецПроцедуры

// Вызывается при нажатии гиперссылки "Изменить версию продукта", формы системы лицензирования (при наличии в продукте такой функциональности)
Процедура ПриОткрытииФормыВыбораВерсииПродукта() Экспорт

	// Обработчик не заполнен, вставьте сюда код открытия формы константы.
	
КонецПроцедуры

// Вызывается при нажатии на кнопку обновить формы клиента лицензирования перед обновлением лицензии.
Процедура ПередОбновлениемСостояния() Экспорт
	
	// Обработчик не заполнен, вставьте код сюда.	
	
КонецПроцедуры 

// Вызывается при нажатии на кнопку обновить формы клиента лицензирования после обновления лицензии.
Процедура ПослеОбновленияСостояния() Экспорт
	
	// Обработчик не заполнен, вставьте код сюда.
	
КонецПроцедуры