#Область ПрограммныйИнтерфейс
// Функция ОтправитьНеотправленныеСообщения.
//
// Параметры:
//  НаборЗаписейСообщения - РегистрыСведенийНаборЗаписей.СообщенияEmail - сообщения документа.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция ОтправитьНеотправленныеСообщения(НаборЗаписейСообщения = Неопределено) Экспорт
	РезультатОтправки = РассылкаСообщенийEMAIL.ОтправитьНеотправленныеСообщения(Ссылка);
	Возврат РезультатОтправки;
КонецФункции

// Обновляет статусы сообщений документа по состоянию отправки.
//
Процедура УстановитьСтатусСообщенийПоДокументу() Экспорт
	
	НаборЗаписейСообщения = РегистрыСведений.СообщенияSMS.СоздатьНаборЗаписей();
	НаборЗаписейСообщения.Отбор.Рассылка.Установить(Ссылка);
	НаборЗаписейСообщения.Прочитать();
	Для Каждого Запись Из НаборЗаписейСообщения Цикл
		Если Проведен И Запись.СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.ПустаяСсылка() Тогда
			СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.НеОтправлено;
		ИначеЕсли Не Проведен И Запись.СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.НеОтправлено Тогда
			СтатусОтправки = Перечисления.СтатусыОтправкиСообщений.ПустаяСсылка();
		КонецЕсли;
		Если Запись.СтатусОтправки <> СтатусОтправки Тогда
			Запись.СтатусОтправки = СтатусОтправки;
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейСообщения.Модифицированность() Тогда
		НаборЗаписейСообщения.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Перезаполнляет текст сообщений по виду сообщения рассылки.
//
// Параметры:
//  ТабСообщения - ТаблицаЗначений	 - сообщения.
//
Процедура ЗаполнитьТекстПоВидамСообщений(ТабСообщения) Экспорт
	
	ТабВидыСообщений = ТабСообщения.Скопировать();
	ТабВидыСообщений.Свернуть("ВидСообщения");
	
	ДанныеВидовСообщений = СМС_ФормированиеСообщений.ПолучитьДанныеВидовСообщений(ТабВидыСообщений.ВыгрузитьКолонку("ВидСообщения"));
	
	Для Каждого СтрокаВидСообщения Из ТабВидыСообщений Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаВидСообщения.ВидСообщения) Тогда
			Продолжить
		КонецЕсли;
		
		Если ДанныеВидовСообщений.НайтиСледующий(Новый Структура("ВидСообщения",СтрокаВидСообщения.ВидСообщения)) Тогда
			
			мсСтрокиСообщения = ТабСообщения.НайтиСтроки(Новый Структура("ВидСообщения",СтрокаВидСообщения.ВидСообщения));
			Для Каждого СтрокаСообщения Из мсСтрокиСообщения Цикл
				
				СтрокаСообщения.Текст = СМС_ФормированиеСообщений.ВычислитьТекстСообщения(ДанныеВидовСообщений, СтрокаСообщения);	
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	           
	Если Не Проведен Тогда
		УстановитьСтатусСообщенийПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти