#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.КлассификаторыМинЗдрава")) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидКлассификатора");
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ТипЗначения.СодержитТип(Тип("Строка"))
		И ПакетыСоставныхФраз.Количество() <> 0
	Тогда
		ПакетыСоставныхФраз.Очистить();
	КонецЕсли;
	
	Если Не ЭтоГруппа
		И Не ТипЗначения.СодержитТип(Тип("СправочникСсылка.КлассификаторыМинЗдрава"))
	Тогда
		ВидКлассификатора = Неопределено;
	КонецЕсли;
	
	Если Не ЭтоГруппа
		И Не ЗначениеЗаполнено(Назначение)
		И Назначение <> Неопределено
	Тогда
		Назначение = Неопределено;
	КонецЕсли;
	
	Если Назначение = Перечисления.КодировкаПолейЭМД.СЭМДЗначениеНеопределённогоВитальногоПараметра Тогда
		ТипЗначения = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
