
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//  Дата - текущая дата.
Функция ДатаСеанса() Экспорт
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
// Параметры:
//  ПараметрыЧека - Структура - Параметры чека ККТ, где:
//    * ПозицииЧека - Массив из См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека - .
//  ТекстСообщения - Строка - Текст сообщения покупателю.
//  ПокупательEmail - Строка - Электронную почта покупателя.
//  ПокупательНомер - Строка - Абонентский номер покупателя.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
КонецПроцедуры

// Начинает рассылку или ставит задачу на рассылку нефискальных документов.
// Которые заданы в шаблоне чека.
//
// Параметры:
//  Параметры - Массив из См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека, где:
//    * ПозицииЧека - Массив из Структура. 
//
Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
КонецПроцедуры

#Область ОборудованиеККТ

// Переопределяет доступное ККТ для фискализации чека
// Параметры:
//  РеквизитыЧека - Структура - реквизиты фискального чека
//  СписокУстройств - Массив - список доступных ККТ для фискализации
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ для фискализации
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ДоступноеККТДляФискализации(РеквизитыЧека, СписокУстройств, ИдентификаторУстройстваККТ, СтандартнаяОбработка = Истина) Экспорт

КонецПроцедуры

// Событие при открытии смены на ККТ 
// Параметры:
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ
//  ПараметрыРегистрации - Структура - Параметры регистрации ФН
//
Процедура ПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации) Экспорт

КонецПроцедуры

// Переопределяет печать слип чека алкогольной продукции. 
// Параметры:
//  ПечатьСлипЧека - Булево - Печатается слип чек алкогольной продукции 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ПечатьСлипЧекаАлкогольнойПродукции(ПечатьСлипЧека, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры     

// Переопределяет печать слип чека эквайринговой операции. 
// Параметры:
//  ПечатьСлипЧека - Булево - Определяет будет ли распечатан слип-чек, по умолчанию Истина.  
//  ПолныйСлипЧек  - Булево - Определяет какой слип-чек будет распечатан полный или короткий, по умолчанию Истина. 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки.
//
Процедура ПечатьСлипЧекаЭквайринговойОперации(ПечатьСлипЧека, ПолныйСлипЧек, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры   

// Переопределяет вывод QR-кода чека на дисплей покупателя после фискализации. 
// Параметры:
//  ВыводQRКодаЧека - Булево - Вывод QR-кода чека на дисплей покупателя 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации(ВыводQRКодаЧека, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ВыводQRКодаЧека = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ЧекКММВыводитьQRКодНаДисплейПокупателя");
	
КонецПроцедуры

// Переопределяет формат события от устройств ввода.
// Параметры:
//  НовыйФормат - Булево - Событие от устройств ввода работают в новом формате 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура СобытиеУстройствВводаНовыйФормат(НовыйФормат, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОборудованиемСФормы

// Начать подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ПоддерживаемыеТипыПодключаемогоОборудования - Строка - Содержит перечень типов подключаемого оборудования, 
//                                                разделенных запятыми.
//
Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы.
//
// Параметры:
// Форма - ФормаКлиентскогоПриложения
//
Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(Форма) Экспорт
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы - Завершение.
//
// Параметры:
//  РезультатВыполнения - Структура
//  Параметры - Структура
//
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы - Завершение.
//
// Параметры:
//  РезультатВыполнения - Структура
//  Параметры - Структура
//
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - навигационная ссылка.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ЭтотОбъект - СправочникОбъект.ПодключаемоеОборудование - текущий объект подключаемого оборудования.
//  Элемент - Элемент - изменяемый элемент.
//  ВыбранноеЗначение - ПеречислениеСсылка.ТипыПодключаемогоОборудования - выбранное значение.
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаспределеннаяФискализации

// Переопределяемые действия после открытия чека в очереди чеков.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчередиПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Переопределяемые действия после ошибки печати чека в очереди чеков.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчередиПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраФискальныеОперации

// Дополнительные переопределяемые действия с управляемой формой в Фискальные операции
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.ФискальныеОперации
//  ЭтаФорма - Форма
//  НавигационнаяСсылкаФорматированнойСтроки - Строка
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ФормаЗаписиФискальныеОперацииОбработкаНавигационнойСсылки(Запись, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СообщениеВТехническуюПоддержку

// В процедуре можно разрешить, либо запретить отправку сообщений БПО в тех. поддержку
//
// Параметры:
//  Отправлять - Булево - при стандартной обработке Истина
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ОтправлятьСообщенияВТехПоддержку(Отправлять, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Подготовка текста сообщения в службу технической поддержки
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения который будет вставлен в поле "Шаблон сообщения" на сайте.
//  ТекстОшибки - Строка - текст ошибки, переданный в процедуру отправки сообщения.
//
Процедура ПодготовитьТекстСообщенияВТехПоддержку(ТекстСообщения, ТекстОшибки) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Устаревшая. для обратной совместимости
Процедура ОбработатьСобытие() Экспорт
	
КонецПроцедуры

#Область ПакетнаяОбработка

// Процедура в которой можно сформировать текстовое содержание слип-чека
//
// Параметры:
//   Тип - Строка - Тип слип-чека: 
//         "Обычный"     - обычный слип-чек, печатаемый в теле фискального чека;
//         "Электронный" - слип-чек, печатаемый в случае электронного фискального чека;
//         "Отказ"       - слип-чек, печатаемый в случае отказа выполнения эквайринговой операции,
//                         или же выполнения аварийной отмены эквайринговой операции.
//   ДанныеДляШаблона - Структура - данные для формирования слип-чека:
//     * ПараметрыФискализацииЧека - См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//     * ПараметрыВыполненияЭквайринговойОперации - См. ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации
//     * РезультатВыполненияЭквайринговойОперации - См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании
//     * ДополнительныеПараметры - Структура - Дополнительные параметры переданные ранее в процедуру 
//                                 "НачатьФискализациюЧекаСОплатойКартой".
//   Текст - Строка - Текст слип чека который будет выведен в теле фискального чека, может быть переопределен
//   СтандартнаяОбработка - Булево - Если передано Ложь, тогда слип-чек нужно сформировать самостоятельно
//                          заполнив массив "ПараметрыФискализацииЧека.ПозицииЧека".
Процедура СформироватьШаблонСлипЧека(Тип, ДанныеДляШаблона, Текст, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ПолучитьНомераЧековСторно(ПараметрыФискализации) Экспорт
	
	СтрокаНомеровЧековСторно = "";
	Если ПараметрыФискализации.Свойство("ЧекиКоррекцииСторно") Тогда 
		
		Для Каждого ЧекКоррекцииСторно Из ПараметрыФискализации.ЧекиКоррекцииСторно Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаНомеровЧековСторно, ЧекКоррекцииСторно.НомерЧекаККТ, "; ");
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокаНомеровЧековСторно; 
	
КонецФункции
