#Область ПрограммныйИнтерфейс

// Описывает соответствие между именем реквизита в классификаторе и его именем в базе 1С.
// 
// Возвращаемое значение:
//   - Соответствие.
//
Функция ПолучитьСопоставленийРеквизитовИXMLСправочникаЕГИСЗ() Экспорт
	
	Сопоставление = Новый Соответствие;
	Сопоставление.Вставить("SMNN_CODE", "Код");
	Сопоставление.Вставить("STANDARD_INN", "Наименование");
	Сопоставление.Вставить("STANDARD_FORM", "Форма");
	Сопоставление.Вставить("STANDARD_DOZE", "Доза");
	Сопоставление.Вставить("CODE_ATC", "КодАТХ");
	Сопоставление.Вставить("NAME_ATC", "НаименованиеАТХ");
	Сопоставление.Вставить("OKEI_CODE", "КодОКЕИ");
	Сопоставление.Вставить("ESSENTIAL_MEDICINES", "ЖНВЛС");
	Сопоставление.Вставить("NARCOTIC_PSYCHOTROPIC", "Наркотическое");
	 
	//1) SMNN_CODE, Код_узла_СМНН, Строчный;
	//2) STANDARD_INN, Стандартизованное_МНН, Строчный;
	//3) STANDARD_FORM, Стандартизованная_лекарственная_форма, Строчный;
	//4) STANDARD_DOZE, Стандартизованная_лекарственная_доза, Строчный;
	//5) KTRU_CODE, Код_КТРУ, Строчный;
	//6) OKEI_CODE, Код_ОКЕИ_(потребительская_единица_измерения), Строчный;
	//7) OKPD_2_CODE, Код_ОКПД2, Строчный;
	//8) ESSENTIAL_MEDICINES, ЖНВЛП, Строчный;
	//9) NARCOTIC_PSYCHOTROPIC, Наличие_в_ЛП_наркотических_психотропных_веществ_и_их_прекурсоров, Строчный;
	//10) CODE_ATC, Код_АТХ, Строчный;
	//11) NAME_ATC, Наименование_АТХ, Строчный;
	//12) TN, Наименование_ФТГ, Строчный;
	
	Возврат Сопоставление;

КонецФункции

#КонецОбласти
