
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьЗадачи(Команда)
	УдалитьЗадачиСервер();
	Оповестить("ИзменениеЗадачи");
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьЗадачиСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ЗадачиПользователя.Ссылка
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	ЗадачиПользователя.СрокИсполнения <= &Дата
	|	И НЕ ЗадачиПользователя.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(ВидЗадачи) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗадачиПользователя.ВидЗадачиНапоминания = &ВидЗадачиНапоминания";
	КонецЕсли;
	
	Если УдалитьВыполненные Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ЗадачиПользователя.Выполнена";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", КонецДня(СрокИсполнения));
	Запрос.УстановитьПараметр("ВидЗадачиНапоминания", ВидЗадачи);
	
	счТр = 0;
	КолОперацийВТранзакции = 500;
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Пока Выборка.Следующий() Цикл			
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(Истина);
		
		счТр = счТр + 1;
		Если счТр = КолОперацийВТранзакции Тогда
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
			счТр = 0;
		КонецЕсли;
		
	КонецЦикла;	 
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры

#КонецОбласти