
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтандартныеРеквизиты = ПустаяСсылка().Метаданные().СтандартныеРеквизиты;
	Реквизиты = ПустаяСсылка().Метаданные().Реквизиты;
	
	Поля.Добавить(СтандартныеРеквизиты.Код.Имя);
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон("%1 %2", Данные.Код, Данные.Наименование);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий