#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВредныйФакторСправки") И Параметры.ВредныйФакторСправки Тогда
		НовыйМассив = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Новый ПараметрВыбора("Отбор.Родитель", Справочники.ПриказыМедосмотров.СправкиИИныеМедосмотры));
		Элементы.Приказ.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		ПриказыСправок = ПолучитьПриказыСправок();
		Если ПриказыСправок.Количество() = 1 Тогда
			Объект.Приказ = ПриказыСправок[0].Ссылка;
		КонецЕсли;
		ВредныйФакторСправки = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Приказ = Справочники.ПриказыМедосмотров.Приказ29н;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовПоПриказу();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийОбъект.Приказ.Предопределенный
		И Не ЗначениеЗаполнено(ТекущийОбъект.НомерПП)
	Тогда
		ТекущийОбъект.НомерПП = ТекущийОбъект.Приказ.Код;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриказПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоПриказу();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПриказыСправок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриказыМедосмотров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПриказыМедосмотров КАК ПриказыМедосмотров
		|ГДЕ
		|	ПриказыМедосмотров.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.ПриказыМедосмотров.СправкиИИныеМедосмотры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоПриказу()
	
	ЭтоПриказ29Нили302Н = Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ29н")
						Или Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ302н");
						
	Элементы.ВидПеречняДляМедОсмотра.Видимость = Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ302н");
	Элементы.ГруппаМедицинскиеПротивопоказания.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ПериодичностьОсмотров.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ВрачиСтрока.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ЛабораторныеИФункциональныеИсследованияСтрока.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ГруппаВредныеВещества.Видимость = ЭтоПриказ29Нили302Н;
	ГруппаСправкиИИныеМедОсмотры = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.СправкиИИныеМедосмотры");
	РодительПриказа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Приказ, "Родитель");
	Элементы.ШаблонОсмотраСправки.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ЛабораторныеИФункциональныеИсследованияНеТребуетОтметкиВыполнения.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ЛабораторныеИФункциональныеИсследованияНеУчитыватьПриРасчетеЦены.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ВрачиНеУчитыватьПриРасчетеЦены.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ВрачиНеТребуетОтметкиВыполнения.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВредныйФакторСправки Тогда
		Оповестить("ЗаписанВредныйФакторПриВызовеИзНоменклатуры", Объект.Ссылка, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
