#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Исключения = Новый Массив;
	Исключения.Добавить(АвтоматическоеСписаниеПоИстечениюСрокаГодности);
	Исключения.Добавить(НеИспользуется25);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Сч = 6 По Количество() Цикл
		Значение = Получить(Сч - 1);
		Если Исключения.Найти(Значение) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеВыбора.Добавить(Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
