#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не Отказ Тогда
		
		Для Каждого СтрокаНакопления Из Накопления Цикл
			
			Движение = Движения.НакопленияПоСкидкам.Добавить();
			Движение.Период		= Дата;
			Движение.ВидСкидки  = ВидСкидки;
			Движение.Регистратор = Ссылка;
			Движение.Активность = Истина;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(Движение, СтрокаНакопления);
			
		КонецЦикла;
		
		Движения.НакопленияПоСкидкам.Записывать = Истина;
	КонецЕсли;
        
КонецПроцедуры // ОбработкаПроведения()

#КонецОбласти
