
#Область ОбработчикиСобытийОбъектов

// Обработчик события вызывается на сервере при получении стандартной управляемой формы.
// Если требуется переопределить выбор открываемой формы, необходимо установить в параметре <ВыбраннаяФорма>
// другое имя формы или объект метаданных формы, которую требуется открыть, и в параметре <СтандартнаяОбработка>
// установить значение Ложь.
//
// Параметры:
//  ИмяДокумента - Строка - имя документа, для которого открывается форма,
//  ВидФормы - Строка - имя стандартной формы,
//  Параметры - Структура - параметры формы,
//  ВыбраннаяФорма - Строка, ФормаКлиентскогоПриложения - содержит имя открываемой формы или объект метаданных Форма,
//  ДополнительнаяИнформация - Структура - дополнительная информация открытия формы,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ПриПолученииФормыДокумента(ИмяДокумента, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодированиеНоменклатуры

// В процедуре требуется реализовать алгоритм обработки полученных штрихкодов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ДанныеДляОбработки - Структура - подготовленные ранее данные для обработки,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ОбработатьШтрихкоды(Форма, ДанныеДляОбработки, КэшированныеЗначения) Экспорт
	
// +бит
	ИнтеграцияМДЛПМедицина_БИТ.ОбработатьШтрихкоды(Форма, ДанныеДляОбработки, КэшированныеЗначения)
// -бит	
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросИнформацииОбУпаковках

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о потребительских упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Данные - Соответствие - данные, возвращаемые в результате функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОПотребительскихУпаковках.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОПотребительскихУпаковках(Форма, Данные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о транспортных упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Данные - Соответствие - данные, возвращаемые в результате функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОТранспортныхУпаковках.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОТранспортныхУпаковках(Форма, Данные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СверкаОстатков

// Выполняет запись изменений данных упаковок по данным МДЛП в обработке СверкаОстатковМДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется запись состава транспортных упаковок;
//  Объект - ДанныеФормыСтруктура - данные формы, из которых получаются изменения состава транспортных упаковок;
//  ИмяТабличнойЧасти - Строка - имя табличной части, из которой получаются изменения состава транспортных упаковок;
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартных действий при записи изменений состава транспортных упаковок;
//
Процедура ЗаписатьРезультатСверкиОстатков(Форма, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти // СверкаОстатков

#Область ПолучениеСоставаТранспортныхУпаковок

// Выполняет запись изменений данных упаковок по данным МДЛП в обработке ПолучитьСоставТранспортныхУпаковокМДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется запись состава транспортных упаковок;
//  Объект - ДанныеФормыСтруктура - данные формы, из которых получаются изменения состава транспортных упаковок;
//  ИмяТабличнойЧасти - Строка - имя табличной части, из которой получаются изменения состава транспортных упаковок;
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартных действий при записи изменений состава транспортных упаковок;
//
Процедура ЗаписатьРезультатПолученияСоставаТранспортныхУпаковок(Форма, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти // ПолучениеСоставаТранспортныхУпаковок