#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		ВеличинаДолга = РаботаСКлиентамиПереопределяемый.ПолучитьВзаиморасчетыСКлиентом(ПараметрКоманды, ТекущаяДата());
	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Контрагент, ВидОперации, СуммаДокумента",
																				ПараметрКоманды,
																				ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.РасчетыСКлиентами"),
																				Макс(-ВеличинаДолга, 0)));
		Выдать = ""; ВыдатьИНН = ""; ВыдатьАдрес = "";
		РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(ПараметрКоманды, Выдать, ВыдатьИНН, ВыдатьАдрес);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("Выдать",	Выдать);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ВыдатьИНН", ВыдатьИНН);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ВыдатьАдрес", ВыдатьАдрес);
		
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

