#Область ПрограммныйИнтерфейс

// Приводит имена всех параметров к допустимому виду для использования в качестве ключа.
//  Испльзуется при обновлении.
//
Процедура ПривестиИменаПараметровКДопустимомуВиду() Экспорт 
	
	ВыборкаПараметры = ПланыВидовХарактеристик.ПараметрыМедицинскойКарты.Выбрать();
	Пока ВыборкаПараметры.Следующий() Цикл
		
		ПараметрОбъект = ВыборкаПараметры.ПолучитьОбъект();
		ПараметрОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуУникальности");
		ПараметрОбъект.Наименование = ОбщегоНазначенияКлиентСервер.ПривестиИмяПараметраКДопустимому(ПараметрОбъект.Наименование);
		ПараметрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Заголовок");
	Поля.Добавить("Наименование");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Заголовок) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Заголовок;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
