#Область ПрограммныйИнтерфейс

Функция ШаблонВидовНозологическихЕдиницМедкарты(СтандартнаяОбработка, ВидКарты) Экспорт
	
	// СтандартнаяОбработка = Ложь;
	// Шаблон = Новый Массив;
	// ...
	// Возврат Шаблон;
	
КонецФункции

#Область ПечатьМедкарт

Функция ПечатьКарты(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ИмяМакета, ДляРедактирования) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

Функция РольДоступнаТекущемуПользователю(МедицинскийДокумент, Роль) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМакетыСРучнымРедактированием(МакетыСРучнымРедактированием) Экспорт
	
КонецПроцедуры

Функция ПолучитьРолиДляПодписанияПоВидуМедкарты(ВидКарты) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМакетыМедкартБезВычисляемыхПараметров(МакетыБезВычисляемыхПараметров) Экспорт
	
КонецПроцедуры

Функция ПолучитьПараметрыРасшифровокПоВидуМедкарты(ВидКарты) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбластьЭЦППоВидуМедкарты(ВидКарты) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМетаданныеВстроенныхОбработок(ВстроенныеОбработки) Экспорт
	
КонецПроцедуры

Функция РолиДляПодписанияМедицинскогоДокумента(МедицинскийДокумент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция СформироватьЭМДМедицинскогоДокумента(МедицинскийДокумент, ТекстОшибки, СохранитьЭМД = Истина) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьЗначенияПустыхПараметровПоУмолчанию(ВидКарты) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти