#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СертификатЭЦП") Тогда
		СертификатЭЦП = Параметры.СертификатЭЦП;
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(СертификатЭЦП);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(СертификатЭЦП, Пароль);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти