#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗГрафики = Объект.ГрафикПроцедур.Выгрузить();
	ТЗГрафики.Свернуть("Процедура");
	Процедуры.ЗагрузитьЗначения(ТЗГрафики.ВыгрузитьКолонку("Процедура"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПроцедурыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОтборСтрокПроцедур();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедурыПередУдалением(Элемент, Отказ)
	
	МассивСтрокГрафика = Объект.ГрафикПроцедур.НайтиСтроки(Новый Структура("Процедура", Элементы.Процедуры.ТекущиеДанные.Значение));
	Для Каждого СтрокаГрафика Из МассивСтрокГрафика Цикл
		Объект.ГрафикПроцедур.Удалить(СтрокаГрафика);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПроцедурПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		Если Элементы.Процедуры.ТекущиеДанные <> Неопределено Тогда
			ТехПроцедура = Элементы.Процедуры.ТекущиеДанные.Значение;
		КонецЕсли;
		
		Элемент.ТекущиеДанные.Процедура = ТехПроцедура;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПроцедурПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Процедуры.ТекущиеДанные <> Неопределено Тогда
		ТехПроцедура = Элементы.Процедуры.ТекущиеДанные.Значение;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Текущая процедура не выбрана'"));
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбновитьОтборСтрокПроцедур()
	
	Если Элементы.Процедуры.ТекущиеДанные <> Неопределено Тогда
		ТехПроцедура = Элементы.Процедуры.ТекущиеДанные.Значение;
	Иначе
		ТехПроцедура = ПредопределенноеЗначение("Справочник.ХозяйственныеПроцедуры.ПустаяСсылка");
	КонецЕсли;
	
	Отбор = Новый Структура("Процедура", ТехПроцедура);
	Элементы.ГрафикПроцедур.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

#КонецОбласти