Функция ПолучитьМестоДеятельностиМДЛП(Филиал, Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СубъектыОбращенияМДЛП.МестоДеятельности.Идентификатор КАК МестоДеятельностиИдентификатор
		|ИЗ
		|	РегистрСведений.СубъектыОбращенияМДЛП КАК СубъектыОбращенияМДЛП
		|ГДЕ
		|	СубъектыОбращенияМДЛП.ОрганизацияКонтрагент = &Филиал
		|	И СубъектыОбращенияМДЛП.ОбъектМестаДеятельности = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МестоДеятельностиИдентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции