#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Работы") Тогда
			Для Каждого СтрокаРабот Из ДанныеЗаполнения.Работы Цикл
				ЗаполнитьЗначенияСвойств(Работы.Добавить(), СтрокаРабот);
			КонецЦикла;
			Работы.ЗагрузитьКолонку(Работы.ВыгрузитьКолонку("Сумма"), "СуммаБезСкидок");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.Отклонена Тогда 
		ЭтотОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьДвиженияПоЗаказуНаПроизводство");
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.ПредметРекламации) = Тип("ДокументСсылка.КомплексныйРасчетКлиента") Тогда
		Если ЭтотОбъект.Отклонена Тогда
			Если Не ЭтоНовый() Тогда
				КомплексныеРасчетыКлиентов.ЗаказыНаПроизводствоУдалениеПроведенияОбработчик(ЭтотОбъект, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
