#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мЭтоНовый;

Перем ПометкаУдаленияСтарая;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Данные для обработчика ПриЗаписи
	мЭтоНовый = ЭтоНовый();
	
	// Автопростановка организации по филилалу
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = Филиал.Организация;
	КонецЕсли;
	
	// Представление периода
	Попытка 
		Отчет = Отчеты[ЭтотОбъект.ИсточникОтчета].Создать();
		ПредставлениеПериода = Отчет.ПредставлениеПериодаОтчета(Ссылка);
	Исключение
		Если Периодичность = Перечисления.Периодичность.Месяц Тогда
			ПредставлениеПериода = МедицинскаяОтчетностьВызовСервера.ПредставлениеОтчетногоПериода(ДатаНачала, ДатаОкончания, "Ложь");
		Иначе
			ПредставлениеПериода = МедицинскаяОтчетностьВызовСервера.ПредставлениеОтчетногоПериода(ДатаНачала, ДатаОкончания);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления <> ПометкаУдаленияСтарая Тогда
		
		Для Каждого НаборДвижений Из Движения Цикл
			НаборДвижений.Прочитать();
			Если НаборДвижений.Количество() > 0 Тогда 
				Для Каждого Запись Из НаборДвижений Цикл
					Запись.Активность = Не ПометкаУдаления;
				КонецЦикла;
				НаборДвижений.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли