#Область ПрограммныйИнтерфейс

// Получает контактную информацию с приоритетом филиала, но при отсутствии берет из организации этого филиала
//
// Параметры:
//  СсылкаНаОбъект			 - СправочникСсылка.Филиалы - Филиал.
//  ТипКонтактнойИнформации		 - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип
//  ВидыКонтактнойИнформации	 - СправочникСсылка.ВидыКонтактнойИнформации - вид
//  ВернутьПервое				 - Булево - вернуть первое значение КИ или все подходящие.
// 
// Возвращаемое значение:
//  Строка - представление данных.
//
Функция ПолучитьКИ(СсылкаНаОбъект, ТипКонтактнойИнформации = Неопределено, ВидыКонтактнойИнформации = Неопределено, ВернутьПервое = Истина) Экспорт
	
	Представление = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(СсылкаНаОбъект, ТипКонтактнойИнформации, ВидыКонтактнойИнформации, ВернутьПервое);
	
	Если Не ЗначениеЗаполнено(Представление) Тогда
		Представление = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(СсылкаНаОбъект.Организация, ТипКонтактнойИнформации, ВидыКонтактнойИнформации);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти