#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьСписокВстроенныхЯчеекЖурналаЗаписи();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьЯчейкиЖурналаЗаписи(Команда)
	
	ЗагрузитьЯчейкиЖурналаЗаписиНаСервере();
	ПоказатьПредупреждение(,НСтр("ru ='Выбранные позиции успешно загружены!'"));
	Оповестить("ОбновленСписокЯчеекЖурналаЗаписи");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЯчейкиЖурналаЗаписиНаСервере()
	
	Для Каждого СтрокаЯчейкиЖурналаЗаписи Из ЯчейкиЖурналаЗаписи Цикл
		Если СтрокаЯчейкиЖурналаЗаписи.Пометка Тогда
			ДанныеМакета = Справочники.ЯчейкиКалендаря.ПолучитьМакет(СтрокаЯчейкиЖурналаЗаписи.Значение);
			Справочники.ЯчейкиКалендаря.Импортировать(ДанныеМакета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокВстроенныхЯчеекЖурналаЗаписи()
	
	Для Каждого МетаданныеМакета Из Метаданные.Справочники.ЯчейкиКалендаря.Макеты Цикл
		Если Тип(МетаданныеМакета.ТипМакета) = Тип("ДвоичныеДанные") Тогда
			ЯчейкиЖурналаЗаписи.Добавить(МетаданныеМакета.Имя, МетаданныеМакета.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	ЯчейкиЖурналаЗаписи.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти