#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимПодбора = Параметры.РежимВыбора;
	
	Если НЕ РежимПодбора Тогда
		Элементы.ДанныеФлажкаДокументы.Видимость = Ложь;
		Элементы.ДанныеФлажкаСправочники.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.СписокДокументов.РежимВыбора = Параметры.РежимВыбора;
		Элементы.СписокСправочников.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСписокОбъектов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновныеДействияФормыКнопкаОК(Кнопка)

	Если НЕ РежимПодбора Тогда
		Если Элементы.Панель.ТекущаяСтраница = Элементы.ГруппаДокументы Тогда
			возвр = Новый Структура;
			возвр.Вставить("Имя", Элементы.СписокДокументов.ТекущиеДанные.Имя);
			возвр.Вставить("Синоним", Элементы.СписокДокументов.ТекущиеДанные.Синоним);
		Иначе
			возвр = Новый Структура;
			возвр.Вставить("Имя", Элементы.СписокСправочников.ТекущиеДанные.Имя);
			возвр.Вставить("Синоним", Элементы.СписокСправочников.ТекущиеДанные.Синоним);
		КонецЕсли;	
		
		ОповеститьОВыборе(возвр);
	Иначе
		ОповеститьОВыборе(ПолучитьСписокВыбранныхОбъектов());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимПодбора Тогда
		Для Каждого  стр Из СписокДокументов Цикл 
			Если стр = Элементы.СписокДокументов.ТекущиеДанные Тогда 
				стр.Пометка = Не стр.Пометка;
			Иначе 
				стр.Пометка = Ложь;
			КонецЕсли;	
	     КонецЦикла;
	Иначе
		возвр = Новый Структура;
		возвр.Вставить("Имя", Элементы.СписокДокументов.ТекущиеДанные.Имя);
		возвр.Вставить("Синоним", Элементы.СписокДокументов.ТекущиеДанные.Синоним);
		ОповеститьОВыборе(возвр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСправочниковВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимПодбора Тогда
		Для Каждого  стр Из СписокСправочников Цикл 
			Если стр = Элементы.СписокСправочников.ТекущиеДанные Тогда 
				стр.Пометка = Не стр.Пометка;
			Иначе 
				стр.Пометка = Ложь;
			КонецЕсли;	
	     КонецЦикла;
	Иначе
		возвр = Новый Структура;
		возвр.Вставить("Имя", Элементы.СписокСправочников.ТекущиеДанные.Имя);
		возвр.Вставить("Синоним", Элементы.СписокСправочников.ТекущиеДанные.Синоним);
		ОповеститьОВыборе(возвр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФлажкаДокументыПриИзменении(Элемент)
	
	Для Каждого эл Из СписокДокументов Цикл 
		Если эл.Пометка И эл <> Элементы.СписокДокументов.ТекущиеДанные Тогда 
			 эл.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;

	Для Каждого эл Из СписокСправочников Цикл 
		 эл.Пометка = Ложь;
	КонецЦикла;
		

КонецПроцедуры

&НаКлиенте
Процедура ДанныеФлажкаСправочникиПриИзменении(Элемент)
	
	Для Каждого эл Из СписокСправочников Цикл 
		Если эл.Пометка И эл <> Элементы.СписокСправочников.ТекущиеДанные Тогда 
			 эл.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;

	Для Каждого эл Из СписокДокументов Цикл 
		 эл.Пометка = Ложь;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьСписокВыбранныхОбъектов()
	
	СписокОбъектов = Новый СписокЗначений;
	
	Для Каждого Документ Из СписокДокументов Цикл
		
		Если Документ.Пометка Тогда
			СписокОбъектов.Добавить(Новый Структура("Имя, Синоним", Документ.Имя, Документ.Синоним));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Справочник Из СписокСправочников Цикл
		
		Если Справочник.Пометка Тогда
			СписокОбъектов.Добавить(Новый Структура("Имя, Синоним", Справочник.Имя, Справочник.Синоним));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокОбъектов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокОбъектов()
	
	ТипыПараметраКоманды = Метаданные.ОбщиеКоманды.Найти("Печать").ТипПараметраКоманды;

	Для Каждого Тип Из ТипыПараметраКоманды.Типы() Цикл 
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
		
		Если ОбъектМетаданных <> Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда 
			НовСтр			 = СписокДокументов.Добавить();
			НовСтр.Имя		 = ОбъектМетаданных.Имя;
			НовСтр.Синоним	 = ОбъектМетаданных.Синоним;
        ИначеЕсли ОбъектМетаданных <> Неопределено И Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			НовСтр 			= СписокСправочников.Добавить();
			НовСтр.Имя		= ОбъектМетаданных.Имя;
			НовСтр.Синоним 	= ОбъектМетаданных.Синоним;
		КонецЕсли;
	КонецЦикла;
	
	СписокДокументов.Сортировать("Синоним");
	СписокСправочников.Сортировать("Синоним");
			
КонецПроцедуры

#КонецОбласти

