#Область ПрограммныйИнтерфейс

// Дополнительные действия после записи документа Оказание услуг.
//
// Параметры:
//  Объект				 - ДокументОбъект.ОказаниеУслуг	 - документ.
//  СтруктураПараметров	 - Структура - параметры записи.
//
Процедура ОказаниеУслугПослеЗаписи(Объект,СтруктураПараметров) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Открыть форму выбора клиента в контексте журнала записи.
//
// Параметры:
//  СоздаваемыйОбъект	 - Строка	 - Полное имя типа создаваемого документа.
//  Заявка				 - ДокументСсылка.Заявка	 - заявка.
//  ТекущийКлиент		 - СправочникСсылка.Клиенты	 - клиент.
//  СтандартнаяОбработка - Булево	 - прекращение дальнейшей обработки.
//
Процедура КалендарьПланированияОткрытьФормуВыбораКлиента(СоздаваемыйОбъект, Заявка, ТекущийКлиент, СтандартнаяОбработка) Экспорт

	Возврат;
	
КонецПроцедуры

// Создает документ забора анализов по продажам или оказание услуг по забранным анализам
//
// Параметры:
//  Режим	 - Строка						 - Режим работы формы, "ЗаборПоОплаченным" или "Продажа".
//  Клиент	 - СправочникСсылка.Клиенты		 - Клиент, для которого выполняется заполнение.
//  Анализы	 - Массив						 - Массив структур "Клиент, Номенклатура, Количество", Если значение неопределено,
//  						будет выполнен поиск по всем документам в соответствии с режимом.
//  ЭтаФорма - ФормаКлиентскогоПриложения	 - Ссылка на форму документа, из которого вызвано заполнение.
//
Процедура ВыборатьУслугиКлиентовДляСозданияДокумента(Режим = Неопределено, Клиент = Неопределено, Анализы = Неопределено, 
	ЭтаФорма = Неопределено, ИсключаемыеАнализы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", Режим);
	Если Клиент <> Неопределено Тогда
		ПараметрыФормы.Вставить("Клиент", Клиент);
	КонецЕсли;
	Если Анализы <> Неопределено Тогда
		ПараметрыФормы.Вставить("Анализы", Анализы);
	КонецЕсли;
	Если ИсключаемыеАнализы <> Неопределено Тогда
		ПараметрыФормы.Вставить("ИсключаемыеАнализы", ИсключаемыеАнализы);
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.ВыборУслугДляСозданияДокумента", ПараметрыФормы, ЭтаФорма, Ложь,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создать продажу по текущему посещению клиента.
//
// Параметры:
//  ЭтаФорма	 - ФормаКлиентскогоПриложения	 - форма вызова.
//  ИмяКоманды	 - Строка	 - команда
//
Процедура СоздатьПродажуПоНачатомуПосещению(ЭтаФорма, ИмяКоманды) Экспорт
	
	ВыборатьУслугиКлиентовДляСозданияДокумента("Продажа", ЭтаФорма.Клиент,,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти