#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПерезаполнитьТаблицыНастроек();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
	Результат = Новый Структура("ВидыСегментацииКолонок, ВидыСегментацииСтрок", ВидыСегментацииКолонок, ВидыСегментацииСтрок);
	ОповеститьОВыборе(Результат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерезаполнитьТаблицыНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыСегментации.Ссылка,
		|	ЛОЖЬ КАК Используется
		|ИЗ
		|	Справочник.ВидыСегментации КАК ВидыСегментации
		|ГДЕ
		|	НЕ ВидыСегментации.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидов = РезультатЗапроса.Выгрузить();
	ВидыСегментацииКолонок.Загрузить(ТаблицаВидов);	
	ВидыСегментацииСтрок.Загрузить(ТаблицаВидов);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	СхемаКомпоновкиДанных = Отчеты.СегментацияКлиентов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		
КонецПроцедуры

#КонецОбласти
