#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды, ОткрытьФорму)

	ЗначенияЗаполнения = ПолучитьЗначенияЗаполненияДляЛистаНетрудоспособности(ПараметрКоманды, ОткрытьФорму);
	
	Если ОткрытьФорму = Истина Тогда
		ПараметрыФормы = Новый Структура("Диагнозы, ЗначенияЗаполнения", ЗначенияЗаполнения.Диагнозы, ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ЛистокНетрудоспособности.Форма.ВыборДиагнозаЛН", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ЛистокНетрудоспособности.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияЗаполненияДляЛистаНетрудоспособности(ОбъектСсылка, ОткрытьФорму)
	
	ОткрытьФорму = Истина;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Основание", ОбъектСсылка);
	//ЗначенияЗаполнения.Вставить("ПричинаЗаписи", Справочники.ПричиныЗаписиНаПрием.ПрофилактическоеЛечение);
	ЗначенияЗаполнения.Вставить("Клиент", ОбъектСсылка.Клиент);
	ЗначенияЗаполнения.Вставить("Фамилия", ОбъектСсылка.Клиент.Фамилия);
	ЗначенияЗаполнения.Вставить("Имя", ОбъектСсылка.Клиент.Имя);
	ЗначенияЗаполнения.Вставить("Отчество", ОбъектСсылка.Клиент.Отчество);
	ЗначенияЗаполнения.Вставить("ДатаРождения", ОбъектСсылка.Клиент.ДатаРождения);
	ЗначенияЗаполнения.Вставить("МедицинскаяКарта", ОбъектСсылка.МедицинскаяКарта);
		
	Если ОбъектСсылка.Метаданные().ТабличныеЧасти.Найти("Диагнозы") <> Неопределено
		И ОбъектСсылка.Диагнозы.Количество() = 1 Тогда // И ЗначениеЗаполнено(ОбъектСсылка.Диагнозы[0].Диагноз) Тогда
		ЗначенияЗаполнения.Вставить("ДиагнозПоМКБ10", ОбъектСсылка.Диагнозы[0].Диагноз);
		ЗначенияЗаполнения.Вставить("ПричинаНетрудоспособности", ОбъектСсылка.Диагнозы[0].Травма);
		ОткрытьФорму = Ложь;
	ИначеЕсли ОбъектСсылка.Диагнозы.Количество() > 1 И ЗначениеЗаполнено(ОбъектСсылка.Диагнозы[0].Диагноз) Тогда

		МассивДиагнозовОсновноеЗаболевание = Новый Массив;
		МассивДиагнозовОсложнениеОсновногоЗаболевания = Новый Массив;
		МассивДиагнозовСопутствующееЗаболевание = Новый Массив;
		МассивДиагнозовБезКлассификации = Новый Массив;
		Для Каждого СтрокаТЧ Из ОбъектСсылка.Диагнозы Цикл
			//НоваяСтрока = Перечисления.КлассификацииДиагнозов.Значение.ОсновноеЗаболевание; 
			Если СтрокаТЧ.Классификация3 = ПредопределенноеЗначение("Перечисление.КлассификацииДиагнозов.ОсновноеЗаболевание") Тогда 
				ДанныеДиагнозовОсновноеЗаболевание = Новый Структура;
				ДанныеДиагнозовОсновноеЗаболевание.Вставить("Травма",СтрокаТЧ.Травма);
				ДанныеДиагнозовОсновноеЗаболевание.Вставить("Код",СтрокаТЧ.Диагноз.КодДиагноза);
				ДанныеДиагнозовОсновноеЗаболевание.Вставить("Наименование",СтрокаТЧ.Диагноз);
				МассивДиагнозовОсновноеЗаболевание.Добавить(ДанныеДиагнозовОсновноеЗаболевание);
			ИначеЕсли СтрокаТЧ.Классификация3 = ПредопределенноеЗначение("Перечисление.КлассификацииДиагнозов.ОсложнениеОсновногоЗаболевания") Тогда
				ДанныеДиагнозовОсложнениеОсновногоЗаболевания = Новый Структура;
				ДанныеДиагнозовОсложнениеОсновногоЗаболевания.Вставить("Травма",СтрокаТЧ.Травма);
				ДанныеДиагнозовОсложнениеОсновногоЗаболевания.Вставить("Код",СтрокаТЧ.Диагноз.КодДиагноза);
				ДанныеДиагнозовОсложнениеОсновногоЗаболевания.Вставить("Наименование",СтрокаТЧ.Диагноз);
				МассивДиагнозовОсложнениеОсновногоЗаболевания.Добавить(ДанныеДиагнозовОсложнениеОсновногоЗаболевания);
			ИначеЕсли СтрокаТЧ.Классификация3 = ПредопределенноеЗначение("Перечисление.КлассификацииДиагнозов.СопутствующееЗаболевание") Тогда
				ДанныеДиагнозовСопутствующееЗаболевание = Новый Структура;
				ДанныеДиагнозовСопутствующееЗаболевание.Вставить("Травма",СтрокаТЧ.Травма);
				ДанныеДиагнозовСопутствующееЗаболевание.Вставить("Код",СтрокаТЧ.Диагноз.КодДиагноза);
				ДанныеДиагнозовСопутствующееЗаболевание.Вставить("Наименование",СтрокаТЧ.Диагноз);
				МассивДиагнозовСопутствующееЗаболевание.Добавить(ДанныеДиагнозовСопутствующееЗаболевание);
			Иначе
				ДанныеДиагнозовБезКлассификации = Новый Структура;
				ДанныеДиагнозовБезКлассификации.Вставить("Травма",СтрокаТЧ.Травма);
				ДанныеДиагнозовБезКлассификации.Вставить("Код",СтрокаТЧ.Диагноз.КодДиагноза);
				ДанныеДиагнозовБезКлассификации.Вставить("Наименование",СтрокаТЧ.Диагноз);
				МассивДиагнозовБезКлассификации.Добавить(ДанныеДиагнозовБезКлассификации);
			КонецЕсли
		КонецЦикла;
		
		Если МассивДиагнозовОсновноеЗаболевание.Количество() > 0 Тогда
			Если МассивДиагнозовОсновноеЗаболевание.Количество() > 1 Тогда
				ЗначенияЗаполнения.Вставить("Диагнозы",МассивДиагнозовОсновноеЗаболевание);
			Иначе
				ЗначенияЗаполнения.Вставить("ДиагнозПоМКБ10",МассивДиагнозовОсновноеЗаболевание[0].Наименование);
				ЗначенияЗаполнения.Вставить("ПричинаНетрудоспособности", МассивДиагнозовОсновноеЗаболевание[0].Травма);
				ОткрытьФорму = Ложь;
			КонецЕсли	
		ИначеЕсли МассивДиагнозовОсложнениеОсновногоЗаболевания.Количество() > 0 Тогда
			Если МассивДиагнозовОсложнениеОсновногоЗаболевания.Количество() > 1 Тогда
				ЗначенияЗаполнения.Вставить("Диагнозы",МассивДиагнозовОсложнениеОсновногоЗаболевания);
			Иначе
				ЗначенияЗаполнения.Вставить("ДиагнозПоМКБ10",МассивДиагнозовОсложнениеОсновногоЗаболевания[0].Наименование);
				ЗначенияЗаполнения.Вставить("ПричинаНетрудоспособности",МассивДиагнозовОсложнениеОсновногоЗаболевания[0].Травма);
				ОткрытьФорму = Ложь;
			КонецЕсли	
		ИначеЕсли МассивДиагнозовСопутствующееЗаболевание.Количество() > 0 Тогда
			Если МассивДиагнозовСопутствующееЗаболевание.Количество() > 1 Тогда
				ЗначенияЗаполнения.Вставить("Диагнозы",МассивДиагнозовСопутствующееЗаболевание);
			Иначе
				ЗначенияЗаполнения.Вставить("ДиагнозПоМКБ10",МассивДиагнозовСопутствующееЗаболевание[0].Наименование);
				ЗначенияЗаполнения.Вставить("ПричинаНетрудоспособности",МассивДиагнозовОсложнениеОсновногоЗаболевания[0].Травма);
				ОткрытьФорму = Ложь;
			КонецЕсли	
		Иначе
			
			ЗначенияЗаполнения.Вставить("Диагнозы",МассивДиагнозовБезКлассификации);
		
		КонецЕсли;
	Иначе
		ОткрытьФорму = Ложь; 
	КонецЕсли;	
	Возврат ЗначенияЗаполнения;
		
КонецФункции
#КонецОбласти
