#Область ПрограммныйИнтерфейс

// Позволяет создать физ. лицо по сотруднику.
//
// Параметры:
//  Сотрудник	 - СправочникСсылка.Сотрудники	 - сотрудник-основание.
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица. 
//
Функция СоздатьФизЛицоПоСотруднику(Сотрудник) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Наименование = ОбщегоНазначения.ФИОФизЛица(Сотрудник);
	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоНаименованию(Наименование);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		
		Возврат ФизЛицо
	
	ИначеЕсли ДопСерверныеФункцииПовтИсп.ЕстьПравоДоступа("Добавление", "Справочник.ФизическиеЛица") Тогда
	
		ФизЛицо = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ФизЛицо.Наименование = Наименование;
		ФизЛицо.Записать();
		
		Возврат ФизЛицо.Ссылка;
	Иначе
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти