
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВозрастПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВозрастОценкаДостиженияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	СтрокаПола = "";
	Если Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Женский") Тогда
		СтрокаПола = "для женщин";
	ИначеЕсли Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Мужской") Тогда
		СтрокаПола = "для мужчин";
	КонецЕсли;
	Если Объект.Возраст > 0 Тогда
		СтрокаВозраста = НРег(Элементы.ВозрастОценкаДостижения.ТекстРедактирования) + " " + ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(ДобавитьМесяц(ТекущаяДата(),Объект.Возраст * -12));
	КонецЕсли;
	Объект.Наименование = СокрЛП(СтрокаПола + " " + СтрокаВозраста);
КонецПроцедуры

#КонецОбласти