
#Область СлужебныеПроцедурыИФункции

Процедура Подключаемый_ВыполнитьШагПроверкиКМСредствамиАПИМДЛП() Экспорт
	
	КонтрольКодовМаркировкиСредствамиАПИМДЛПКлиент.ВыполнитьШагПроверкиКМ();
	
КонецПроцедуры

Процедура Подключаемый_ВыполнитьШагПроверкиКМСредствамиРВ() Экспорт
	
	КонтрольКодовМаркировкиСредствамиРВМДЛПКлиент.ВыполнитьШагПроверкиКМ();
	
КонецПроцедуры

Процедура Подключаемый_ВыполнитьШагПроверкиКМСредствамиККТ() Экспорт
	
	КонтрольКодовМаркировкиСредствамиККТМДЛПКлиент.ВыполнитьШагПроверкиКМ();
	
КонецПроцедуры

#КонецОбласти
