#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоКлассификатору();
	Элементы.Список.Обновить();
КонецПроцедуры

Процедура ЗаполнитьПоКлассификатору()
	Справочники.СтепениРодства.НачальноеЗаполнениеСтепенейРодства();
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьСКодамиЕГИСЗ(Команда)
	СопоставитьСКодамиЕГИСЗНаСервере();
	Элементы.Список.Обновить()
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СопоставитьСКодамиЕГИСЗНаСервере()
	Справочники.СтепениРодства.СопоставитьСКодамиЕГИСЗ();
КонецПроцедуры

#КонецОбласти
