
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПолучательВычисляемогоЗначения", ПолучательВычисляемогоЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование
		И ЗначениеЗаполнено(ПолучательВычисляемогоЗначения)
	Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПолучательВычисляемогоЗначения", ПолучательВычисляемогоЗначения));
		ОткрытьФорму("Справочник.ВычисляемыеЗначенияПараметров.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти