#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыАлгоритмов.Алгоритм");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидыЗаказовТипПриИзменении(Элемент)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыАлгоритмов.Алгоритм") Тогда
		Элементы.ВидыЗаказовТекстАлгоритма.Доступность = Истина;
		Элементы.ВидыЗаказовРеквизитИсточник.Видимость = Ложь;
		Элементы.ГруппаПримечания.Видимость = Истина;
		Если Объект.ВидПараметра = ПредопределенноеЗначение("Перечисление.ВидыПараметровСпецификаций.ПараметрHTML") Тогда
			Элементы.ПримечаниеПараметрHTML.Видимость = Истина;
			Элементы.ПримечаниеЗначениеЗаполнения.Видимость = Ложь;
		ИначеЕсли Объект.ВидПараметра = ПредопределенноеЗначение("Перечисление.ВидыПараметровСпецификаций.ЗначениеЗаполнения") Тогда
			Элементы.ПримечаниеПараметрHTML.Видимость = Ложь;
			Элементы.ПримечаниеЗначениеЗаполнения.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыАлгоритмов.ЗначениеРеквизита") Тогда
		Элементы.ВидыЗаказовТекстАлгоритма.Доступность = Ложь;
		Элементы.ВидыЗаказовРеквизитИсточник.Видимость = Истина;
		Элементы.ГруппаПримечания.Видимость = Ложь;
		Элементы.ВидыЗаказовРеквизитИсточник.Видимость = Объект.ВидПараметра = ПредопределенноеЗначение("Перечисление.ВидыПараметровСпецификаций.ЗначениеЗаполнения");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	ВидыЗаказовТипПриИзменении(Элементы.ВидыЗаказовТип);
	ВидПараметраПриИзменении(Элементы.ВидПараметра);
КонецПроцедуры

&НаКлиенте
Процедура ВидыЗаказовРеквизитИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Парам = Новый Структура("Вид", Объект.ВидПараметра);
	Результат = ОткрытьФормуМодально("Справочник.ПараметрыСпецификаций.Форма.ФормаВыбораЗначения", Парам);
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.РеквизитИсточник = Результат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПараметраПриИзменении(Элемент)
	Если Объект.ВидПараметра = ПредопределенноеЗначение("Перечисление.ВидыПараметровСпецификаций.ЗначениеЗаполнения") Тогда
		Элементы.Источник.Видимость = Ложь;
		Если Не ЭтаФорма.ТолькоПросмотр Тогда
			Объект.Источник = Неопределено;
		КонецЕсли;
	ИначеЕсли Объект.ВидПараметра = ПредопределенноеЗначение("Перечисление.ВидыПараметровСпецификаций.ПараметрHTML") Тогда 
		Элементы.Источник.Видимость = Истина;
		Если Не ЭтаФорма.ТолькоПросмотр Тогда
			Объект.РеквизитИсточник = "Значение";
		КонецЕсли;
	Иначе
		Элементы.Источник.Видимость = Ложь;
		Если Не ЭтаФорма.ТолькоПросмотр Тогда
			Объект.Источник = Неопределено;
		КонецЕсли;
	КонецЕсли;
	ВидыЗаказовТипПриИзменении(Элементы.ВидыЗаказовТип);
КонецПроцедуры

#КонецОбласти
