///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ИнтеграцияСПлатежнымиСистемами".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиКлиентСервер.
//
// Клиент-серверные процедуры общих настроек и статических идентификаторов:
//  - получение статусов прикладных операций оплат.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает статус операции "Выполнена".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииВыполнена() Экспорт
	
	Возврат "Выполнена";
	
КонецФункции

// Возвращает статус операции "Выполняется".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииВыполняется() Экспорт
	
	Возврат "Выполняется";
	
КонецФункции

// Возвращает статус операции "Отменена".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииОтменена() Экспорт
	
	Возврат "Отменена";
	
КонецФункции

// Возвращает статус операции "Ошибка".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииОшибка() Экспорт
	
	Возврат "Ошибка";
	
КонецФункции

// Возвращает статус операции "ТребуетсяПодтверждение".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииТребуетсяПодтверждение() Экспорт
	
	Возврат "ТребуетсяПодтверждение";
	
КонецФункции

// Формирует URL функциональной ссылки СБП для записи на NFC.
//
// Параметры:
//  ФункциональнаяСсылка - Строка - URL кассовой ссылки или платежной ссылки СБП.
//
// Возвращаемое значение:
//  Строка - функциональная ссылка СБП для записи на NFC.
//
Функция ФункциональнаяСсылкаNFC(ФункциональнаяСсылка) Экспорт
	
	РезультатURL = "";
	СтруктураURIСсылки = ОбщегоНазначенияКлиентСервер.СтруктураURI(ФункциональнаяСсылка);
	
	Если ПустаяСтрока(СтруктураURIСсылки.ПутьНаСервере) Или ПустаяСтрока(СтруктураURIСсылки.Схема) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Передан некорректный URL кассовой ссылки: %1'"),
			ФункциональнаяСсылка);
	Иначе
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Схема) Тогда
			РезультатURL = РезультатURL + СтруктураURIСсылки.Схема + "://";
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Логин) Тогда
			РезультатURL = РезультатURL + СтруктураURIСсылки.Логин + ":" + СтруктураURIСсылки.Пароль + "@";
		КонецЕсли;
		
		РезультатURL = РезультатURL + "web." + СтруктураURIСсылки.Хост;
		
		Если Не ПустаяСтрока(СтруктураURIСсылки.Порт) Тогда
			РезультатURL = РезультатURL + ":" 
				+ ?(ТипЗнч(СтруктураURIСсылки.Порт) = Тип("Число"), Формат(СтруктураURIСсылки.Порт, ""), СтруктураURIСсылки.Порт);
		КонецЕсли;
		
		РезультатURL = РезультатURL + "/" + СтруктураURIСсылки.ПутьНаСервере;
		
	КонецЕсли;
	
	Возврат РезультатURL;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает статус операции "Отклонена".
//
// Возвращаемое значение:
//  Строка - код состояния.
//
Функция СтатусОперацииОтклонена() Экспорт
	
	Возврат "Отклонена";
	
КонецФункции

#КонецОбласти
