#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		ВеличинаДолга = РаботаСКлиентамиПереопределяемый.ПолучитьВзаиморасчетыСКлиентом(ПараметрКоманды, ТекущаяДата());
	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Клиент, ВидОперации, СуммаДокумента",
																				ПараметрКоманды,
																				ПредопределенноеЗначение("Перечисление.ВидыОперацийПКО.ОплатаОтКлиента"),
																				Макс(ВеличинаДолга, 0)));
		ПринятоОт = ""; ПринятоОтИНН = ""; ПринятоОтАдрес = "";
		РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(ПараметрКоманды, ПринятоОт, ПринятоОтИНН, ПринятоОтАдрес);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ПринятоОт",		ПринятоОт);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ПринятоОтИНН",	ПринятоОтИНН);
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ПринятоОтАдрес",ПринятоОтАдрес);
																			
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

