#Область ПрограммныйИнтерфейс

// Формирует строку описания диагноза из полученных классификаций.
//
// Параметры:
//   ДанныеДиагноза - Структура - Структура данных с текстовыми полями Классификация1,Классификация2 и [Классификация3].
//   УчитыватьДавностьЗаболевания - Булево - Есть Истина, то учитывается поле Классификация3. 
//
// Возвращаемое значение:
//   Строка.
Функция ПолучитьОписаниеДиагноза(ДанныеДиагноза, УчитыватьДавностьЗаболевания = Ложь) Экспорт
	Результат = "";
	Если ЗначениеЗаполнено(ДанныеДиагноза.Классификация1) Тогда
		Результат = Результат + ДанныеДиагноза.Классификация1;	
	КонецЕсли; 
	Если ЗначениеЗаполнено(ДанныеДиагноза.Классификация2) Тогда
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = Результат + ", ";	
		КонецЕсли; 
		Результат = Результат + ДанныеДиагноза.Классификация2;	
	КонецЕсли; 
	Если УчитыватьДавностьЗаболевания И ЗначениеЗаполнено(ДанныеДиагноза.Классификация3) Тогда
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = Результат + ", ";	
		КонецЕсли; 
		Результат = Результат + ДанныеДиагноза.Классификация3;	
	КонецЕсли; 
	
	Возврат Результат;		
КонецФункции

#КонецОбласти