
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтикеткаШирина = Лев(Запись.РазмерЭтикетки, 3);
	ЭтикеткаВысота = Прав(Запись.РазмерЭтикетки, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.РазмерЭтикетки = Формат(ЭтикеткаШирина,"ЧЦ=3; ЧН=Ноль; ЧВН=") + "x" + Формат(ЭтикеткаВысота,"ЧЦ=3; ЧН=Ноль; ЧВН=");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура FTPСоединениеПутьПриИзменении(Элемент)
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запись.FTPСоединениеПуть);
	
	Запись.FTPСоединениеПуть = СтруктураURI.Хост;
	
	Если СтруктураURI.Порт <> Неопределено Тогда
		Запись.FTPСоединениеПорт = СтруктураURI.Порт;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
