
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура УпаковкиМДЛПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = РежимРедактирования;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиМДЛППриАктивизацииСтроки(Элемент)
	УстановитьОтборСпискаДолей();
КонецПроцедуры

&НаКлиенте
Процедура ДолиУпаковокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = РежимРедактирования;
КонецПроцедуры

&НаКлиенте
Процедура СверкаОстатковНажатие(Элемент)
	ОткрытьФорму("Обработка.СверкаОстатковМДЛП.Форма.СверкаОстатков",, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСоставТранспортныхУпаковокНажатие(Элемент)
	ОткрытьФорму("Обработка.ПолучитьСоставТранспортныхУпаковокМДЛП.Форма.ПолучитьСоставТранспортныхУпаковок",, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборочныйКонтрольНажатие(Элемент)
	ОткрытьФорму("Обработка.ВыборочныйКонтрольКММДЛП.Форма.ВыборочныйКонтроль",, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
	Если РежимРедактирования = Истина Тогда
		ТекстВопроса = НСтр("ru='Редактирование данных в данной форме может привести к непоправимым ошибкам и рассинхронизации данных. Включить режим редактирования?'");
		ОповещениеПродолжения = Новый ОписаниеОповещения("РежимРедактированияПриИзмененииПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеПродолжения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура УстановитьОтборСпискаДолей()
	
	ТекДанные = Элементы.УпаковкиМДЛП.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДолиУпаковок, "НомерУпаковки", ТекДанные.НомерУпаковки);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДолиУпаковок, "КлючУпаковки", ТекДанные.КлючУпаковки);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДолиУпаковок, "НомерУпаковки", "0");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзмененииПродолжение(Результат, Контекст) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		РежимРедактирования = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


