#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Движения по регистру Затраты
	Для Каждого СтрокаТабЧасти Из Распределение Цикл
		
		Движение = Движения.Затраты.Добавить();
		Движение.Регистратор  = Ссылка;
		Движение.Период		  = КонецМесяца(Дата);
		Движение.КатегорияВыработки = СтрокаТабЧасти.Специализация;
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТабЧасти ,,"НомерСтроки");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти