#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Отказ Тогда 
		Если НеобходимоЗаписатьИсториюИзменений() Тогда 
			ДобавитьЗаписьВИсториюИзменений();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИсторияИзменений.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписьВИсториюИзменений()
	
	СтрокаИсторияИзменений = ИсторияИзменений.Добавить();
	СтрокаИсторияИзменений.ДатаИзменения = ТекущаяДата();
	СтрокаИсторияИзменений.ПлановаяДата = ПлановаяДата;
	СтрокаИсторияИзменений.ФактическаяДата = ФактическаяДата;
	СтрокаИсторияИзменений.Исполнитель = Исполнитель;
	СтрокаИсторияИзменений.Принимающий = Принимающий;
	СтрокаИсторияИзменений.Ответственный = ОбщегоНазначения.ТекущийПользователь();
	СтрокаИсторияИзменений.Статус = Документы.ЗаявкаНаТехОбслуживание.ПолучитьСтатусЗаявки(ПлановаяДата, ФактическаяДата, ДатаПриемки); 
	
КонецПроцедуры

Функция НеобходимоЗаписатьИсториюИзменений()
	
	Если Ссылка.ПлановаяДата <> ПлановаяДата Или Ссылка.ФактическаяДата <> ФактическаяДата Или Ссылка.ДатаПриемки <> ДатаПриемки
		Или Ссылка.Исполнитель <> Исполнитель Или Ссылка.Принимающий <> Принимающий Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти