#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Клиент", Параметры.Клиент, ВидСравненияКомпоновкиДанных.Равно,,Истина);  
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.СсылкаПМО) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СписокНаПрохождениеМедосмотра", Параметры.СписокНаПрохождениеМедосмотра, ВидСравненияКомпоновкиДанных.НеРавно,,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);

КонецПроцедуры

#КонецОбласти
