
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков;
	Драйвер.ИмяДрайвера  = "Драйвер1СПринтерЧеков";
	Драйвер.Наименование = НСтр("ru = '1С:Принтер чеков'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ReceiptPrinterNative"; 
	Драйвер.ВерсияДрайвера = "3.1.4.6"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_KKM_1C82_54FZ"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ9X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 9.x'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C83_V9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАтолККТ54ФЗ10X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД (54-ФЗ) 10.x'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C83_V10"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверАТОЛККТ54ФЗ10XФФД12";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:ККТ с передачей данных в ОФД 10.Х (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_KKT_1C_V10"; 
	Драйвер.ВерсияДрайвера = "10.9.3.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (54-ФЗ) 4.14'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C22"; 
	Драйвер.СнятСПоддержки = Истина; 
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ415";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (54-ФЗ) 4.15'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C3"; 
	Драйвер.СнятСПоддержки = Истина; 
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ4ФФД12";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C34"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ4ФФД12_517";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (ФФД 1.2) 5.17'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "SMDrvFR1C4"; 

	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверШтрихМККТ54ФЗ4ФФД12NG";
	Драйвер.Наименование = НСтр("ru = 'ШТРИХ-М:ККТ с передачей данных в ОФД (ФФД 1.2) NG'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ShtrihM_fr_drv_ng_V1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИскраККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ИСКРА:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "IskraKKT"; 
	Драйвер.ВерсияДрайвера = "3.0.1.6"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверККСККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ККС:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Spark115F"; 
	Драйвер.ВерсияДрайвера = "1.0.0.1"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверККСККТ54ФЗ2Х";
	Драйвер.Наименование = НСтр("ru = 'ККС:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Spark130"; 
	Драйвер.ВерсияДрайвера = "3.9.0.5"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверMSTARККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'MSTAR:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "AlfaFiscalPrinter"; 
	Драйвер.ВерсияДрайвера = "1.6.3.0"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверСчетмашККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Счетмаш:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "fr_feliksrmf1c83"; 
	Драйвер.ВерсияДрайвера = "1.1.20.331"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверNEWTONККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'NEWTON:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "NewtonMicroFR54FZ"; 
	Драйвер.ВерсияДрайвера = "1.0.5.6"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверARSККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'ars:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Ars1CFiscalDriver"; 
	Драйвер.ВерсияДрайвера = "1.0.9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверДримкасККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Дримкас:ККТ с передачей данных в ОФД Вики Принт (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "VikiP"; 
	Драйвер.ВерсияДрайвера = "1.6.0.22"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнитпроККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Инитпро:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "NKR_KKT"; 
	Драйвер.ВерсияДрайвера = "1.3.0.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнитпроККТ54ФЗФФД12";
	Драйвер.Наименование = НСтр("ru = 'Инитпро:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "NKR_KKT_4"; 
	Драйвер.ВерсияДрайвера = "1.4.0.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверFITККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'FIT:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "FIT_KKT_1C83_V10"; 
	Драйвер.ВерсияДрайвера = "1.09"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнкотексККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Инкотекс:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "INCOTEX_KKT"; 
	Драйвер.ВерсияДрайвера = "1.0";     
	Драйвер.СнятСПоддержки = Истина;  
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверМЕБИУСККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'МЕБИУС:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Moebius1C_NET"; 
	Драйвер.ВерсияДрайвера = "3.1.1.3";           
	Драйвер.СнятСПоддержки = Истина;     
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверWNJIККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'WNJI:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "WnjiFiscalPrinter"; 
	Драйвер.ВерсияДрайвера = "1.3.30"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверКАСТОМФ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'КАСТОМ:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "q3xfru"; 
	Драйвер.ВерсияДрайвера = "1.94"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверВерсияТK1Ф54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Версия-Т:ККТ с передачей данных в ОФД (54-ФЗ)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "VT_KKT_V2"; 
	Драйвер.ВерсияДрайвера = "2.0.0.57"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверЭвоторККТ54ФЗ";
	Драйвер.Наименование = НСтр("ru = 'Эвотор:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "EvoKKMExtension36"; 
	Драйвер.ВерсияДрайвера = "1.9.412.3006";        
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверИнкотексККТ54ФЗФФ12";
	Драйвер.Наименование = НСтр("ru = 'Инкотекс:ККТ с передачей данных в ОФД (ФФД 1.2)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "INCOTEX_KKT_FFD12"; 
	
КонецПроцедуры

#КонецОбласти
