#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПараметровПисьма(СсылкаНаОбъект, Тема, Текст, ДокументыОтправки) Экспорт
	
	Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Исследования от %1'"), СсылкаНаОбъект.Дата);
	Текст = НСтр("ru='Во вложении данные по Вашим анализам'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	(ВЫРАЗИТЬ(Прием.Основание КАК Документ.ЗаказВоВнешнююЛабораторию)) = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	ДокументыОтправки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

#КонецОбласти