#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Филиал) Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеПодразделенияМинздрава(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктураПодразделенийАтрибуты.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПодразделений.Атрибуты КАК СтруктураПодразделенийАтрибуты
		|ГДЕ
		|	СтруктураПодразделенийАтрибуты.Ключ = ""MO_OID""
		|	И СтруктураПодразделенийАтрибуты.Значение = &MO_OID
		|	И СтруктураПодразделенийАтрибуты.Ссылка.Архив = ЛОЖЬ
		|	И СтруктураПодразделенийАтрибуты.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("MO_OID", Филиал.Организация.МедицинскаяОрганизация.OIDОрганизации);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
КонецФункции

#КонецОбласти