#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораВидаРасчета", ЭтотОбъект, ПараметрКоманды);
	
	ВладелецФормы = ?(ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения"), ПараметрыВыполненияКоманды.Источник, Неопределено);
	
	ОткрытьФорму("Справочник.ВидыКомплексныхРасчетовКлиентов.ФормаВыбора",,ВладелецФормы, ПараметрКоманды,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидаРасчета(Вид, Прием) Экспорт
	
	Если ЗначениеЗаполнено(Вид) Тогда
		
		Основание = Новый Структура("Вид, Прием", Вид, Прием);
		Основание.Вставить("НаОстатокПланаЛечения", Истина);
		ПараметрыФормы = Новый Структура("Основание", Основание);
		
		ОткрытьФорму("Документ.КомплексныйРасчетКлиента.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти