#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ДокументСписокПриСозданииНаСервере(ЭтаФорма);
	
	Если Параметры.Свойство("Тип") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид.Тип");
		ЭлементОтбора.ПравоеЗначение = Параметры.Тип;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		
		Если Параметры.Тип = Перечисления.ТипыКомплексныхРасчетовКлиентов.КомплекснаяПрограмма Тогда
			Заголовок = НСтр("ru='Комплексные программы'");
		ИначеЕсли Параметры.Тип = Перечисления.ТипыКомплексныхРасчетовКлиентов.ПредварительныйРасчет Тогда
			Заголовок = НСтр("ru='Предварительные расчеты'");
		Иначе
			Заголовок = Параметры.Тип;
		КонецЕсли;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
КонецПроцедуры
#КонецОбласти