#Область ОписаниеПеременных
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет расход по регистру.
Процедура ВыполнитьРасход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);
КонецПроцедуры // ВыполнитьРасход()

// Выполняет приход по регистру.
//
Процедура ВыполнитьПриход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);
КонецПроцедуры // ВыполнитьРасход()

#КонецОбласти
