
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Месяц) Тогда
		
		Запись.Месяц = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	Запись.Месяц = НачалоМесяца(Запись.Месяц);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запись.Месяц = ДобавитьМесяц(Запись.Месяц, Направление);
	
КонецПроцедуры

#КонецОбласти
