#Область ПрограммныйИнтерфейс

// Функция определяет значения реквизитов выбранного контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента.
//
// Возвращаемое значение:
//	Структура - реквизиты выбранного контрагента.
//
Функция ПолучитьРеквизитыКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Контрагенты.Наименование        КАК Наименование,
	|	Контрагенты.НаименованиеПолное  КАК НаименованиеПолное,
	|	Контрагенты.ИНН                 КАК ИНН,
	|	Контрагенты.КПП                 КАК КПП,
	|	Контрагенты.КодПоОКПО           КАК КодПоОКПО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = ?(Не ПустаяСтрока(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование);
		Наименование  = ?(Не ПустаяСтрока(Выборка.НаименованиеПолное), Выборка.НаименованиеПолное, Выборка.Наименование);
		ИНН           = Выборка.ИНН;
		КПП           = Выборка.КПП;
		КодПоОКПО     = Выборка.КодПоОКПО;
	Иначе
		Представление = "";
		Наименование  = "";
		ИНН           = "";
		КПП           = "";
		КодПоОКПО     = "";
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Представление", Представление);
	СтруктураРеквизитов.Вставить("Наименование" , Наименование);
	СтруктураРеквизитов.Вставить("ИНН"          , ИНН);
	СтруктураРеквизитов.Вставить("КПП"          , КПП);
	СтруктураРеквизитов.Вставить("КодПоОКПО"    , КодПоОКПО);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции
#КонецОбласти