
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаЗапроситьДанныеЗТК.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.ЗоныТаможенногоКонтроляМДЛП);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапроситьДанныеЗТК(Команда)
	
	ОткрытьФорму("Справочник.ЗоныТаможенногоКонтроляМДЛП.Форма.ЗапросДанныхЗТК");
	
КонецПроцедуры

#КонецОбласти