#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметрыФормыПоВладельцу(ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.ФормаФайлов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьПараметрыФормыПоВладельцу(Владелец)
	
	ПараметрыФормы = Новый Структура;
	ТипВладельца = ТипЗнч(Владелец);
	
	ПараметрыФормы.Вставить("Владелец", Владелец);
	Если ТипВладельца = Тип("СправочникСсылка.Клиенты") Тогда
		ПараметрыФормы.Вставить("ВключатьПредпросмотр", Истина);
		ПараметрыФормы.Вставить("ВыборФотоКлиента", Истина);
		ПараметрыФормы.Вставить("ВыводитьИерархию", Истина);
	Иначе
		ПараметрыФормы.Вставить("ВключатьПредпросмотр", Истина);
		ПараметрыФормы.Вставить("ВыборФотоКлиента", Ложь);
		ПараметрыФормы.Вставить("ВыводитьИерархию", Истина);
	КонецЕсли;

	Возврат ПараметрыФормы;
	
КонецФункции

#КонецОбласти
