///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ИнтеграцияСПлатежнымиСистемами".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиВызовСервера.
//
// Серверные процедуры настройки интеграции с платежными системами:
//  - алгоритмы настройки формы "Интернет-поддержка и сервисы".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Устанавливает значение константы ДлительностьОперацииПлатежнойСистемы.
//
// Параметры:
//  Значение - Число - количество секунд.
//
Процедура УстановитьДлительностьОперации(Значение) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиСлужебный.УстановитьДлительностьОперации(Значение);
	
КонецПроцедуры

// См. ИнтеграцияСПлатежнымиСистемами.ИнформацияДляТехническойПоддержки.
//
Функция ИнформацияДляТехническойПоддержки(ДокументОперации, ТорговаяТочка) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемами.ИнформацияДляТехническойПоддержки(
		ДокументОперации,
		ТорговаяТочка);
	
КонецФункции

// Проверяет, что введены логин и пароль интернет-поддержки.
//
// Возвращаемое значение:
//  Булево - признак того, что интернет-поддержка пользователя подключена.
//
Функция ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт 
	
	ЕстьДанныеАутентификации = 
		ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		
	Возврат ЕстьДанныеАутентификации;
	
КонецФункции

// См. ИнтеграцияСПлатежнымиСистемамиСлужебный.ВсеШаблоныСозданы.
//
Функция ВсеШаблоныСозданы() Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.ВсеШаблоныСозданы();
	
КонецФункции

// См. ИнтеграцияСПлатежнымиСистемамиСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем.
//
Функция СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем() Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем();
	
КонецФункции

// См. ИнтеграцияСПлатежнымиСистемамиСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем.
//
Процедура УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем() Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиСлужебный.УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем();
	
КонецПроцедуры

// См. ИнтеграцияСПлатежнымиСистемамиСлужебный.ПриОпределенииДоступностиИнтеграцииПоДокументуОперации.
//
Функция ПриОпределенииДоступностиИнтеграцииПоДокументуОперации(ДокументОперации) Экспорт
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.ПриОпределенииДоступностиИнтеграцииПоДокументуОперации(ДокументОперации);
КонецФункции

// См. ИнтеграцияСПлатежнымиСистемамиСлужебный.ПриОпределенииПараметровИнтеграцииДокументаОперации.
//
Функция ПриОпределенииПараметровИнтеграцииДокументаОперации(ДокументОперации) Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.ПриОпределенииПараметровИнтеграцииДокументаОперации(
		ДокументОперации);
	
КонецФункции

// См. ИнтеграцияСПлатежнымиСистемамиПовтИсп.НастройкаИнтеграцияДоступна()
//
Функция НастройкаИнтеграцияДоступна() Экспорт
	Возврат ИнтеграцияСПлатежнымиСистемамиПовтИсп.НастройкаИнтеграцияДоступна();
КонецФункции

#КонецОбласти
