#Область ПрограммныйИнтерфейс
	
// Функция производит запись данных в ИБ или просто в запись набора или менеджер записи.
//
// Параметры:
//  ЗначениеПоУмолчанию - Булево - По умолчанию Неопределено.
//	Редактирование - Булево - По умолчанию Неопределено.
//	КлючЗаписи - Булево - По умолчанию Неопределено.
//
// Возвращаемое значение:
//   Булево - Удачно произведена запись или нет.
//
Функция ЗаписатьСервер(ЗначениеПоУмолчанию = Неопределено, Редактирование = Неопределено, КлючЗаписи = Неопределено) Экспорт
	
	ЗаписыватьВРегистр = Истина;
	// Проверка на заполненность реквизитов.
	СтрокаПустыхПараметров = "";
	СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(Не ЗначениеЗаполнено(Объект), Символы.ПС + Символы.Таб + "- Владелец,", "");
	СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(Не ЗначениеЗаполнено(Вид), Символы.ПС + Символы.Таб + "- Вид,", "");
	Если Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(СокрЛП(Представление) = "", Символы.ПС + Символы.Таб + "- Значение,", "");
	ИначеЕсли Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(СокрЛП(Представление) = "", Символы.ПС + Символы.Таб + "- Адрес электронной почты,", "");
	Иначе	
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(СокрЛП(Представление) = "", Символы.ПС + Символы.Таб + "- " + Тип + ",", "");
	КонецЕсли;
	
	Если СтрокаПустыхПараметров <> "" Тогда
		СтрокаПустыхПараметров  = "Не заполнены следующие поля: " + Лев(СтрокаПустыхПараметров, СтрДлина(СтрокаПустыхПараметров)-1);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись контактной информации невозможна!");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаПустыхПараметров);
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) И Объект.ЭтоГруппа Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя использовать группу в качестве владельца контактной информации.");
		Возврат Ложь;
	КонецЕсли;
	
	Если Редактирование И КлючЗаписи <> Неопределено Тогда
		
		Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
		Запись.Прочитать();
		ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
		Запись.Тип = ЭтотОбъект.Вид.Тип;
		Запись.Записать();
	Иначе
		Попытка
			Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект);
			Запись.Тип = ЭтотОбъект.Вид.Тип;
			Запись.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
