
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мИмен = ПолучитьСписокНаименований();
	Для Каждого Имя Из мИмен Цикл
		НоваяСтрока = ТаблицаНаименований.Добавить();
		НоваяСтрока.Наименование = Имя;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	ЗаписатьИмена();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Оповещение = Новый ОписаниеОповещения("ОчиститьПродолжить", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Имена будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ЗаписатьИмена();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокНаименований()
	
	Возврат Константы.Сканирование_СтандартныеИменаСканов.ПолучитьСтандартныеИменаСканов();
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИмена()
	
	мИмен = Новый Массив;
	Для Каждого Имя Из ТаблицаНаименований Цикл
		Если ЗначениеЗаполнено(Имя.Наименование) Тогда
			мИмен.Добавить(Имя.Наименование);
		КонецЕсли;
	КонецЦикла;
	ЗаписатьИменаВКонстанту(мИмен);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьИменаВКонстанту(мИмен)
	Константы.Сканирование_СтандартныеИменаСканов.ЗаписатьИмена(мИмен);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПродолжить(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТаблицаНаименований.Очистить();
	    ЗаписатьИмена();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
