#Область ПрограммныйИнтерфейс

// Организация по умолчанию для подсистемы электронных подписей.
//
// Возвращаемое значение:
//   ОпределяемыйТип.Организация
//
Функция ОрганизацияПоУмолчанию() Экспорт 
	
	Возврат УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя().Организация;

КонецФункции

// Если организация в базе одна, возвращает ее, иначе пустую ссылку.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации.
//
Функция ЕдинственнаяОрганизация() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления"
	;
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество() = 1 Тогда
		Выб.Следующий();
		Возврат Выб.Ссылка;
	Иначе
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя().Организация;

КонецФункции

#КонецОбласти