#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормамиСервер.ДокументСписокПриСозданииНаСервере(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.ТолькоТекущие Тогда
		ОтборТекущиеЗаявки(Неопределено);	
	КонецЕсли;
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборТекущиеЗаявки(Команда)
	
	Кнопка = Элементы.ФормаОтборТекущиеЗаявки;
	Кнопка.Пометка = Не Кнопка.Пометка;
	
	Если Кнопка.Пометка Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("ДатаНачала", НачалоДня(ТекущаяДата()), Список, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		РаботаСФормамиКлиент.УстановитьОтборСписка("ПометкаУдаления", Ложь, Список);
	Иначе
		РаботаСФормамиКлиент.СнятьОтборСписка("ДатаНачала", Список);
		РаботаСФормамиКлиент.СнятьОтборСписка("ПометкаУдаления", Список);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти