#Область ОбработчикиСобытий

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
КонецПроцедуры

Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолучитьЗначениеПараметра("Прейскурант")) Тогда
		
		Прейскурант = УправлениеНастройками.ПараметрУчета("ОсновнойПрейскурант");
		ЗаполнитьЗначениеПараметра(НовыеНастройкиКД, "Прейскурант", Прейскурант);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УниверсальныеМеханизмыСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеПараметра(ИмяПараметра)
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрДанных <> Неопределено Тогда
		Возврат ПараметрДанных.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьЗначениеПараметра(НовыеНастройкиКД, ИмяПараметра, ЗначениеПараметра)
	
	Попытка
		ПараметрДанных = НовыеНастройкиКД.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
		Если ПараметрДанных <> Неопределено Тогда
			ПараметрДанных.Значение = ЗначениеПараметра;
		КонецЕсли;
		
		ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
		Если ПараметрДанных <> Неопределено Тогда
			ПараметрДанных.Значение = ЗначениеПараметра;
		КонецЕсли;
	Исключение КонецПопытки;

КонецПроцедуры

#КонецОбласти
