#Область ПрограммныйИнтерфейс

// Выполнить загрузку встроенных регламентированных стандартов.
//
// Параметры:
//  ТипРегламентированногоСтандарта	 - Число - тип регламентированного стандарта.
//
Процедура ЗагрузкаРегламентированныхСтандартов(ТипыРегламентированныхСтандартов) Экспорт
	
	Если ТипыРегламентированныхСтандартов.Найти(1) <> Неопределено Тогда
		ПометитьВсеТекущиеРегламентированныеСтандартыКакУстаревшие(1);
		ЗагрузитьСтандартыЛечения("РегламентированныеСтандартыПервичнойПомощи");
	КонецЕсли;
	
	Если ТипыРегламентированныхСтандартов.Найти(2) <> Неопределено Тогда
		ПометитьВсеТекущиеРегламентированныеСтандартыКакУстаревшие(2);
		ЗагрузитьСтандартыЛечения("РегламентированныеСтандартыСпециализированнойПомощи");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьСтандартыЛечения(ИмяМакета)
	
	ДвоичныеДанныеВыгрузки = Справочники.СтандартыЛечения.ПолучитьМакет(ИмяМакета);
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(ДвоичныеДанныеВыгрузки, Истина);
	
КонецПроцедуры

Процедура ПометитьВсеТекущиеРегламентированныеСтандартыКакУстаревшие(ТипРегламентированногоСтандарта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтандартыЛечения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СтандартыЛечения КАК СтандартыЛечения
	               |ГДЕ
	               |	СтандартыЛечения.ВидСтандарта
	               |	И СтандартыЛечения.ТипРегламентированногоСтандарта = &ТипРегламентированногоСтандарта
	               |	И СтандартыЛечения.РучноеРедактирование = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТипРегламентированногоСтандарта", ТипРегламентированногоСтандарта);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		СтандартОбъект = Результат.Ссылка.ПолучитьОбъект();
		СтандартОбъект.ТипРегламентированногоСтандарта = 999;
		СтандартОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти