#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Для Каждого СтрокаНазначение Из ЭтотОбъект.Назначения Цикл 
		Если Не ЗначениеЗаполнено(СтрокаНазначение.ВидНазначения) Тогда 
			СтрокаНазначение.ВидНазначения = Перечисления.ВидыНазначений.Процедура;
		КонецЕсли;
	КонецЦикла;
	
	Если Не (ЭтотОбъект.ЭтоГруппа Или ЭтотОбъект.ВидСтандарта) Тогда
		Для Каждого Назначение Из ЭтотОбъект.Назначения Цикл
			Назначение.НоменклатураМедицинскихУслуг = Справочники.НоменклатураМедицинскихУслуг.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДатаОбновления = Дата(1,1,1);
	
КонецПроцедуры

#КонецОбласти
