
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Фильтр = "(*.xml)|*.xml"; 
	
	ДиалогВыбораФайла.Заголовок = "Выберите файл";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ДвоичныеДанныеФайла = ЭкспортироватьСервер(ПараметрКоманды);
		ДвоичныеДанныеФайла.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);
		
		ПоказатьПредупреждение(, "Операция завершена!");
		
	КонецЕсли;
 	
КонецПроцедуры

&НаСервере
Функция ЭкспортироватьСервер(ПараметрКоманды)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	Справочники.ШаблоныHTML.Экспортировать(ПараметрКоманды, ВременныйФайл);
	Возврат Новый ДвоичныеДанные(ВременныйФайл);
		
КонецФункции