#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(ТекущиеДанные.Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбработанным(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОтметитьОбработаннымНаСервере(ТекущиеДанные.Объект);
		Элементы.Список.Обновить();
		Оповестить("ОбработанКонфликтРБД");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтметитьОбработаннымНаСервере(Объект)

	Запись = РегистрыСведений.ОшибкиОбменовДанными.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Обработан = Истина;
		Запись.ДатаОбработки = ТекущаяДата();
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
