#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимРазметкиКлиентскойОбластиШаблоновПриема = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РежимРазметкиКлиентскойОбластиШаблоновПриема");
	
	Если Не ЗначениеЗаполнено(РежимРазметкиКлиентскойОбластиШаблоновПриема) Тогда
		
		Элементы.КлиентскаяШапка.Видимость = Ложь;
		Элементы.МедицинскаяШапка.Заголовок = НСтр("ru='Шаблон общей шапки'");
		Элементы.ШапкаШаблона.ОтображатьЗаголовок = Ложь;
		
	КонецЕсли;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьШаблоныHTMLБезПараметров());
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.МедицинскаяШапка.ПараметрыВыбора = НовыеПараметры;
	Элементы.КлиентскаяШапка.ПараметрыВыбора = НовыеПараметры;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьШаблоныHTMLБезПараметров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныHTML.Ссылка КАК ШаблонHTML,
		|	ШаблоныHTML.СоответствияПараметрам.(
		|		КОЛИЧЕСТВО(НомерСтроки) КАК НомерСтроки
		|	) КАК СоответствияПараметрам
		|ИЗ
		|	Справочник.ШаблоныHTML КАК ШаблоныHTML
		|ГДЕ
		|	НЕ ШаблоныHTML.СоответствияПараметрам.НомерСтроки В (1)
		|	И НЕ ШаблоныHTML.ТекстHTML ПОДОБНО ""%</tt>%""
		|	И ШаблоныHTML.ВидШаблона = ЗНАЧЕНИЕ(Перечисление.ВидыШаблонов.HTMLШаблон)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШаблонHTML");
	
КонецФункции

#КонецОбласти