#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("РабочееМесто", Параметры.РабочееМесто);
	Список.Параметры.УстановитьЗначениеПараметра("Филиал", Параметры.Филиал);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(Параметры.Филиал, "Организация", Неопределено));
	Список.Параметры.УстановитьЗначениеПараметра("Касса", Параметры.Касса);
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяКасса", НЕ ЗначениеЗаполнено(Параметры.Касса));
КонецПроцедуры

#КонецОбласти