#Область СлужебныйПрограммныйИнтерфейс


Функция ПрочитатьЗаголовкиDICOM(ДанныеDICOM) Экспорт
	Перем Заголовки;

	Заголовки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеDICOM, РазделительЗаголовковDICOM());


	Данные = Новый Массив;
	Для каждого Заголовок Из Заголовки Цикл
		Если ЗначениеЗаполнено(Заголовок) Тогда
			Данные.Добавить(ПрочитатьЗаголовокDICOM(Заголовок));
		КонецЕсли;
	КонецЦикла;
	Возврат Данные;
КонецФункции

Функция ПрочитатьЗаголовокDICOM(Заголовок) Экспорт
	ДанныеЗаголовка = Новый Соответствие;
	Для Номер = 1 По СтрЧислоСтрок(Заголовок) Цикл
		Строка = СтрПолучитьСтроку(Заголовок, Номер);
		Код = ПолучитьКод(Строка);
		Значение = ПолучитьЗначение(Строка);
		Если ЗначениеЗаполнено(Код) Тогда
			ДанныеЗаголовка.Вставить(Код, Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат ДанныеЗаголовка;
КонецФункции

Функция РазделительЗаголовковDICOM()
	Возврат "@delim@";
КонецФункции

Функция ПолучитьКод(Строка)
	Начало = Найти(Строка, "(");
	Возврат Сред(Строка, Начало + 1, ДлинаКода());
КонецФункции

Функция ПолучитьЗначение(Строка)
	Значение = Неопределено;
	Начало = Найти(Строка, "[");
	Конец = СтроковыеФункцииКлиентСервер.НайтиСимволСКонца(Строка, "]");
	Если Начало > 0 И Конец > 0 Тогда
		Значение = СокрЛП(Сред(Строка, Начало + 1, Конец - Начало - 1));
	КонецЕсли;
	Возврат Значение;
КонецФункции

Функция ДлинаКода()
	Возврат 9;
КонецФункции




Функция ДатаИсследования(Исследование) Экспорт
	Попытка
		Возврат Дата(Исследование.Получить(DICOMРаботаСДанными.КодStudyDate()));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
Функция ВремяИсследования(Исследование) Экспорт
	Перем Время;
	Попытка
		Время = Лев(Исследование.Получить(DICOMРаботаСДанными.КодStudyTime()), 6);
		Возврат ?(ЗначениеЗаполнено(Время), Дата("00010101" + Время), '00010101000000');
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ДатаСерии(Исследование) Экспорт
	Попытка
		Возврат Дата(Исследование.Получить(DICOMРаботаСДанными.КодSeriesDate()));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
Функция ВремяСерии(Исследование) Экспорт
	Перем Время;
	Попытка
		Время = Лев(Исследование.Получить(DICOMРаботаСДанными.КодSeriesTime()), 6);
		Возврат ?(ЗначениеЗаполнено(Время), Дата("00010101" + Время), '00010101000000');
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
Функция ДатаРожденияПациента(Исследование) Экспорт
	Перем Дата;
	Дата = Исследование.Получить(DICOMРаботаСДанными.КодPatientBirthDate());
	Возврат ?(ЗначениеЗаполнено(Дата), Дата(Дата), '00010101000000');
КонецФункции
Функция ПолПациента(Исследование) Экспорт
	Перем Пол;
	Пол = СокрЛП(Исследование.Получить(DICOMРаботаСДанными.КодPatientSex()));
	Возврат ?(Пол = "M", "муж", ?(Пол = "F", "жен", Неопределено));
КонецФункции





Функция КодAccessionNumber() Экспорт
	Возврат "0008,0050";
КонецФункции

Функция КодAllergies() Экспорт
	Возврат "0010,2110";
КонецФункции

Функция КодPatientBirthDate() Экспорт
	Возврат "0010,0030";
КонецФункции

Функция КодCommentsOnScheduledProcedureStep() Экспорт
	Возврат "0040,0400";
КонецФункции

Функция КодMedicalAlerts() Экспорт
	Возврат "0010,2000";
КонецФункции

Функция КодModality() Экспорт
	Возврат "0008,0060";
КонецФункции

Функция КодPatientID() Экспорт
	Возврат "0010,0020";
КонецФункции

Функция КодPatientName() Экспорт
	Возврат "0010,0010";
КонецФункции

Функция КодPreMedication() Экспорт
	Возврат "0040,0012";
КонецФункции

Функция КодRequestedContrastAgent() Экспорт
	Возврат "0032,1070";
КонецФункции

Функция КодRequestedProcedureDescription() Экспорт
	Возврат "0032,1060";
КонецФункции

Функция КодRequestedProcedureId() Экспорт
	Возврат "0040,1001";
КонецФункции

Функция КодRequestedProcedurePriority() Экспорт
	Возврат "0040,1003";
КонецФункции

Функция КодRequestingPhysician() Экспорт
	Возврат "0032,1032";
КонецФункции

Функция КодScheduledPerformingPhysiciansName() Экспорт
	Возврат "0040,0006";
КонецФункции

Функция КодScheduledProcedureStepDescription() Экспорт
	Возврат "0040,0007";
КонецФункции

Функция КодScheduledProcedureStepId() Экспорт
	Возврат "0040,0009";
КонецФункции


Функция КодScheduledProcedureStepLocation() Экспорт
	Возврат "0040,0011";
КонецФункции

Функция КодScheduledProcedureStepStartDate() Экспорт
	Возврат "0040,0002";
КонецФункции

Функция КодScheduledProcedureStepStartTime() Экспорт
	Возврат "0040,0003";
КонецФункции

Функция КодScheduledStationAETitle() Экспорт
	Возврат "0040,0001";
КонецФункции

Функция КодScheduledStationName() Экспорт
	Возврат "0040,0010";
КонецФункции

Функция КодPatientSex() Экспорт
	Возврат "0010,0040";
КонецФункции

Функция КодStudyInstanceUID() Экспорт
	Возврат "0020,000d";
КонецФункции




Функция КодQueryRetrieveLevel() Экспорт
	Возврат "0008,0052";
КонецФункции

Функция КодStudyDate() Экспорт
	Возврат "0008,0020";
КонецФункции

Функция КодSeriesDate() Экспорт
	Возврат "0008,0021";
КонецФункции

Функция КодSeriesTime() Экспорт
	Возврат "0008,0031";
КонецФункции



Функция КодSeriesInstanceUID() Экспорт
	Возврат "0020,000e";
КонецФункции

Функция КодSeriesNumber() Экспорт
	Возврат "0020,0011";
КонецФункции

Функция КодStudyTime() Экспорт
	Возврат "0008,0030";
КонецФункции

Функция КодStudyDescription() Экспорт
	Возврат "0008,1030";
КонецФункции

Функция КодPatientComments() Экспорт
	Возврат "0010,4000";
КонецФункции

Функция КодPerformedProcedureStepStatus() Экспорт
	Возврат "0040,0252";
КонецФункции


Функция КодInstanceNumber() Экспорт
	Возврат "0020,0013";
КонецФункции

Функция КодNumberOfStudyRelatedInstances() Экспорт
	Возврат "0020,1208";
КонецФункции

Функция КодNumberOfSeriesRelatedInstances() Экспорт
	Возврат "0020,1209";
КонецФункции



#КонецОбласти
