
////////////////////////////////////////////////////////////////////////////////
//
// ИнвентаризацияМДЛПКлиент: процедуры и функции подсистемы "ИнтеграцияМДЛП.Инвентаризация"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОповеститьОбИзмененииУведомленияИнвентаризации(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ДокументИнвентаризации) Тогда
		Возврат;
	КонецЕсли;
	
	Параметр = Новый Структура;
	Параметр.Вставить("ДокументИнвентаризации", Объект.ДокументИнвентаризации);
	Оповестить("ЗаписьУведомленияИнвентаризацииМДЛП", Параметр, Объект.Ссылка);
	
КонецПроцедуры

Процедура ПослеЗаписи(Объект, ПараметрыЗаписи) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ДокументИнвентаризации) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ДокументИнвентаризации", Объект.ДокументИнвентаризации);
	Оповестить("ЗаписьУведомленияИнвентаризацииМДЛП", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти
