#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Импортировать(Команда)
		
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр = "(*.xml)|*.xml"; 
	
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда

		ФайлДД = Новый ДвоичныеДанные(ДиалогФыбораФайла.ПолноеИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(ФайлДД);
		ИмпортироватьСервер(Адрес);
		
	КонецЕсли;
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИмпортироватьСервер(АдресВременногоХранилища);
	ФайлДД = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Справочники.ШаблоныПечати.Импортировать(ФайлДД);	
КонецПроцедуры
#КонецОбласти