#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДоступныеПоляПоВыбранным();
	НастроитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВВыбранные(Команда)
	
	ПолеСубъекта = Элементы.ДоступныеПоля.ТекущиеДанные;
	Если ПолеСубъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыбранныеПоля.Добавить(ПолеСубъекта.Значение);
	ДоступныеПоля.Удалить(ДоступныеПоля.НайтиПоИдентификатору(Элементы.ДоступныеПоля.ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьИзВыбранных(Команда)
	
	ПолеСубъекта = Элементы.ВыбранныеПоля.ТекущиеДанные;
	Если ПолеСубъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДоступныеПоля.Добавить(ПолеСубъекта.Значение);
	ВыбранныеПоля.Удалить(ВыбранныеПоля.НайтиПоИдентификатору(Элементы.ВыбранныеПоля.ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(ВыбранныеПоля.ВыгрузитьЗначения());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДоступныеПоляПриАктивизацииСтроки(Элемент)
	НастроитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляПриАктивизацииСтроки(Элемент)
	НастроитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПеренестиВВыбранные(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеПоляЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УбратьИзВыбранных(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеПоляПоВыбранным() 
	Для Каждого ПолеСубъекта Из Перечисления.эцпПоляСубъекта Цикл
		Если ВыбранныеПоля.НайтиПоЗначению(ПолеСубъекта) = Неопределено Тогда
			ДоступныеПоля.Добавить(ПолеСубъекта);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимость()
	
	ДоступноеПоле = Элементы.ДоступныеПоля.ТекущиеДанные;
	ВыбранноеПоле = Элементы.ВыбранныеПоля.ТекущиеДанные;
	
	Элементы.ПеренестиВВыбранные.Доступность = (ДоступноеПоле <> Неопределено);
	Элементы.УбратьИзВыбранных.Доступность = (ВыбранноеПоле <> Неопределено);
	
КонецПроцедуры

#КонецОбласти
