#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборПоНормам();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборПоНормам();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НормыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	РаботаСДиалогамиКлиент.ПередНачаломДобавленияВПодчиненныйСписокНаФормеОбъекта(ЭтаФорма, Элемент, Отказ); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборПоНормам()
	РаботаСФормамиКлиент.УстановитьОтборСписка("ВидГрафика", Объект.Ссылка, Нормы);
КонецПроцедуры

#КонецОбласти