#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлюч());
 	ОткрытьФорму("РегистрСведений.НастройкиМедицинскогоУчета.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКлюч()
	Отбор = Новый Структура;
	Возврат РегистрыСведений.НастройкиМедицинскогоУчета.СоздатьКлючЗаписи(Отбор);
КонецФункции

#КонецОбласти
