#Область СлужебныеПроцедурыИФункции

// Открывает форму дополнительного отчета с заданным вариантом.
//
// Параметры:
//   Ссылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка дополнительного отчета.
//   КлючВарианта - Строка - Имя варианта дополнительного отчета.
//
Процедура ПриПодключенииОтчета(ПараметрыОткрытия) Экспорт
	ВариантыОтчетов.ПриПодключенииОтчета(ПараметрыОткрытия);
КонецПроцедуры

// См. ОтчетыСервер.ПараметрыВыбораТипа.
Функция ПараметрыВыбораТипа(Знач Тип, Знач ПараметрыНастройки) Экспорт
	Возврат ОтчетыСервер.ПараметрыВыбораТипа(Тип, ПараметрыНастройки);
КонецФункции

#КонецОбласти
