#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Если Ложь Тогда
		ДокументРезультат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);	

	ДеревоРезультат = Новый ДеревоЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	СтруктураКолонок = Новый Структура;
	Для Каждого Колонка Из ДеревоРезультат.Колонки Цикл
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			СтруктураКолонок.Вставить(Колонка.Имя, 0);
		КонецЕсли;
	КонецЦикла;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Период = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если Период <> Неопределено Тогда
		ОбластьШапка.Параметры.Год = Формат(Период.Значение.ДатаОкончания, "ДФ=yyyy");
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОбластьДанныеОрганизации = Макет.ПолучитьОбласть("ДанныеОрганизации");
	ДанныеОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(ПланыОбмена.Полный.ЭтотУзел());
	ОбластьДанныеОрганизации.Параметры.НаименованиеОрганизации = ДанныеОрганизации.НазваниеОрганизации;
	ОбластьДанныеОрганизации.Параметры.ОКПО = ДанныеОрганизации.ОКПО;
	ОбластьДанныеОрганизации.Параметры.ПочтовыйАдресОрганизации = ДанныеОрганизации.Адрес;		
	ДокументРезультат.Вывести(ОбластьДанныеОрганизации);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Дети (до 14)
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы1");
	ОбластьШапкаТаблицы.Параметры.Номер = 1;
	ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы = "Дети (до 14 лет включительно)";
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("До14") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы1До14");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы1До14");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);			
			СтрокаТаблицы.Параметры.До14 = РезПоиска.До14;
			СтрокаТаблицы.Параметры.До14Впервые = РезПоиска.До14Впервые;	
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы1До14");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы2");
	ОбластьШапкаТаблицы.Параметры.Номер = 1;
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("Факторы") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы2До14");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы2До14");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);
			СтрокаТаблицы.Параметры.До14 = РезПоиска.До14;	
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы2До14");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Подростки (15-17)
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы1От15До17");
	ОбластьШапкаТаблицы.Параметры.Номер = 2;
	ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы = "Подростки (15-17 лет включительно)";
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("С15По17") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы1От15До17");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы1От15До17");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);
			СтрокаТаблицы.Параметры.С15По17 = РезПоиска.С15По17;
			СтрокаТаблицы.Параметры.С15По17Впервые = РезПоиска.С15По17Впервые;
			СтрокаТаблицы.Параметры.С15По17Юноши = РезПоиска.С15По17Юноши;
			СтрокаТаблицы.Параметры.С15По17ВпервыеЮноши = РезПоиска.С15По17ВпервыеЮноши;
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы1От15До17");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы2");
	ОбластьШапкаТаблицы.Параметры.Номер = 2;
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("Факторы") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы2От15До17");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы2От15До17");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);
			СтрокаТаблицы.Параметры.С15По17 = РезПоиска.С15По17;	
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы2От15До17");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Взрослые с 18
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы1");
	ОбластьШапкаТаблицы.Параметры.Номер = 3;
	ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы = "Взрослые (18 лет и старше)";
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("С18") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы1Старше18");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы1Старше18");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);
			СтрокаТаблицы.Параметры.С18 = РезПоиска.С18;
			СтрокаТаблицы.Параметры.С18Впервые = РезПоиска.С18Впервые;	
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы1Старше18");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы2");
	ОбластьШапкаТаблицы.Параметры.Номер = 3;
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Параметр Из ПолучитьПараметрыСтраницы("Факторы") Цикл
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы2Старше18");
		СтрокаТаблицы.Параметры.Заполнить(Параметр);
		ОбластьНаим = СтрокаТаблицы.Область("ТекстПунктаТаблицы2Старше18");
		Если Параметр.Свойство("Имя") Тогда
			РезПоиска = НайтиПоДиапазону(ДеревоРезультат, Параметр.Имя, СтруктураКолонок);
			СтрокаТаблицы.Параметры.С18 = РезПоиска.С18;	
			ОбластьНаим.Отступ = СтрЧислоВхождений(Параметр.НомерСтроки, ".") * 2;
			ВсяОбласть = СтрокаТаблицы.Область("ВсяОбластьСтрокиТаблицы2Старше18");
			ВсяОбласть.Шрифт = Новый Шрифт(ВсяОбласть.Шрифт, , 9, Параметр.Жирный);
		Иначе
			ОбластьНаим.Отступ = Параметр.Отступ;	
		КонецЕсли;
		ДокументРезультат.Вывести(СтрокаТаблицы);
	КонецЦикла;
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	ДокументРезультат.Вывести(ОбластьПодписи);
	
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиПоКодуВДеревеДиагнозов(ДеревоДиагнозов, Код, Поле = Неопределено)
	
	Для Каждого Строка Из ДеревоДиагнозов.Строки Цикл
		
		Если Строка.Ссылка.Код = Код Тогда
			Возврат ?(Поле = Неопределено, Строка, Строка[Поле]);
		Иначе
			ПоискВВетви = НайтиПоКодуВДеревеДиагнозов(Строка, Код, Поле);
			Если ПоискВВетви <> Неопределено И ПоискВВетви <> 0 Тогда
				Возврат ?(Поле = Неопределено, ПоискВВетви, ПоискВВетви[Поле]);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если Поле = Неопределено Или Поле = "Ссылка" Тогда
		Возврат Неопределено;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция НайтиПоДиапазону(ДеревоДиагнозов, Диапазон, Знач СтруктураСвертка)
	
	Для Каждого элСтруктуры Из СтруктураСвертка Цикл
		СтруктураСвертка[элСтруктуры.Ключ] = 0;
	КонецЦикла;
	
	// Разбиваем диапазон, если их несколько
	мсДиапазоны = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Диапазон, "___");
	Для Каждого элДиапазон Из мсДиапазоны Цикл
		элДиапазон = СтрЗаменить(СтрЗаменить(элДиапазон,"__","."),"_","-");
		// Получаем начало и конец диапазона
		НачКон = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(элДиапазон,"-");
		Если НачКон.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли НачКон.Количество() = 1 Тогда
			НачКон.Добавить(НачКон[0]);
		КонецЕсли;
		ПросуммироватьДиагнозыВДиапазоне(СтруктураСвертка, ДеревоДиагнозов, элДиапазон, НачКон);	
	КонецЦикла;
	
	Возврат СтруктураСвертка;
	
КонецФункции

Процедура ПросуммироватьДиагнозыВДиапазоне(Результат, ДеревоДиагнозов, элДиапазон, НачКон)
	
	Для Каждого Строка Из ДеревоДиагнозов.Строки Цикл
		
		НаимДиапазон = "";
		ДиапазонЭлемента = Новый Массив;
		
		Если Не ЗначениеЗаполнено(Строка.Диагноз) Тогда
			Продолжить;
		КонецЕсли;
		
		КодДиагноза = Строка.Диагноз.КодДиагноза;
		ДиапазонЭлемента = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодДиагноза, "-");
		Если ДиапазонЭлемента.Количество() = 1 Тогда // Если не диапазон - расширяем до диапазона из двух одинаковых
			ДиапазонЭлемента.Добавить(ДиапазонЭлемента[0]);
		КонецЕсли;		
		
		ВходВДиапазон = ВходитВДиапазон(НачКон, ДиапазонЭлемента);
		Если ВходВДиапазон = 0 Тогда
			Для Каждого кзРез Из Результат Цикл
				Результат.Вставить(кзРез.Ключ, кзРез.Значение + Строка[кзРез.Ключ]);
			КонецЦикла;
		ИначеЕсли ВходВДиапазон = 2 Тогда
			Продолжить;
		ИначеЕсли ВходВДиапазон = 1 И Строка.Диагноз.ЭтоГруппа Тогда
			ПросуммироватьДиагнозыВДиапазоне(Результат, Строка, элДиапазон, НачКон);
		КонецЕсли;		

		Если НачКон[1] = ДиапазонЭлемента[1] Тогда // Конец диапазона нашли
			Возврат;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Проверяет пересечение двух диапазонов
// 0 - элемент полностью в диапазоне
// 1 - диапазон частично или полностью в элементе
// 2 - не пересекаются.
Функция ВходитВДиапазон(Диапазон, ДиапазонЭлемента)
	
	Если СравнитьСтроки(ДиапазонЭлемента[0], Диапазон[1]) <= 0 И СравнитьСтроки(ДиапазонЭлемента[1], Диапазон[0]) >= 0 Тогда
		Если СравнитьСтроки(Диапазон[0], ДиапазонЭлемента[0]) <= 0 И СравнитьСтроки(Диапазон[1], ДиапазонЭлемента[1]) >= 0 И
			(СтрДлина(Диапазон[0]) = СтрДлина(ДиапазонЭлемента[0]) Или СтрДлина(Диапазон[1]) = СтрДлина(ДиапазонЭлемента[1])) 
		Тогда // Элемент полностью в диапазоне
			Возврат 0;
		Иначе
			Возврат 1;
		КонецЕсли;	
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

Функция СравнитьСтроки(Знач Стр1, Знач Стр2)
	
	Если Стр1 = Стр2 Тогда
		Возврат 0;
	Иначе
		Стр1ОдинДлины = Стр1;
		Стр2ОдинДлины = Стр2;
		Если СтрДлина(Стр1) > СтрДлина(Стр2) Тогда
			Стр1ОдинДлины = Лев(Стр1, СтрДлина(Стр2));
		Иначе
			Стр2ОдинДлины = Лев(Стр2, СтрДлина(Стр1));
		КонецЕсли;
		
		Если Стр1ОдинДлины = Стр2ОдинДлины Тогда
			Возврат 0;
		ИначеЕсли Стр1ОдинДлины > Стр2ОдинДлины Тогда 
			Возврат 1;
		Иначе
			Возврат -1;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыСтраницы(Имя)
	
	мсПараметры = Новый Массив;
	Если Имя = "До14" Тогда
		
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_T98", "Всего:", "A00-T98", "1.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "в том числе:", 5));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_B99", "некоторые инфекционные и паразитарные болезни", "A00-B99", "2.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "C00_D48", "новообразования", "C00-D48", "3.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D89", "болезни крови,  кроветворных органов и отдельные нарушения, вовлекающие иммунный механизм", "D50-D89", "4.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D64", "анемия", "D50-D64", "4.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65_D68", "нарушения свертываемости крови", "D65-D68", "4.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65", "диссеминированное внутрисосудистое свертывание крови (синдром дефибринации)", "D65", "4.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D80_D89", "отдельные нарушения, вовлекающие иммунный механизм", "D80-D89", "4.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E00_E90", "болезни эндокринной системы, расстройства питания и  нарушения обмена веществ", "E00-E90", "5.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E05", "тиреотоксикоз (гипертиреоз)", "E05", "5.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10_E14", "сахарный диабет", "E10-E14", "5.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10", "инсулинозависимый сахарный диабет", "E10", "5.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E11", "инсулинонезависимый сахарный диабет", "E11", "5.2.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E66", "ожирение", "E66", "5.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "F00_F99", "психические расстройства и расстройства поведения", "F00-F99", "6.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G00_G99", "болезни нервной системы", "G00-G99", "7.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G40___G41", "эпилепсия, эпилептический статус", "G40-G41", "7.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G50_G72", "болезни периферической нервной системы", "G50-G72", "7.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G80", "детский церебральный паралич", "G80", "7.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H00_H59", "болезни глаза и его придаточного аппарата", "H00-H59", "8.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H52__1", "миопия", "H52.1", "8.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H60_H95", "болезни уха и сосцевидного отростка", "H60-H95", "9.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H65__2_H65__9___H66__1_H66__9", "хронический отит", "H65.2-9, H66.1-9ч.", "9.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I99", "болезни системы кровообращения", "I00-I99", "10.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I02", "острая ревматическая лихорадка", "I00-I02", "10.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I09", "хронические ревматические болезни сердца", "I05-I09", "10.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I08", "ревматические пороки клапанов", "I05-I08", "10.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I10_I13", "болезни, характеризующиеся повышенным кровяным давлением", "I10-I13", "10.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J00_J99", "болезни органов дыхания", "J00-J99", "11.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J12_J18", "пневмонии", "J12-J18", "11.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J30__1", "аллергический ринит (поллиноз)", "J30.1", "11.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J31_J32", "хронический фарингит, назофарингит, синусит, ринит", "J31-J32", "11.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J35", "хронические болезни миндалин и аденоидов", "J35", "11.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J40_J43", "бронхит хронический и неутонченный, эмфизема", "J40-J43", "11.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J44___J47", "другая хроническая обструктивная легочная, бронхоэктатическая болезнь", "J44, J47", "11.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J45_J46", "астма, астматический статус", "J45-J46", "11.7", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J84_J94", "интерстициальные, гнойные легочные болезни, другие болезни плевры", "J84-J94", "11.8", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K00_K93", "болезни органов пищеварения", "K00-K93", "12.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K25_K26", "язвенная болезнь желудка и 12-ти перстной кишки", "K25-K26", "12.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K29", "гастрит и дуоденит", "K29", "12.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "К30_К31", "функциональные расстройства желудка", "К30-К31", "12.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K50_K52", "неинфекционный энтерит и колит", "K50-K52", "12.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K80_K83", "болезни желчного пузыря, желчевыводящих путей", "K80-K83", "12.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K85_K86", "болезни поджелудочной железы", "K85-K86", "12.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L00_L99", "болезни кожи и подкожной клетчатки", "L00-L99", "13.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L20", "атопический дерматит", "L20", "13.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L23_L25", "контактный дерматит", "L23-L25", "13.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M00_M99", "болезни костно-мышечной системы и соединительной ткани", "M00-M99", "14.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M02", "реактивные артропатии", "M02", "14.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M08", "юношеский (ювенильный) артрит", "M08", "14.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M30_M35", "системные поражения соединительной ткани", "M30-M35", "14.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N99", "болезни мочеполовой системы", "N00-N99", "15.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N16___N25_N28", "гломерулярные, тубулоинтерстициальные болезни почек, почечная недостаточность, другие болезни почки и мочеточника", "N00-N16, N25-N28", "15.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N17_N19", "почечная недостаточность", "N17-N19", "15.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N20_N23", "мочекаменная болезнь", "N20-N23", "15.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N91_N94", "расстройства менструаций", "N91-N94", "15.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "O00_O99", "беременность, роды и послеродовой период", "O00-O99", "16.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "P00_P96", "отдельные состояния, возникающие в перинатальном периоде", "P00-P96", "17.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q00_Q99", "врожденные аномалии (пороки развития), деформации и хромосомные нарушения", "Q00-Q99", "18.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q20_Q28", "врожденные аномалии системы  кровообращения", "Q20-Q28", "18.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "R00_R99", "симптомы, признаки и отклонения от нормы, выявленные при клинических и лабораторных исследованиях, не классифицированные в других рубриках", "R00-R99", "19.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "S00_T98", "травмы, отравления и некоторые другие последствия воздействия внешних причин", "S00-T98", "20.0", Истина));
		
	ИначеЕсли Имя = "С15По17" Тогда
		
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_T98", "Всего:", "A00-T98", "1.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "в том числе:", 5));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_B99", "некоторые инфекционные и паразитарные болезни", "A00-B99", "2.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "C00_D48", "новообразования", "C00-D48", "3.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D89", "болезни крови,  кроветворных органов и отдельные нарушения, вовлекающие иммунный механизм", "D50-D89", "4.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D64", "анемия", "D50-D64", "4.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65_D68", "нарушения свертываемости крови", "D65-D68", "4.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65", "диссеминированное внутрисосудистое свертывание крови (синдром дефибринации)", "D65", "4.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D80_D89", "отдельные нарушения, вовлекающие иммунный механизм", "D80-D89", "4.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E00_E90", "болезни эндокринной системы, расстройства питания и  нарушения обмена веществ", "E00-E90", "5.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E05", "тиреотоксикоз (гипертиреоз)", "E05", "5.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10_E14", "сахарный диабет", "E10-E14", "5.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10", "инсулинозависимый сахарный диабет", "E10", "5.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E11", "инсулинонезависимый сахарный диабет", "E11", "5.2.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E66", "ожирение", "E66", "5.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "F00_F99", "психические расстройства и расстройства поведения", "F00-F99", "6.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G00_G99", "болезни нервной системы", "G00-G99", "7.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G40___G41", "эпилепсия, эпилептический статус", "G40-G41", "7.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G50_G72", "болезни периферической нервной системы", "G50-G72", "7.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G80", "детский церебральный паралич", "G80", "7.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H00_H59", "болезни глаза и его придаточного аппарата", "H00-H59", "8.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H52__1", "миопия", "H52.1", "8.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H60_H95", "болезни уха и сосцевидного отростка", "H60-H95", "9.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H65__2_H65__9___H66__1_H66__9", "хронический отит", "H65.2-9, H66.1-9ч.", "9.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I99", "болезни системы кровообращения", "I00-I99", "10.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I02", "острая ревматическая лихорадка", "I00-I02", "10.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I09", "хронические ревматические болезни сердца", "I05-I09", "10.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I08", "ревматические пороки клапанов", "I05-I08", "10.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I10_I13", "болезни, характеризующиеся повышенным кровяным давлением", "I10-I13", "10.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J00_J99", "болезни органов дыхания", "J00-J99", "11.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J12_J18", "пневмонии", "J12-J18", "11.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J30__1", "аллергический ринит (поллиноз)", "J30.1", "11.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J31_J32", "хронический фарингит, назофарингит, синусит, ринит", "J31-J32", "11.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J35", "хронические болезни миндалин и аденоидов", "J35", "11.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J40_J43", "бронхит хронический и неутонченный, эмфизема", "J40-J43", "11.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J44___J47", "другая хроническая обструктивная легочная, бронхоэктатическая болезнь", "J44, J47", "11.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J45_J46", "астма, астматический статус", "J45-J46", "11.7", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J84_J94", "интерстициальные, гнойные легочные болезни, другие болезни плевры", "J84-J94", "11.8", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K00_K93", "болезни органов пищеварения", "K00-K93", "12.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K25_K26", "язвенная болезнь желудка и 12-ти перстной кишки", "K25-K26", "12.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K29", "гастрит и дуоденит", "K29", "12.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "К30_К31", "функциональные расстройства желудка", "К30-К31", "12.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K50_K52", "неинфекционный энтерит и колит", "K50-K52", "12.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K80_K83", "болезни желчного пузыря, желчевыводящих путей", "K80-K83", "12.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K85_K86", "болезни поджелудочной железы", "K85-K86", "12.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L00_L99", "болезни кожи и подкожной клетчатки", "L00-L99", "13.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L20", "атопический дерматит", "L20", "13.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L23_L25", "контактный дерматит", "L23-L25", "13.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M00_M99", "болезни костно-мышечной системы и соединительной ткани", "M00-M99", "14.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M02", "реактивные артропатии", "M02", "14.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M05___M06___M08", "Ревматоидные артриты (серо-позитивный, серонегативный, юношеский (ювенильный))", "M05,06,08", "14.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M30_M35", "системные поражения соединительной ткани", "M30-M35", "14.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M45", "анкилозирующий спондилит", "M45", "14.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N99", "болезни мочеполовой системы", "N00-N99", "15.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N16___N25_N28", "гломерулярные, тубулоинтерстициальные болезни почек, почечная недостаточность, другие болезни почки и мочеточника", "N00-N16, N25-N28", "15.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N17_N19", "почечная недостаточность", "N17-N19", "15.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N20_N23", "мочекаменная болезнь", "N20-N23", "15.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N70", "сальпингит и оофорит", "N70", "15.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N91_N94", "расстройства менструаций", "N91-N94", "15.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "O00_O99", "беременность, роды и послеродовой период", "O00-O99", "16.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "P00_P96", "отдельные состояния, возникающие в перинатальном периоде", "P00-P96", "17.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q00_Q99", "врожденные аномалии (пороки развития), деформации и хромосомные нарушения", "Q00-Q99", "18.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q20_Q28", "врожденные аномалии системы  кровообращения", "Q20-Q28", "18.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "R00_R99", "симптомы, признаки и отклонения от нормы, выявленные при клинических и лабораторных исследованиях, не классифицированные в других рубриках", "R00-R99", "19.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "S00_T98", "травмы, отравления и некоторые другие последствия воздействия внешних причин", "S00-T98", "20.0", Истина));
		
	ИначеЕсли Имя = "С18" Тогда
		
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_T98", "Всего:", "A00-T98", "1.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "в том числе:", 5));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "A00_B99", "некоторые инфекционные и паразитарные болезни", "A00-B99", "2.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "C00_D48", "новообразования", "C00-D48", "3.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D89", "болезни крови,  кроветворных органов и отдельные нарушения, вовлекающие иммунный механизм", "D50-D89", "4.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D50_D64", "анемия", "D50-D64", "4.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65_D68", "нарушения свертываемости крови", "D65-D68", "4.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D65", "диссеминированное внутрисосудистое свертывание крови (синдром дефибринации)", "D65", "4.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "D80_D89", "отдельные нарушения, вовлекающие иммунный механизм", "D80-D89", "4.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E00_E90", "болезни эндокринной системы, расстройства питания и  нарушения обмена веществ", "E00-E90", "5.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E05", "тиреотоксикоз (гипертиреоз)", "E05", "5.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10_E14", "сахарный диабет", "E10-E14", "5.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E10", "инсулинозависимый сахарный диабет", "E10", "5.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E11", "инсулинонезависимый сахарный диабет", "E11", "5.2.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "E66", "ожирение", "E66", "5.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "F00_F99", "психические расстройства и расстройства поведения", "F00-F99", "6.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G00_G99", "болезни нервной системы", "G00-G99", "7.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G40___G41", "эпилепсия, эпилептический статус", "G40-G41", "7.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G50_G72", "болезни периферической нервной системы", "G50-G72", "7.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "G80", "детский церебральный паралич", "G80", "7.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H00_H59", "болезни глаза и его придаточного аппарата", "H00-H59", "8.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H25_H26", "катаракта", "H25-H26", "8.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H40", "глаукома", "H40", "8.2", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H52__1", "миопия", "H52.1", "8.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H60_H95", "болезни уха и сосцевидного отростка", "H60-H95", "9.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "H65__2_H65__9___H66__1_H66__9", "хронический отит", "H65.2-9, H66.1-9ч.", "9.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I99", "болезни системы кровообращения", "I00-I99", "10.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I00_I02", "острая ревматическая лихорадка", "I00-I02", "10.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I09", "хронические ревматические болезни сердца", "I05-I09", "10.2", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "В том числе:", 9));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I05_I08", "ревматические пороки клапанов", "I05-I08", "10.2.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I10_I13", "болезни, характеризующиеся повышенным кровяным давлением", "I10-I13", "10.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I20_I25", "ишемическая болезнь сердца", "I20-I25", "10.4", Ложь));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из общего числа больных ишемической болезнью больных:", 10));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I20", "стенокардией", "I20", "10.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I21", "острым инфарктом миокарда", "I21", "10.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I22", "повторный инфаркт миокарда", "I22", "10.7", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I23", "некоторые текущие осложнения острого инфаркта миокарда", "I23", "10.8", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I24", "другие формы острой ишемической болезни сердца", "I24", "10.9", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I60_I69", "цереброваскулярные болезни", "I60-I69", "10.10", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "I70__2___I73__1", "цереброваскулярные болезни", "I70.2, I73.1", "10.11", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J00_J99", "болезни органов дыхания", "J00-J99", "11.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J12_J18", "пневмонии", "J12-J18", "11.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J30__1", "аллергический ринит (поллиноз)", "J30.1", "11.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J31_J32", "хронический фарингит, назофарингит, синусит, ринит", "J31-J32", "11.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J35___J36", "хронические болезни миндалин и аденоидов, перитонзиллярный абсцесс", "J35, J36", "11.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J40_J43", "бронхит хронический и неутонченный, эмфизема", "J40-J43", "11.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J44___J47", "другая хроническая обструктивная легочная, бронхоэктатическая болезнь", "J44, J47", "11.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J45_J46", "астма, астматический статус", "J45-J46", "11.7", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "J84_J94", "интерстициальные, гнойные легочные болезни, другие болезни плевры", "J84-J94", "11.8", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K00_K93", "болезни органов пищеварения", "K00-K93", "12.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K25_K26", "язвенная болезнь желудка и 12-ти перстной кишки", "K25-K26", "12.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K29", "гастрит и дуоденит", "K29", "12.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K50_K52", "неинфекционный энтерит и колит", "K50-K52", "12.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K70_K76", "болезни печени", "K70-K76", "12.4", Ложь));		
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K80_K83", "болезни желчного пузыря, желчевыводящих путей", "K80-K83", "12.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "K85_K86", "болезни поджелудочной железы", "K85-K86", "12.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L00_L99", "болезни кожи и подкожной клетчатки", "L00-L99", "13.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L20", "атопический дерматит", "L20", "13.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "L23_L25", "контактный дерматит", "L23-L25", "13.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M00_M99", "болезни костно-мышечной системы и соединительной ткани", "M00-M99", "14.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M02", "реактивные артропатии", "M02", "14.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M05___M06", "ревматоидный артрит (серопозитивный и серонегативный)", "M05_M06", "14.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M15_M19", "артрозы", "M15-M19", "14.3", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M30_M35", "системные поражения соединительной ткани", "M30-M35", "14.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M45", "анкилозирующий спондилит", "M45", "14.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "M80_M81", "остеопороз", "M80-M81", "14.6", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N99", "болезни мочеполовой системы", "N00-N99", "15.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N00_N16___N25_N28", "гломерулярные, тубулоинтерстициальные болезни почек, почечная недостаточность, другие болезни почки и мочеточника", "N00-N16, N25-N28", "15.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N17_N19", "почечная недостаточность", "N17-N19", "15.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N20_N23", "мочекаменная болезнь", "N20-N23", "15.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N40_N42", "болезни предстательной железы", "N40-N42", "15.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N46", "мужское бесплодие", "N46", "15.5", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N60___N62_N63", "доброкачественная дисплазия, гипертрофия молочной железы", "N60, N62-N63", "15.6", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N70", "сальпингит и оофорит", "N70", "15.7", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N80", "эндометриоз", "N80", "15.8", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N86", "эрозия и эктропион шейки матки", "N86", "15.9", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N91_N94", "расстройства менструаций", "N91-N94", "15.10", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N95", "нарушения менопаузы и другие нарушения в около менопаузном периоде", "N95", "15.11", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "N97", "женское бесплодие", "N97", "15.12", Ложь));	
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "O00_O99", "беременность, роды и послеродовой период", "O00-O99", "16.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q00_Q99", "врожденные аномалии (пороки развития), деформации и хромосомные нарушения", "Q00-Q99", "18.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Q20_Q28", "врожденные аномалии системы  кровообращения", "Q20-Q28", "18.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "R00_R99", "симптомы, признаки и отклонения от нормы, выявленные при клинических и лабораторных исследованиях, не классифицированные в других рубриках", "R00-R99", "19.0", Истина));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "S00_T98", "травмы, отравления и некоторые другие последствия воздействия внешних причин", "S00-T98", "20.0", Истина));
		
	ИначеЕсли Имя = "Факторы" Тогда
		
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z00_Z99", "Всего", "Z00-Z99", "1.0", Истина));
		мсПараметры.Добавить(Новый Структура("ТекстПункта, Отступ", "из них:", 7));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z00_Z13", "обращения в учреждения здравоохранения для медицинского осмотра и обследования", "Z00-Z13", "1.1", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z20_Z29", "потенциальная опасность для здоровья, связанная с инфекционными болезнями", "Z20-Z29", "1.2", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z30_Z39", "обращения в учреждения здравоохранения в связи с обстоятельствами, относящимися к репродуктивной функции", "Z30-Z39", "1.3", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z40_Z54", "обращения в учреждения здравоохранения в связи с необходимостью проведения специфических процедур и получения медицинской помощи", "Z40-Z54", "1.4", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z55_Z65", "потенциальная опасность для здоровья, связанная с социально-экономическими и псхосоциальными обстоятельствами", "Z55-Z65", "1.5", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z70_Z76", "обращения в учреждения здравоохранения в связи с другими обстоятельствами", "Z70-Z76", "1.6", Ложь));
		мсПараметры.Добавить(Новый Структура("Имя, ТекстПункта, КодМКБ, НомерСтроки, Жирный", "Z80_Z99", "потенциальная опасность для здоровья, связанная  с личным или семейным анамнезом и определенными обстоятельствами, влияющими на здоровье", "Z80-Z99", "1.7", Ложь));
			
	КонецЕсли;
	Возврат мсПараметры;
	
	
КонецФункции

#КонецОбласти
