#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Для инд=0 По ПараметрКоманды.Количество()-1 Цикл
			
			ОткрытьФормуВыбораПечатныхФормОбъекта(ПараметрКоманды[Инд], ПараметрыВыполненияКоманды.Источник);	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПечатныхФормОбъекта(Объект, ФормаВладелец) Экспорт
	
	Попытка 
		 //Открыть форму выбора печатных форм
		Если ТипЗнч(Объект) = Тип("Массив") Тогда 
			ДокСсылка = Объект[1];
			НаПринтер = Истина;
		Иначе 
			ДокСсылка = Объект;
			НаПринтер = Ложь;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ТолькоПечать, ДокументСсылка", НаПринтер , ДокСсылка);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("Объект", Объект);
		ДополнительныеПараметры.Вставить("НаПринтер", НаПринтер);
		ДополнительныеПараметры.Вставить("ФормаВладелец", ФормаВладелец);
		ДополнительныеПараметры.Вставить("ДокСсылка", ДокСсылка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПечатныхФормОбъекта", УниверсальныеМеханизмыКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.ПриказыМедосмотров.Форма.ФормаВыбораПечатныхФормУпр", ПараметрыФормы, ФормаВладелец, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры


#КонецОбласти