#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Клиент = Неопределено;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент")
			И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
		Тогда
			Клиент = ЭлементОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(Клиент) Тогда
		Оповестить("ЛекарственнаяНепереносимостьИзменение", Клиент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти