#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормамиСервер.УстановитьВидимостьВнешнегоКода(Элементы.ВнешнийКод,Ложь,РеквизитФормыВЗначение("Объект").Метаданные().Имя);
	Элементы.Филиал.Видимость = УправлениеНастройками.ТребуетсяУчетПоФилиалам();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ИнтеграцияМДЛПВызовСервера_БИТ.ВедетсяУчетМДЛП() 
		И ((Объект.ТипСклада = ПредопределенноеЗначение("Перечисление.ТипыСкладов.Аптека")
			И ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ТипСклада") = ПредопределенноеЗначение("Перечисление.ТипыСкладов.Отделение"))
			Или (Объект.ТипСклада = ПредопределенноеЗначение("Перечисление.ТипыСкладов.Отделение")
			И ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ТипСклада") = ПредопределенноеЗначение("Перечисление.ТипыСкладов.Аптека")))
	Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'При работе с маркированными лекарствами нельзя изменять тип склада с Отделения на Общий или обратно!'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти