////////////////////////////////////////////////////////////////////////////////
//
// ИнвентаризацияМДЛПВызовСервера: процедуры и функции подсистемы "ИнтеграцияМДЛП.Инвентаризация"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСРезультатамиИДальнейшимиДействиямиИнвентаризации

Функция ПолучитьПаруОписанийРезультатовАнализаИнвентаризируемыхУпаковок(РезультатАнализаУпаковок) Экспорт
	
	Возврат ИнвентаризацияМДЛП.ПолучитьПаруОписанийРезультатовАнализаИнвентаризируемыхУпаковок(РезультатАнализаУпаковок);
	
КонецФункции

#КонецОбласти

#КонецОбласти

