#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Документ = Параметры.ДокументЛН;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыФормы = Новый Структура("Действие, Документ","СписокЭЛН",Документ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыОбменаФСС",ЭтаФорма);
	ОткрытьФорму("Документ.ЛистокНетрудоспособности.Форма.ОбменСФСС",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ТекДанные = Элементы.СписокЛН.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Результат = Новый Структура("Номер, Дата, ОГРН, Статус, Первичный, Дубликат, СНИЛС");
		ЗаполнитьЗначенияСвойств(Результат, ТекДанные);
		Закрыть(Результат);
	Иначе
		Закрыть();	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыОбменаФСС(Результат, Параметры) Экспорт	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для каждого СтрокаРезультат Из Результат Цикл
			НоваяСтрока = ТаблицаЛН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРезультат);
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти