
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// Регистр ВзаиморасчетыСКлиентами Приход
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыСКлиентами Из ВзаиморасчетыСКлиентами Цикл
		Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = ТекСтрокаВзаиморасчетыСКлиентами.Клиент;
		Движение.Сумма = ТекСтрокаВзаиморасчетыСКлиентами.Сумма;
		Движение.Сделка = Ссылка;
	КонецЦикла;

	// Регистр ВзаиморасчетыССотрудниками Приход
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыССотрудниками Из ВзаиморасчетыССотрудниками Цикл
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВзаиморасчетыССотрудниками.Сотрудник;
		Движение.Сумма = ТекСтрокаВзаиморасчетыССотрудниками.Сумма;
	КонецЦикла;
	
	// Регистр ВзаиморасчетыСКонтрагентами Приход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыСКонтрагентами Из ВзаиморасчетыСКонтрагентами Цикл
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаВзаиморасчетыСКонтрагентами.Контрагент;
		Движение.Сумма = ТекСтрокаВзаиморасчетыСКонтрагентами.Сумма;
		// Движение.Сделка = Ссылка;
	КонецЦикла;
	
	// Регистр ОстаткиПоСертификатам Приход
	Движения.ОстаткиПоСертификатам.Записывать = Истина;
	Для Каждого ТекСтрокаОстаткиПоСертификатам Из ОстаткиПоСертификатам Цикл
		Движение = Движения.ОстаткиПоСертификатам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сертификат = ТекСтрокаОстаткиПоСертификатам.Сертификат;
		Движение.Сумма = ТекСтрокаОстаткиПоСертификатам.Сумма;
		Если ЗначениеЗаполнено(ТекСтрокаОстаткиПоСертификатам.ДатаНачалаДействия) Тогда
			СертификатОбъект = ТекСтрокаОстаткиПоСертификатам.Сертификат.ПолучитьОбъект();
			СертификатОбъект.ДатаНачалаДействия = ТекСтрокаОстаткиПоСертификатам.ДатаНачалаДействия;
			СертификатОбъект.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти