#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("СсылкаПометкаУдаления", Ссылка.ПометкаУдаления);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ДополнительныеСвойства.ЭтоНовый
		И ПометкаУдаления <> ДополнительныеСвойства.СсылкаПометкаУдаления
	Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		Запрос.УстановитьПараметр("ПометкаУдаления", Не ПометкаУдаления);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтрокиЭМКНеограниченнойДлины.Ссылка
		|ИЗ
		|	Справочник.СтрокиЭМКНеограниченнойДлины КАК СтрокиЭМКНеограниченнойДлины
		|ГДЕ
		|	СтрокиЭМКНеограниченнойДлины.ВладелецСтроки = &Владелец
		|	И СтрокиЭМКНеограниченнойДлины.ПометкаУдаления = &ПометкаУдаления"
		;
		Выб = Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			Выб.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти