#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Запись.ИсходныйКлючЗаписи.Пустой();
	Элементы.Период.Доступность = ЭтоНовый;
	Элементы.Заявка.Доступность = ЭтоНовый;
	Элементы.Ответственный.Доступность = ЭтоНовый;
	Если ЭтоНовый Тогда
		Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Параметры.ДляВводаПричины Тогда
		Если Запись.ПричинаОтменыЗаявки.Пустая() Тогда
			ПоказатьПредупреждение(,"Не указана причина закрытия заявки!");
			Возврат;
		Иначе
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("Период", 					Запись.Период);
			СтруктураЗаписи.Вставить("Заявка", 					Запись.Заявка);
			СтруктураЗаписи.Вставить("ПричинаОтменыЗаявки", 	Запись.ПричинаОтменыЗаявки);
			СтруктураЗаписи.Вставить("Комментарий",				Запись.Комментарий);
			СтруктураЗаписи.Вставить("Ответственный",			Запись.Ответственный);
			СтруктураЗаписи.Вставить("СостояниеПередЗакрытием",	Запись.СостояниеПередЗакрытием);
			Модифицированность = Ложь;
			
			КалендарьПланирования.ОтменитьЗаявкуСервер(СтруктураЗаписи, Запись.Заявка, Параметры.СостояниеОтмены);
			Оповестить("ЗаявкаИзменение", Новый Структура("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"ДатаНачала"))); 
			Закрыть(СтруктураЗаписи);

		КонецЕсли;
	Иначе
		Оповестить("ЗаявкаИзменение", Новый Структура("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"Дата"))); 
		ЭтаФорма.Записать();
	КонецЕсли;
	ОповеститьОбИзменении(Запись.Заявка);
	
КонецПроцедуры

#КонецОбласти

