#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сгенерировать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		МассивЧисел = Новый Массив();
		ЧислоТемп = НачалоДиапозона;
		Сч = 0;
		Пока ЧислоТемп <= КонецДиапозона Цикл
			МассивЧисел.Добавить(ЧислоТемп);
			Сч = Сч + 1;
			Если Сч > 50 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не допускается генерировать за раз более 50 значений!'"));	
				Возврат;
			КонецЕсли; 
			ЧислоТемп = ЧислоТемп + Шаг;
		КонецЦикла; 
		
		ОповеститьОВыборе(МассивЧисел);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти
