
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтикеткаШирина = Лев(Запись.РазмерЭтикетки, 3);
	ЭтикеткаВысота = Прав(Запись.РазмерЭтикетки, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.РазмерЭтикетки = Формат(ЭтикеткаШирина,"ЧЦ=3; ЧН=Ноль; ЧВН=") + "x" + Формат(ЭтикеткаВысота,"ЧЦ=3; ЧН=Ноль; ЧВН=");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	СитиЛаб_ИнтеграцияСервер.ПервоначальнаяЗагрузкаПараметровЗабора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	
	Если Запись.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант") Тогда
		Запись.Прейскурант = ПредопределенноеЗначение("Справочник.Прейскуранты.ПустаяСсылка");
		ТекстСообщения = НСтр("ru='Нельзя выбирать основной прейскурант.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Запись.Прейскурант");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераПриИзменении(Элемент)
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запись.АдресСервера);
	
	Запись.АдресСервера = СтруктураURI.Хост;
	
	Если СтруктураURI.Порт <> Неопределено Тогда
		Запись.Порт = СтруктураURI.Порт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаФормированияШтрихкодаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
