#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НадписьРабочийАдресАдрес.Заголовок	  = ОбменФСС.ПолучитьАдресСервераФСС(Истина, Ложь);
	Элементы.НадписьРезервныйАдресАдрес.Заголовок = ОбменФСС.ПолучитьАдресСервераФСС(Истина, Истина);
	Элементы.НадписьТестовыйКонтурАдрес.Заголовок = ОбменФСС.ПолучитьАдресСервераФСС(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	ПроверитьДоступностьСервера(Элементы.НадписьРабочийАдресАдрес.Заголовок, Элементы.КартинкаРабочийАдрес.Картинка);
	ПроверитьДоступностьСервера(Элементы.НадписьРезервныйАдресАдрес.Заголовок, Элементы.КартинкаРезервныйАдрес.Картинка);
	ПроверитьДоступностьСервера(Элементы.НадписьТестовыйКонтурАдрес.Заголовок, Элементы.КартинкаТестовыйКонтур.Картинка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура НадписьРабочийАдресАдресНажатие(Элемент)
	
	ОткрытьСайт(Элемент.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРезервныйАдресАдресНажатие(Элемент)
	
	ОткрытьСайт(Элемент.Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьТестовыйКонтурАдресНажатие(Элемент)
	
	ОткрытьСайт(Элемент.Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ПроверитьДоступностьСервера(Адрес, ЭлементКартинка)
		
	Ответ = ОбменФСС.ОтправитьИОбработатьЗапрос("", Неопределено,, Адрес);
	
	Если Ответ.КодСостояния = 404 Тогда
		ЭлементКартинка = БиблиотекаКартинок.ПроверкаСертификатаОшибка;	
	Иначе
		ЭлементКартинка = БиблиотекаКартинок.ПроверкаСертификатаУспех;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайт(Адрес)
	
	ЗапуститьПриложение(Адрес);
	
КонецПроцедуры

#КонецОбласти
