#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрКоманды, "Контрагент, ПодписанЭП");
	
	Если ЗначенияРеквизитов.ПодписанЭП = Истина Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Документ подписан электронной подписью. Операция не выполнена.'"), 30);
	ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквизитов.Контрагент) Тогда
		ОткрытьФорму("Документ.СписокНаПрохождениеМедосмотра.Форма.ФормаПрохожденияБезСписка", Новый Структура("Ключ", ПараметрКоманды),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'В документе не указан Контрагент работодателя. Операция не выполнена.'"), 30);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
