#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПарамерыРасчета = ПолучитьПараметрыДокументаРасчета(ПараметрКоманды);
	
	Если ПарамерыРасчета.ОбособленныйУчетВзаиморасчетов Тогда
		ДополнительныйОтбор = Новый Массив;
		ДанныеОтбора = Новый Структура;
		ДанныеОтбора.Вставить("Путь", "Сделка");
		ДанныеОтбора.Вставить("Значение", ПараметрКоманды);
		ДополнительныйОтбор.Добавить(ДанныеОтбора);
		РаботаСФормамиКлиент.ОткрытьОтчетКлиента("ВзаиморасчетыСКлиентами", ПарамерыРасчета.Клиент, , ДополнительныйОтбор);
	Иначе
		РаботаСФормамиКлиент.ОткрытьОтчетКлиента("ВзаиморасчетыСКлиентами", ПарамерыРасчета.Клиент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДокументаРасчета(Документ)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Клиент", Документ.Клиент);
	Параметры.Вставить("ОбособленныйУчетВзаиморасчетов", Документ.Вид.ОбособленныйУчетВзаиморасчетов);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
