#Область ПрограммныйИнтерфейс

// Формирует полное представление строки комплексного расчета с ценой и единицой измерения.
//
// Параметры:
//  СтрокаРасчета	 - СтрокаТаблицыЗначений - строка данных о строке расчета.
//  ДляСообщения	 - Булево - Если Истина, то добавляет в строку результата формулировки, поясняющие содержание.
// 
// Возвращаемое значение:
//   Строка.
//
Функция СформироватьПредставлениеСтрокиКомплексногоРасчета(СтрокаРасчета, ДляСообщения = Истина) Экспорт
	
	Возврат	Строка(СтрокаРасчета.Номенклатура)
			+ ?(ЗначениеЗаполнено(СтрокаРасчета.ХарактеристикаНоменклатуры),", " + СтрокаРасчета.ХарактеристикаНоменклатуры,"")
			+ ?(ЗначениеЗаполнено(СтрокаРасчета.ЕдиницаИзмерения),", " + СтрокаРасчета.ЕдиницаИзмерения,"")
			+ ?(ДляСообщения, " по цене ", ", ") + ОбщегоНазначенияКлиентСервер.ФорматСумм(СтрокаРасчета.Цена);
	
КонецФункции

#КонецОбласти