
#Область ПрограммныйИнтерфейс

// Процедура СоздатьОбработкуОтправкиСМС
//
// Параметры:
//  Имя - Строка.
//  Пользователь - Строка - По умолчанию "".
//  Пароль - Строка - По умолчанию "".
//  Подпись - Строка - По умолчанию "".
//
Процедура СоздатьОбработкуОтправкиСМС(Имя, Пользователь = "", Пароль = "", Подпись = "") Экспорт
	
	Обработка = Справочники.ОбработкиSMSрассылки.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(Обработка, ПолучитьДанныеВстроеннойОбработкиРассылки(Имя));

	Обработка.Пользователь = Пользователь;
	Обработка.Пароль = Пароль;
	
	Попытка
		СведенияОбОбработке = Обработка.ПолучитьСведенияОВнешнейОбработкеСервер();	
		ПараметрыОбработки = СведенияОбОбработке.ДополнительныеПараметры;
		Обработка.ДополнительныеПараметры = Новый ХранилищеЗначения(ПараметрыОбработки);
	Исключение КонецПопытки;
		
	Обработка.Записать();
	
КонецПроцедуры

// Возвращает встроенную обработку по имени макета обработки в справочнике, а также наименование и описание источника.
// 
// Параметры:
// 	Имя - Строка -  Имя макета встроенной обработки в метаданных справочника.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеВстроеннойОбработкиРассылки(Имя) Экспорт
	
	Возврат	Новый Структура("Наименование, ХранилищеВнешнейОбработки, КомментарийКФайлуИсточнику",
							  ПустаяСсылка().Метаданные().Макеты[Имя].Синоним,
							  Новый ХранилищеЗначения(Справочники.ОбработкиSMSрассылки.ПолучитьМакет(Имя)),
							  "Исходный файл: Встроенная обработка рассылки");
	
КонецФункции

#КонецОбласти