
#Область ПрограммныйИнтерфейс

// Сведения о внешней обработке из модуля объекта файла обработки.
//
// Возвращаемое значение:
//  Строка.
//
Функция ПолучитьСведенияОВнешнейОбработкеСервер() Экспорт 
	Попытка
		ДанныеХранилища = ХранилищеВнешнейОбработки.Получить();
		ИмяФайла = ПолучитьИмяВременногоФайла("epf");
		ДанныеХранилища.Записать(ИмяФайла);
		
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
		
		СообщениеОшибки = НСтр("ru='Произошла ошибка при попытке получения сведений от обработки.
		|Возможно, данная обработка не предназначена для
		|запуска в этой конфигурации. 
		|С информацией о формате обработок SMS-рассылки можно ознакомиться в справке по данному объекту конфигуарции.'");
		
		СведенияОбОбработке = ВнешняяОбработка.СведенияОВнешнейОбработке();
		Возврат СведенияОбОбработке;
	Исключение
		Возврат СообщениеОшибки;
	КонецПопытки;
КонецФункции	

#КонецОбласти