#Область ПрограммныйИнтерфейс

// Процедура НастройкаИнтерфейса позволяет
//  изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса	 - Структура - ключи: ИспользоватьВнешнихПользователей - Булево (начальное значение Ложь).
//
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	// _Демо начало примера
	// _ДемоДатыЗапретаИзмененияБСП.НастройкаИнтерфейса(НастройкиРаботыИнтерфейса);
	// _Демо конец примера.
	
КонецПроцедуры

// Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения косвенно
// вызывается из процедуры ДатыЗапретаИзменения.ИзменениеЗапрещено(),
// используемой в подписке на событие ПередЗаписью объекта
// для проверки запрета и отказа от изменений запрещенного объекта.
// 
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений:
//                    Таблица     - Строка, полное имя объекта метаданных,
//                                  например, Документ.ПриходнаяНакладная.
//                    ПолеДаты    - Строка, имя реквизита или имя реквизита
//                                  табличной части, например "Дата", "Товары.ДатаОтгрузки".
//                    Раздел      - Строка, имя предопределенного элемента
//                                  ПланВидовХарактеристикСсылка.РазделыДатЗапрета.
//                    ПолеОбъекта - Строка, имя реквизита или имя реквизита
//                                  табличной части, например "Организация", "Товары.Склад".
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	

	
КонецПроцедуры

// Процедура ПередПроверкойЗапретаИзменения позволяет по некоторому
//  условию, например, для отказа проверки в некоторых режимах работы
//  подсистемы обмена данными (если она используется) или
//  для отказа от проверки по статусу документа (открыт/закрыт).
//
// Параметры:
//  Объект				 - СправочникОбъект, ДокументОбъект	 - объект или набор записей (ПередЗаписью или ПриЧтенииНаСервере):
//  СтандартнаяОбработка - Булево							 - начальное значение Истина,
//  							если присвоить значение Ложь,
//  							тогда стандартная проверка выполняться не будет.
//  УзелПланаОбмена		 - ПланОбменаСсылка					 - начальное значение Неопределено, если присвоить конкретную ссылку,
//  					тогда будет выполнятся проверка запрета загрузки.
//  СообщитьОЗапрете	 - Булево							 - начальное значение Истина. Если задать Ложь,
//  							тогда пользователь не увидит сообщение о запрете, а
//  							увидит лишь отказ записи.
//  							В журнал регистрации сообщение будет записано в любом случае.
//
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, СообщитьОЗапрете) Экспорт
	
	Возврат;	
	
КонецПроцедуры

#КонецОбласти