#Область ОбработчикиКомандФормы
&НаСервереБезКонтекста
Процедура ЗаполнитьИсходыНаСервере()
	
	Макет = Справочники.КлассификаторИсходовЗаболевания.ПолучитьМакет("КлассификаторНСИ");
	Сч = 1;
	Пока Сч <= Макет.ВысотаТаблицы Цикл
		КодМСИ = Число(Макет.Область(Сч,1,Сч,1).Текст);
		Наименование = Макет.Область(Сч,2,Сч,2).Текст;
		
		НайденныйЭлемент = Справочники.КлассификаторИсходовЗаболевания.НайтиПоКоду(КодМСИ);
		Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			Если НайденныйЭлемент.ЭтоГруппа Тогда
				СправочникОбъект = НайденныйЭлемент.ПолучитьОбъект();
				СправочникОбъект.Код = КодМСИ * 1000;
				СправочникОбъект.Записать();
				Продолжить;
			Иначе 
				СправочникОбъект = НайденныйЭлемент.ПолучитьОбъект();
			КонецЕсли;
		Иначе
			СправочникОбъект = Справочники.КлассификаторИсходовЗаболевания.СоздатьЭлемент();
		КонецЕсли;
		СправочникОбъект.Код = КодМСИ;
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.ПолноеНаименование = Наименование;
		СправочникОбъект.Записать();
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсходы(Команда)
	ЗаполнитьИсходыНаСервере();
	Элементы.Список.Обновить();
	ПоказатьПредупреждение(,НСтр("ru='Перезаполнение классификатора завершено.'"), 30);
КонецПроцедуры

#КонецОбласти