#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрHTML = Параметры.ПараметрHTML;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УИДПарметра", Строка(Параметры.ПараметрHTML.УникальныйИдентификатор()));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Парметр", Параметры.ПараметрHTML);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("Ключ, ПараметрHTML", Элемент.ТекущиеДанные.Ссылка, ПараметрHTML);
	
	Если Элемент.ТекущиеДанные.ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.ТабличныйДокумент") Тогда
		ИмяФормыШаблона = "Справочник.ШаблоныHTML.ФормаЭлементаТабличногоШаблонаСправки";
	Иначе
		ИмяФормыШаблона = "Справочник.ШаблоныHTML.ФормаОбъекта";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыШаблона, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти