#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимПодбора = Параметры.РежимВыбора;
	
	Если НЕ РежимПодбора Тогда
		Элементы.ДанныеФлажкаДокументы.Видимость = Ложь;
		Элементы.ДанныеФлажкаСправочники.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.СписокДокументов.РежимВыбора = Параметры.РежимВыбора;
		Элементы.СписокСправочников.РежимВыбора = Параметры.РежимВыбора;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокОбъектов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимПодбора Тогда
		Элементы.СписокДокументов.ТекущиеДанные.Пометка = Не Элементы.СписокДокументов.ТекущиеДанные.Пометка;
	Иначе
		возвр = Новый Структура;
		возвр.Вставить("Имя", Элементы.СписокДокументов.ТекущиеДанные.Имя);
		возвр.Вставить("Синоним", Элементы.СписокДокументов.ТекущиеДанные.Синоним);
		ОповеститьОВыборе(возвр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСправочниковВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если РежимПодбора Тогда
		Элементы.СписокДокументов.ТекущиеДанные.Пометка = Не Элементы.СписокДокументов.ТекущиеДанные.Пометка;
	Иначе
		возвр = Новый Структура;
		возвр.Вставить("Имя", Элементы.СписокСправочников.ТекущиеДанные.Имя);
		возвр.Вставить("Синоним", Элементы.СписокСправочников.ТекущиеДанные.Синоним);
		ОповеститьОВыборе(возвр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыКнопкаОК(Кнопка)
	
	Если НЕ РежимПодбора Тогда
		Если Элементы.Панель.ТекущаяСтраница = Элементы.ГруппаДокументы Тогда
			возвр = Новый Структура;
			возвр.Вставить("Имя", Элементы.СписокДокументов.ТекущиеДанные.Имя);
			возвр.Вставить("Синоним", Элементы.СписокДокументов.ТекущиеДанные.Синоним);
		Иначе
			возвр = Новый Структура;
			возвр.Вставить("Имя", Элементы.СписокСправочников.ТекущиеДанные.Имя);
			возвр.Вставить("Синоним", Элементы.СписокСправочников.ТекущиеДанные.Синоним);
		КонецЕсли;	
		
		ОповеститьОВыборе(возвр);
	Иначе
		ОповеститьОВыборе(ПолучитьСписокВыбранныхОбъектов());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьСписокВыбранныхОбъектов()
	
	СписокОбъектов = Новый СписокЗначений;
	
	Для Каждого Документ Из СписокДокументов Цикл
		
		Если Документ.Пометка Тогда
			СписокОбъектов.Добавить(Новый Структура("Имя, Синоним", Документ.Имя, Документ.Синоним));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Справочник Из СписокСправочников Цикл
		
		Если Справочник.Пометка Тогда
			СписокОбъектов.Добавить(Новый Структура("Имя, Синоним", Справочник.Имя, Справочник.Синоним));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокОбъектов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокОбъектов()
	
	Если УжеВыбранные = Неопределено ИЛИ УжеВыбранные.Количество() = 0 Тогда
		
		Для Каждого Документ Из Метаданные.Документы Цикл
			НовСтр = СписокДокументов.Добавить();
			НовСтр.Имя = Документ.Имя;
			НовСтр.Синоним = Документ.Синоним;
		КонецЦикла;
		
		ДоступныеСправочники = Новый Массив;
		ДоступныеСправочники.Добавить(Метаданные.Справочники.Клиенты);
		
		Для Каждого Справочник Из ДоступныеСправочники Цикл
			НовСтр = СписокСправочников.Добавить();
			НовСтр.Имя = Справочник.Имя;
			НовСтр.Синоним = Справочник.Синоним;
		КонецЦикла;
		
	Иначе	
		Для Каждого Документ Из Метаданные.Документы Цикл
			
			Если УжеВыбранные.НайтиПоЗначению(Документ) = Неопределено Тогда
				НовСтр = СписокДокументов.Добавить();
				НовСтр.Имя = Документ.Имя;
				НовСтр.Синоним = Документ.Синоним;
			КонецЕсли;
			
		КонецЦикла;
		
		ДоступныеСправочники = Новый Массив;
		ДоступныеСправочники.Добавить(Метаданные.Справочники.Клиенты);
		
		Для Каждого Справочник Из ДоступныеСправочники Цикл
			
			Если УжеВыбранные.НайтиПоЗначению(Справочник) = Неопределено Тогда
		
				НовСтр = СписокСправочников.Добавить();
				НовСтр.Имя = Справочник.Имя;
				НовСтр.Синоним = Справочник.Синоним;

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти





