#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ВедетсяУчетПоГарантийнымПисьмам(ПараметрКоманды) Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для вида выбранного полиса не используется учет по гарантийным письмам!'"), 30);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Полис", ПараметрКоманды));
	
	Форма = ОткрытьФорму("Документ.ГарантийноеПисьмоПоПолису.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

&НаСервере
Функция ВедетсяУчетПоГарантийнымПисьмам(Полис)
	
	Возврат Полис.ВидПолиса.УчетОстаткаПоГарантийнымПисьмам;
	
КонецФункции

#КонецОбласти