#Область ПрограммныйИнтерфейс

// Экспортировать шаблон в двоичные данные.
//
// Параметры:
//  Шаблон	 - СправочникСсылка.ШаблоныПечати	 - ссылка на экспортируемый элемент.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - данные выгрузки.
//
Функция Экспортировать(Шаблон) Экспорт
	
	ПутьКФайлуПравил = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеПравилОбмена = Справочники.ШаблоныПечати.ПолучитьМакет("ПравилаОбмена");
	ДвоичныеДанныеПравилОбмена.Записать(ПутьКФайлуПравил);
	
	ПутьКФайлуВыгрузки = ПолучитьИмяВременногоФайла("xml");
	
	УниверсальныйОбмен 							= Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальныйОбмен.ИмяФайлаПравилОбмена 	= ПутьКФайлуПравил;
	УниверсальныйОбмен.ИмяФайлаОбмена 			= ПутьКФайлуВыгрузки;
	УниверсальныйОбмен.РежимОтладкиАлгоритмов 	= Истина;
	УниверсальныйОбмен.РежимОбмена 				= "Выгрузка";
	
	УниверсальныйОбмен.ЗагрузитьПравилаОбмена();	
	СтрокаПараметра = УниверсальныйОбмен.ТаблицаНастройкиПараметров.Найти("Ссылка", "Имя");
	Если СтрокаПараметра <> Неопределено Тогда
		СтрокаПараметра.Значение = Шаблон;
		СТрокаПараметра.ПередаватьПараметрПриВыгрузке = Ложь; 
	КонецЕсли;
	УниверсальныйОбмен.ВыполнитьВыгрузку();
	
	ДанныеВыгрузки 								= Новый ДвоичныеДанные(ПутьКФайлуВыгрузки);			
	
	Возврат ДанныеВыгрузки;
КонецФункции

// Импортировать шаблон из двоичных данных экспорта.
//
// Параметры:
//  Данные	 - ДвоичныеДанные	 - данные файла для загрузки.
//
Процедура Импортировать(Данные) Экспорт
	ПутьКФайлуВыгрузки 							= ПолучитьИмяВременногоФайла("xml");
	УниверсальныйОбмен 							= Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальныйОбмен.ИмяФайлаОбмена 			= ПутьКФайлуВыгрузки;
	УниверсальныйОбмен.РежимОтладкиАлгоритмов 	= Истина;
	УниверсальныйОбмен.РежимОбмена 				= "Загрузка";
	
	Данные.Записать(ПутьКФайлуВыгрузки);
	УниверсальныйОбмен.ВыполнитьЗагрузку();
КонецПроцедуры

#КонецОбласти