
Процедура ПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(Номер) И ЭтоНовый() Тогда
		Если ПроверитьДубли(Номер) Тогда
			Сообщить("Номер " + Формат(Номер,"ЧГ=") + " уже присутствует в списке выбора. Укажите другой номер.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
   Пользователь =   бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
   	
КонецПроцедуры

Функция ПроверитьДубли(ЗнчДляПроверки)
	
	ДубльЗнчЕсть = Ложь;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бтБитФонАбонентыНаПрослушку.Номер
	               |ИЗ
	               |	Справочник.бтБитФонАбонентыНаПрослушку КАК бтБитФонАбонентыНаПрослушку
	               |ГДЕ
	               |	бтБитФонАбонентыНаПрослушку.Номер = &Номер
	               |	И бтБитФонАбонентыНаПрослушку.ПометкаУдаления = ЛОЖЬ
	               |	И бтБитФонАбонентыНаПрослушку.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Номер",ЗнчДляПроверки);
	Запрос.УстановитьПараметр("Пользователь",бит_ТелефонияСервер.ПолучитьТекущегоПользователя());
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда
		ДубльЗнчЕсть = Истина;	
	КонецЕсли;
	
	Возврат ДубльЗнчЕсть;
КонецФункции 

