#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Значение = Константы.ПоддержкаДополнительнаяИнформацияОбращений.Получить();
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Значение);
			Настройки = ПрочитатьJSON(ЧтениеJSON);
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки);
			
			Попытка
				РегНомера.ЗагрузитьЗначения(СтрРазделить(РегистрационныеНомера, ",", Ложь));
			Исключение КонецПопытки;
			
		Исключение КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON);
	
	РегистрационныеНомера = СтрСоединить(РегНомера.ВыгрузитьЗначения(), ",");
	
	Настройки = Новый Структура;
	Настройки.Вставить("РегистрационныеНомера", СокрЛП(РегистрационныеНомера));
	Настройки.Вставить("НаименованиеОрганизации", СокрЛП(НаименованиеОрганизации));
	Настройки.Вставить("ИНН", СокрЛП(ИНН));
	Настройки.Вставить("Прочее", СокрЛП(Прочее));
	
	ЗаписатьJSON(ЗаписьJSON, Настройки);
	Значение = ЗаписьJSON.Закрыть();
	
	Константы.ПоддержкаДополнительнаяИнформацияОбращений.Установить(Значение);
	
КонецПроцедуры

#КонецОбласти