#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Период)
		И ЗначениеЗаполнено(Запись.Сотрудник)
	Тогда
		ТекущийЭлемент = Элементы.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьКомментарияДняСотрудника", Новый Структура("Сотрудник, Период, Комментарий", Запись.Сотрудник, Запись.Период, Запись.Комментарий));
	
КонецПроцедуры

#КонецОбласти
