Функция Печать() Экспорт
	
	Перем Организация,ДанныеКлиента;
	ДанныеДокумента = СсылкаНаОбъект.ПолучитьОбъект();
	
	МакетПечатнойФормы = Новый ТабличныйДокумент();
	МакетПечатнойФормы.Очистить();
	МакетПечатнойФормы.АвтоМасштаб = Истина;
	
	Акт = ПолучитьМакет("АктОбОказанииМедицинскихУслуг");
	//АктСКвадратами = ПолучитьМакет("АктОбОказанииМедицинскихУслуг");
	
	//ПолучениеОбластей
	АктШапка = Акт.ПолучитьОбласть("Шапка");
	АктШапкаТабличнойЧасти = Акт.ПолучитьОбласть("ШапкаТабличнойЧасти");
	АктСтрокаТабличнойЧасти = Акт.ПолучитьОбласть("СтрокаТабличнойЧасти");
	АктИтогиТабличнойЧасти = Акт.ПолучитьОбласть("ИтогиТабличнойЧасти");
	АктТело = Акт.ПолучитьОбласть("Тело");
	АктПодвал = Акт.ПолучитьОбласть("Подвал");
	АктПодвалКвадраты = Акт.ПолучитьОбласть("ПодвалКвадраты");
	
	Организация = ДанныеДокумента.Филиал.Организация;
	ДанныеКлиента = ДанныеДокумента.Клиент; 
	
	// Заполнение областей Шапка
	
	АктШапка.Параметры.Организация = Организация;
	АктШапка.Параметры.ГородОрганизации = Организация;
	АктШапка.Параметры.ДатаДокумента = ДанныеДокумента.Дата;
	АктШапка.Параметры.Ответственный = ДанныеДокумента.Ответственный;
	АктШапка.Параметры.Клиент = ДанныеКлиента;
	
	МакетПечатнойФормы.Вывести(АктШапка);
	
	// Заполнение области ШапкаТабличнойЧасти
	
	МакетПечатнойФормы.Вывести(АктШапкаТабличнойЧасти);
	
	// Заполнение области СтрокаТабличнойЧасти
	ИтоговаяСумма = 0;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеДокумента.Работы Цикл
		
		АктСтрокаТабличнойЧасти.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ИтоговаяСумма = ИтоговаяСумма + СтрокаТабличнойЧасти.Сумма;
		МакетПечатнойФормы.Вывести(АктСтрокаТабличнойЧасти);
		
	КонецЦикла;
	
	
	// Заполнение области ИтогиТабличнойЧасти
	
	АктИтогиТабличнойЧасти.Параметры.Сумма = ИтоговаяСумма;
	МакетПечатнойФормы.Вывести(АктИтогиТабличнойЧасти);
	
	// Заполнение области Тело
	
	АктТело.Параметры.ИтоговаяСумма = ИтоговаяСумма;
	АктТело.Параметры.ДатаАкта = ДанныеДокумента.Дата;
	АктТело.Параметры.РасшифровкаСуммы = ЧислоПрописью(ИтоговаяСумма);
	МакетПечатнойФормы.Вывести(АктТело);
	
	// Заполнение области Подвал
	
	АктПодвал.Параметры.Ответственный = ДанныеДокумента.Ответственный;
	АктПодвалКвадраты.Параметры.Ответственный = ДанныеДокумента.Ответственный;
	
	АктПодвал.Параметры.Контрагент = ДанныеКлиента;
	АктПодвалКвадраты.Параметры.Контрагент = ДанныеКлиента;
	
	МакетПечатнойФормы.Вывести(АктПодвал);
	
	// Дубль
	
	МакетПечатнойФормы.Вывести(АктШапка);
	МакетПечатнойФормы.Вывести(АктШапкаТабличнойЧасти);
	МакетПечатнойФормы.Вывести(АктСтрокаТабличнойЧасти);
	МакетПечатнойФормы.Вывести(АктИтогиТабличнойЧасти);
	МакетПечатнойФормы.Вывести(АктТело);
	МакетПечатнойФормы.Вывести(АктПодвалКвадраты);
	
	Возврат МакетПечатнойФормы ;
	
КонецФункции