
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МассивКодыПродуктовCOVID19 = invИнвитроСервер.ПолучитьКодыПродуктовCOVID19ИзКонстанты();
	КодыПродуктовCOVID19.ЗагрузитьЗначения(МассивКодыПродуктовCOVID19);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДанныеИЗакрытьФорму(Команда)

	invИнвитроСервер.ЗаписатьКодыПродуктовCOVID19ВКонстанту(КодыПродуктовCOVID19.ВыгрузитьЗначения());
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыПоУмолчанию(Команда)
	
	МассивКодыПродуктовCOVID19 = invИнвитроСервер.ПолучитьКодыПродуктовCOVID19ПоУмолчанию();
	КодыПродуктовCOVID19.ЗагрузитьЗначения(МассивКодыПродуктовCOVID19);
		
КонецПроцедуры

#КонецОбласти
