#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ПометкаУдаления") Тогда
		Результат = ПолучитьПараметрыПоЛиду(ПараметрКоманды);
		Если Результат <> Неопределено Тогда
			РаботаСФормамиКлиент.ОткрытьОтчетКлиента("Звонки", Результат.Клиент, Результат.Период);
		Иначе
			ПоказатьПредупреждение(,НСтр("ru = 'Документ не является лидом'"));
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Документ помечен на удаление'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПоЛиду(Ссылка)
	
	НаборЗаписей = РегистрыСведений.Лиды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() <> 0 Тогда
		Результат = Новый Структура();
		Период = Новый СтандартныйПериод;
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
		Период.ДатаНачала = НаборЗаписей[0].Период;
		Период.ДатаОкончания = ?(ЗначениеЗаполнено(НаборЗаписей[0].ДатаОкончания), НаборЗаписей[0].ДатаОкончания, ТекущаяДата());
		Результат.Вставить("Клиент", НаборЗаписей[0].Клиент);
		Результат.Вставить("Период", Период);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти