#Область ПрограммныйИнтерфейс

// Процедура ОбменСФилиаламиЗарегистрироватьИзменениеПередЗаписью.
//
// Параметры:
//  Источник - Произвольный - источник.
//  Отказ - Булево.
//
Процедура ОбменСФилиаламиЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	Если Не Источник.ДополнительныеСвойства.Свойство("НеРегистрироватьДляОбмена") Тогда
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменСФилиалами", Источник, Отказ);
	КонецЕсли;
КонецПроцедуры

// Процедура ОбменСФилиаламиЗарегистрироватьУдалениеПередУдалением.
//
// Параметры:
//  Источник - Произвольный - источник.
//  Отказ - Булево
//
Процедура ОбменСФилиаламиЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменСФилиалами", Источник, Отказ);
КонецПроцедуры

// Процедура ОбменСФилиаламиЗарегистрироватьИзменениеДокументаПередЗаписью.
//
// Параметры:
//  Источник - Произвольный - источник.
//  Отказ - Булево
//  РежимЗаписи - РежимЗаписиДокумента.
//  РежимПроведения - РежимПроведенияДокумента.
//
Процедура ОбменСФилиаламиЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменСФилиалами", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

// Процедура ОбменСФилиаламиЗарегистрироватьИзменениеНабораЗаписейПередЗаписью.
//
// Параметры:
//  Источник - Произвольный - источник.
//  Отказ - Булево
//  Замещение - Булево.
//
Процедура ОбменСФилиаламиЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменСФилиалами", Источник, Отказ, Замещение);
КонецПроцедуры

#КонецОбласти