#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	НевыполненныеХозяйственныеПроцедуры = ХозяйственныйБлок.ПолучитьНевыполненныеХозяйственныеПроцедуры(Филиал);
	Если НевыполненныеХозяйственныеПроцедуры.Количество() <> 0 Тогда 
		ПараметрыФормы = Новый Структура("ОбщаяКоманда");
		ПараметрыФормы.Вставить("Филиал", Филиал);
		ПараметрыФормы.Вставить("НевыполненныеХозяйственныеПроцедуры", НевыполненныеХозяйственныеПроцедуры);
		ОткрытьФорму("ОбщаяФорма.ОтметкаВыполненияХозяйственныхПроцедур", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Нет невыполненных хозяйственных процедур у текущего пользователя.'"));
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти