
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьОписаниеСтатуса(0, "Не найден");
	ДобавитьОписаниеСтатуса(1, "Свободен");
	ДобавитьОписаниеСтатуса(2, "Разговаривает");
	ДобавитьОписаниеСтатуса(3, "Не беспокоить (DND)");
	ДобавитьОписаниеСтатуса(4, "Не зарегистирован на АТС");
	ДобавитьОписаниеСтатуса(5, "Входящий звонок");
	ДобавитьОписаниеСтатуса(6, "Удержание");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьОписаниеСтатуса(индекс, описание)
	строкаОписаниеСтатуса = Статусы.Добавить();
	строкаОписаниеСтатуса.ИндексКартинкиСтатуса = индекс;
	строкаОписаниеСтатуса.Статус = описание;
КонецПроцедуры

#КонецОбласти

