#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидОбращенияПриИзменении(Элемент)
	
	Если Объект.ЗаявкаНаОбслуживание Тогда 
		Объект.ТипОбъектаОбратнойСвязи = ПредопределенноеЗначение("Перечисление.ТипОбъектаОбратнойСвязи.НеУказывается");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьИДоступность()

	Элементы.Исполнители.Видимость = Объект.ЗаявкаНаОбслуживание;
	Элементы.ТипОбъектаОбратнойСвязи.Видимость = Не Объект.ЗаявкаНаОбслуживание;
	Элементы.ТипОбъектаОбратнойСвязи.Доступность = Не Объект.ЗаявкаНаОбслуживание;
	
КонецПроцедуры

#КонецОбласти