
#Область ПрограммныйИнтерфейс

#Область МДЛП

// Определяет, является ли склад розничным магазином
//
// Параметры:
//  Склад	 - СправочникСсылка.Склады	 - склад.
// 
// Возвращаемое значение:
//  Булево - Истина, если тип склад - розничный магазин.
//
Функция ЭтоРозничныйСклад(Склад) Экспорт
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада") = Перечисления.ТипыСкладов.РозничныйМагазин);
	
КонецФункции

// Определяет, является ли склад отделением
//
// Параметры:
//  Склад	 - СправочникСсылка.Склады	 - склад.
// 
// Возвращаемое значение:
//  Булево - Истина, если тип склад - отделение.
//
Функция ЭтоСкладОтделения(Склад) Экспорт
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада") = Перечисления.ТипыСкладов.Отделение);
	
КонецФункции

// Возвращает имя реквизита склада, с которого выбывает товар, по складскому документу.
//
// Параметры:
//  Объект	 - ДокументОбъект	 - документ.
// 
// Возвращаемое значение:
//  Строка - имя реквизита склада отправителя, если он есть в объекте, иначе Неопределено.
//
Функция ИмяРеквизитаСкладОтправитель(Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитВМетаданныхОбъекта(МетаданныеОбъекта, "СкладОтправитель") Тогда
		Возврат "СкладОтправитель";
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитВМетаданныхОбъекта(МетаданныеОбъекта, "Склад") Тогда
		Возврат "Склад";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

Функция СтратегияСписанияПартийСтрокой() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Строка(Константы.СтратегияСписанияПартийТоваровПоДатам.Получить());
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
