#Область ПрограммныйИнтерфейс

// Функция ПолучитьМакетПолейШаблона.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетПолейШаблона() Экспорт
	Возврат ПолучитьМакет("ПоляШаблона");
КонецФункции

// Функция ПолучитьМакетВыполненияОтбора.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетВыполненияОтбора() Экспорт
	Возврат ПолучитьМакет("МакетВыполненияОтбора");
КонецФункции

Функция ПолеКомпановкиСпискаНоменклатур() Экспорт
	
	Возврат Новый ПолеКомпоновкиДанных("СписокНоменклатур");
	
КонецФункции

#КонецОбласти