#Область ПрограммныйИнтерфейс

Процедура ОказаниеУслугРаботыПередУдалением(ЭтаФорма, Элемент) Экспорт
	МедосмотрыКлиент.УдалитьСправкуИзСоставаСправокПоНоменклатуре(ЭтаФорма, Элемент.ТекущиеДанные.Номенклатура)
КонецПроцедуры

Процедура ОказаниеУслугРаботыРаботаПриИзмененииТекСтрока(ЭтаФорма, ТекущаяСтрока) Экспорт
	
	// Медосмотры справок, продаваемых и стартуемых в документе Оказание услуг.
	Если УправлениеНастройками.ПараметрУчета("ИспользоватьМедосмотрыСправки") = Истина Тогда
		МедосмотрыКлиент.ОбновитьСоставСправокПоСтроке(ЭтаФорма, ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОказаниеУслугКлиентПриИзменении(ЭтаФорма) Экспорт
	
	// Медосмотры справок, продаваемых и стартуемых в документе Оказание услуг.
	Если УправлениеНастройками.ПараметрУчета("ИспользоватьМедосмотрыСправки") = Истина Тогда
		МедосмотрыКлиент.ОбновитьСоставСправок(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОказаниеУслугОбновитьЦеныДиалог(ЭтаФорма) Экспорт
	
	// Медосмотры справок, продаваемых и стартуемых в документе Оказание услуг.
	Если УправлениеНастройками.ПараметрУчета("ИспользоватьМедосмотрыСправки") = Истина Тогда
		МедосмотрыКлиент.ОбновитьСоставСправок(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти