#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьИзМакета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	Для каждого стр из Список Цикл
		Если стр.Используется И НЕ ЗначениеЗаполнено(Справочники.DICOMModality.НайтиПоКоду(стр.Код)) Тогда
			НовОбъект = Справочники.DICOMModality.СоздатьЭлемент();
			НовОбъект.Код			= стр.Код;
			НовОбъект.Наименование	= стр.Наименование;
			НовОбъект.Записать();
		КонецЕсли;;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзМакета()
	Список.Очистить();	
	Макет	= Справочники.DICOMModality.ПолучитьМакет("ModalityTable").ПолучитьТекст();
	Таблица	= ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет).Данные;	
	Для Каждого стр Из Таблица Цикл
		НоваяСтрока = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
		Если ЗначениеЗаполнено(Справочники.DICOMModality.НайтиПоКоду(стр.Код)) Тогда
			НоваяСтрока.Используется = Истина;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти