#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отбор = Новый Структура("Ссылка", ЛабораторияКлиентСерверПовтИсп.ВидыЛабораторийСЗагрузкойПараметровЗабора());
	ОписаниеОповещения = Новый ОписаниеОповещения("Заполнить_ПослеВыбораЛаборатории", ЭтаФорма);
	
	ОткрытьФорму("Перечисление.ВнешниеЛаборатории.ФормаВыбора", Новый Структура("Отбор", Отбор),,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Продолжение первоначального заполнения параметров вида лаборатории.
//
// Параметры:
//  ВидЛаборатории - ПеречислениеСсылка.ВнешниеЛаборатории - вид внешней лаборатории.
//  Параметры - Структура - не используется.
//
Процедура Заполнить_ПослеВыбораЛаборатории(ВидЛаборатории, Параметры) Экспорт
	
	Если ВидЛаборатории <> Неопределено Тогда
		
		ПараметрыУжеЗаполнены = ЛабораторияСервер.ПараметрыЗабораАнализовЗаполненыЛаборатории(ВидЛаборатории);
		Если ПараметрыУжеЗаполнены
			И Вопрос(НСтр("ru='Параметры забора для лаборатории уже заполнены. Перезаполнить?'"), РежимДиалогаВопрос.ОКОтмена, 30) <> КодВозвратаДиалога.ОК
		Тогда
			Возврат;
		КонецЕсли;
		
		ЛабораторияСервер.ЗагрузитьПараметрыЗабораИзВнутреннихМакетов(ВидЛаборатории);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
