#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбработки = Метаданные.Обработки.СтраховыеПрограммыЗаполнениеПараметровРеестра;
	Если Не ПравоДоступа("Просмотр", Метаданные.Обработки.СтраховыеПрограммыЗаполнениеПараметровРеестра.Команды.ОткрытьОбработку) Тогда
		
		МетаданныеРегистра = Метаданные.РегистрыСведений.ПараметрыПродажПоСтраховымПрограммам;
		Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
			ЭлементФормы = Элементы.Найти(Реквизит.Имя);
			Если ЭлементФормы <> Неопределено Тогда
				ЭлементФормы.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДиагнозПриИзменении(Элемент)
	Запись.СпособОпределенияДиагноза = ПредопределенноеЗначение("Перечисление.СпособыОпределенияДиагнозаДляПродажПоСтраховымПрограммам.УказанПользователем");
КонецПроцедуры

&НаКлиенте
Процедура ПриемПриИзменении(Элемент)
	Запись.СпособОпределенияПриема = ПредопределенноеЗначение("Перечисление.СпособыОпределенияПриемаДляПродажПоСтраховымПрограммам.УказанПользователем");
КонецПроцедуры

#КонецОбласти