#Область РазделОписанияПеременных

&НаКлиенте
Перем мТекущаяДатаДокумента;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекущаяДатаДокумента = Объект.Дата;
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииСервер(мТекущаяДатаДокумента);
	мТекущаяДатаДокумента = Объект.Дата;
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер(НачальнаяДатаДокумента)
	
	РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ЭтаФорма, НачальнаяДатаДокумента);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыСтатьяЗатратПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Затраты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено и 
		 ЗначениеЗаполнено(ТекущиеДанные.СтатьяЗатрат) и
		 не ЗначениеЗаполнено(ТекущиеДанные.КатегорияВыработки)
	Тогда
		ТекущиеДанные.КатегорияВыработки = ПолучитьОсновногоПолучателяЗатрат(ТекущиеДанные.СтатьяЗатрат);
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьОсновногоПолучателяЗатрат(СтатьяЗатрат)
	Возврат СтатьяЗатрат.ОсновнойПолучательЗатрат;
КонецФункции

#КонецОбласти
