#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Дата) Тогда
		Запись.Дата = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		Запись.Дата = КонецМесяца(Запись.Дата) + 1;
	ИначеЕсли Направление = -1 Тогда
		Запись.Дата = НачалоМесяца(НачалоМесяца(Запись.Дата) - 1);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Запись.Дата = НачалоМесяца(Запись.Дата);
	
КонецПроцедуры

#КонецОбласти