#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Вид = "";
	Если Параметры.Свойство("Вид") Тогда
		Вид = Параметры.Вид;
	КонецЕсли;
	
	ЗаполнитьСписокПоВиду(Вид);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокВариантовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элемент.ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.СписокВариантов.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Элементы.СписокВариантов.ТекущиеДанные.Значение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСписокПоВиду(Вид)
	Если Вид = Перечисления.ВидыПараметровСпецификаций.ПараметрHTML Тогда
		СписокВариантов.Добавить("Ссылка", "Значение");
	ИначеЕсли Вид = Перечисления.ВидыПараметровСпецификаций.ЗначениеЗаполнения Тогда
		Для каждого РеквизитКР Из Метаданные.Документы.КомплексныйРасчетКлиента.Реквизиты Цикл
			СписокВариантов.Добавить(РеквизитКР.Имя, РеквизитКР.Синоним);		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти   