
#Область ПрограммныйИнтерфейс

// Позволяет переопределить описания операций, подключаемых к механизму контроля КМ
// (см. функцию КонтрольКодовМаркировкиМДЛП.ДопустимыеОперацииКонтроляКМ).
//
// Параметры:
//  ДопустимыеОперации - Соответствие - описание операций, подключенных к механизму контроля КМ.
//   * Ключ - Строка - полное имя метаданных объекта, подключаемого к механизму контроля КМ.
//            Расчитывается из типа определяемого типа ДокументКонтроляКМСредствамиККТМДЛП или ДокументКонтроляКМСредствамиРВМДЛП.
//   * Значение - Структура - описание операции, подключенной к механизму контроля КМ.
//      ** Представление - Строка - представление операции.
//                         Расчитывается из типа определяемого типа ДокументКонтроляКМСредствамиККТМДЛП или ДокументКонтроляКМСредствамиРВМДЛП.
//      ** ОграничитьОтключение - Булево - признак, по которому определяется возможность отключения пользователем операции от механизма контроля КМ
//                                (см. форму Обработки.ПанельМаркировкиМДЛП.Форма.НастройкиИсключенийКонтроляКодовМаркировки)
//  КлючГруппыНастроекКонтроляКМ - ключ настроек проверки КМ (см. КонтрольКодовМаркировкиМДЛПКлиентСервер.ГруппыНастроекКонтроляКМ).
//
Процедура ДопустимыеОперацииКонтроляКМ(ДопустимыеОперации, КлючГруппыНастроекКонтроляКМ) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить запись результатов проверки КМ.
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ЗаписатьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиМДЛП.ПараметрыЗаписиРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура ЗаписатьРезультатыПроверкиКМ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить получение записанных результатов проверки КМ.
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ПолучитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиМДЛП.ПараметрыПолученияРезультатовПроверкиКМ.
//  СтандартныйРезультат - ТаблицаЗначений - таблица результата проверки КМ.
//
Процедура ПолучитьРезультатыПроверкиКМ(Параметры, СтандартныйРезультат) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить удаление записанных результатов проверки КМ.
// (см. процедуру КонтрольКодовМаркировкиМДЛП.УдалитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиМДЛП.ПараметрыУдаленияРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура УдалитьРезультатыПроверкиКМ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ПриЧтенииНаСервере).
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ПриСозданииНаСервере).
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ПриЗаписиНаСервере).
//
Процедура ПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить обработчик события формы объекта, подключенной к механизму проверки КМ
// (см. процедуру КонтрольКодовМаркировкиМДЛП.ПослеЗаписиНаСервере).
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольКМСредствамиАПИМДЛП

// Позволяет переопределить признак необходимости подключения механизма контроля КМ к форме объекта
// (см. функцию КонтрольКодовМаркировкиСредствамиАПИМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
//
// Параметры:
//  ДокументСсылка - Ссылка - ссылка на объект.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости подключения механизма контроля КМ к форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция ВключенКонтрольКМСредствамиАПИМДЛПДляДокумента(ДокументСсылка, СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

// Позволяет переопределить признак необходимости использования механизма контроля КМ на форме объекта
// (см. функцию КонтрольКодовМаркировкиСредствамиАПИМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
// Механизм контроля КМ может быть подключен но не использоваться, например, в случае, если ранее была выполнена проверка КМ,
// а сейчас, с теми же параметрами проверка КМ запрещена, и нужно только отобразить результаты проверки, на саму проверку выполнять нельзя.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости использования механизма контроля КМ на форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция РазрешеноИспользованиеНастройкиКонтроляКМСредствамиАПИМДЛП(СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область КонтрольКМСредствамиРВ

// Позволяет переопределить признак необходимости подключения механизма контроля КМ к форме объекта
// (см. функцию КонтрольКодовМаркировкиСредствамиРВМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
//
// Параметры:
//  ДокументСсылка - Ссылка - ссылка на объект.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости подключения механизма контроля КМ к форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция ВключенКонтрольКМСредствамиРВДляДокумента(ДокументСсылка, СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

// Позволяет переопределить признак необходимости использования механизма контроля КМ на форме объекта
// (см. функцию КонтрольКодовМаркировкиСредствамиРВМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
// Механизм контроля КМ может быть подключен но не использоваться, например, в случае, если ранее была выполнена проверка КМ,
// а сейчас, с теми же параметрами проверка КМ запрещена, и нужно только отобразить результаты проверки, на саму проверку выполнять нельзя.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости использования механизма контроля КМ на форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция РазрешеноИспользованиеНастройкиКонтроляКМСредствамиРВ(СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область КонтрольКМСредствамиККТ

// Позволяет переопределить признак необходимости подключения механизма контроля КМ к форме объекта.
// (см. функцию КонтрольКодовМаркировкиСредствамиККТМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
//
// Параметры:
//  ДокументСсылка - Ссылка - ссылка на объект.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости подключения механизма контроля КМ к форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция ВключенКонтрольКМСредствамиККТДляДокумента(ДокументСсылка, СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

// Позволяет переопределить признак необходимости использования механизма контроля КМ на форме объекта
// (см. функцию КонтрольКодовМаркировкиСредствамиРВМДЛП.ПроверитьВозможностьПодключенияПроверкиКМ).
// Механизм контроля КМ может быть подключен но не использоваться, например, в случае, если ранее была выполнена проверка КМ,
// а сейчас, с теми же параметрами проверка КМ запрещена, и нужно только отобразить результаты проверки, на саму проверку выполнять нельзя.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
// Возвращаемое значение:
//  Булево - признак необходимости использования механизма контроля КМ на форме объекта.
//  Если не возвращать, то будет отработан стандартный механизм.
//
Функция РазрешеноИспользованиеНастройкиКонтроляКМСредствамиККТ(СтандартнаяОбработка) Экспорт
	
	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

#Область КонтрольКМСредствамиРВУстаревшие

// Позволяет переопределить запись результатов проверки КМ средствами РВ из формы объекта
// (см. процедуру КонтрольКодовМаркировкиСредствамиРВМДЛП.ЗаписатьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиРВМДЛП.ПараметрыЗаписиРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура ЗаписатьРезультатыПроверкиКМСредствамиРВ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить получение записанных результатов проверки КМ средствами РВ для формы объекта.
// (см. процедуру КонтрольКодовМаркировкиСредствамиРВМДЛП.ПолучитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиРВМДЛП.ПараметрыПолученияРезультатовПроверкиКМ.
//  СтандартныйРезультат - ТаблицаЗначений - таблица результата проверки КМ.
//
Процедура ПолучитьРезультатыПроверкиКМСредствамиРВ(Параметры, СтандартныйРезультат) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить удаление записанных результатов проверки КМ средствами РВ для формы объекта.
// (см. процедуру КонтрольКодовМаркировкиСредствамиРВМДЛП.УдалитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиРВМДЛП.ПараметрыУдаленияРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура УдалитьРезультатыПроверкиКМСредствамиРВ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольКМСредствамиККТУстаревшие

// Позволяет переопределить запись результатов проверки КМ средствами ККТ из формы объекта
// (см. процедуру КонтрольКодовМаркировкиСредствамиККТМДЛП.ЗаписатьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиККТМДЛП.ПараметрыЗаписиРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура ЗаписатьРезультатыПроверкиКМСредствамиККТ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить получение записанных результатов проверки КМ средствами ККТ для формы объекта.
// (см. процедуру КонтрольКодовМаркировкиСредствамиККТМДЛП.ПолучитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиККТМДЛП.ПараметрыПолученияРезультатовПроверкиКМ.
//  СтандартныйРезультат - ТаблицаЗначений - таблица результата проверки КМ.
//
Процедура ПолучитьРезультатыПроверкиКМСредствамиККТ(Параметры, СтандартныйРезультат) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить удаление записанных результатов проверки КМ средствами ККТ для формы объекта.
// (см. процедуру КонтрольКодовМаркировкиСредствамиККТМДЛП.УдалитьРезультатыПроверкиКМ).
//
// Параметры:
//  Параметры - Структура - см. КонтрольКодовМаркировкиСредствамиККТМДЛП.ПараметрыУдаленияРезультатовПроверкиКМ.
//  СтандартнаяОбработка - Булево - признак использования стандартного поведения.
//
Процедура УдалитьРезультатыПроверкиКМСредствамиККТ(Параметры, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
