#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	ДатыЗаписиСписок = мУчетнаяПолитика.ДатыЗаписейЛистовОжидания.Получить();
	ПериодыЗаписиСписок = мУчетнаяПолитика.ПериодыЗаписиЛистовОжидания.Получить();
	
	Для Каждого ДатаЗаписи Из ДатыЗаписиСписок Цикл
		Элементы.ДатаЗаписиПоУмолчанию.СписокВыбора.Добавить(ДатаЗаписи.Значение, ДатаЗаписи.Представление);
	КонецЦикла;
	
	Для Каждого ПериодЗаписи Из ПериодыЗаписиСписок Цикл
		Элементы.ПериодЗаписиПоУмолчанию.СписокВыбора.Добавить(ПериодЗаписи.Значение, ПериодЗаписи.Представление);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
