#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Заголовок = НСтр("ru = 'Введите штрихкод'");
	
	ДополнительныеПараметры = Новый Структура(
		"Источник",
		ПараметрыВыполненияКоманды.Источник);
	Оповещение = Новый ОписаниеОповещения(
		"ПоказатьВводШтрихкодаЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
	ПоказатьВводЗначения(Оповещение, "", Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПоказатьВводШтрихкодаЗавершение(Штрихкод, ДополнительныеПараметры)
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Штрихкод);
		Параметры.Добавить(Неопределено);
		Оповестить("ScanData", Параметры);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
