
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.Клиент) Тогда
		РаботаСФормамиКлиент.ПоказатьПредупреждениеФормаНеПредназначеныДляСамостоятельногоОткрытия(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если Не ЗначениеЗаполнено(Параметры.Клиент) Тогда
		РаботаСФормамиКлиент.ПоказатьПредупреждениеФормаНеПредназначеныДляСамостоятельногоОткрытия(ЭтотОбъект);
	Иначе
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	Результат = Отчеты.ОсновныеПоказателиОрганизмаПациента.СформироватьОтчет(Параметры.Клиент);
КонецПроцедуры

#КонецОбласти