#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Выплаты") Тогда
			// Таблица выплаты
			Для Каждого СтрокаВыплаты Из ДанныеЗаполнения.Выплаты Цикл
				ЗаполнитьЗначенияСвойств(РасчетыССотрудниками.Добавить(), СтрокаВыплаты);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заполнение краткого списка сотрудников документа (реквизит)
	СтрокаКраткийСоставДокумента = "";
	Сотрудники = Новый ТаблицаЗначений;
	Сотрудники = РасчетыССотрудниками.Выгрузить(,"Сотрудник");
	Сотрудники.Свернуть("Сотрудник");
	
	Для Каждого Строка Из Сотрудники Цикл
		ФИО = Строка.Сотрудник.Фамилия + " " + Лев(Строка.Сотрудник.Имя,1) + "." + Лев(Строка.Сотрудник.Отчество,1) + ".";
	    СтрокаКраткийСоставДокумента = СтрокаКраткийСоставДокумента + ФИО + ", ";
	КонецЦикла;
	КраткийСоставДокумента = Лев(Лев(СтрокаКраткийСоставДокумента,СтрДлина(СтрокаКраткийСоставДокумента)-2),50);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РегистрыНакопления.ДвиженияДенежныхСредств.СформироватьДвиженияПоШапкеДокумента(Новый Структура("Дата, СуммаДокумента, СтатьяДвиженияДенежныхСредств", Дата, РасчетыССотрудниками.Итог("Сумма"), СтатьяДвиженияДенежныхСредств), Движения.ДвиженияДенежныхСредств, Ложь, Отказ);

	// Формирование движения по регистру "ВзаиморасчетыССотрудниками".
	РасчетыССотрудниками.Свернуть("Сотрудник","Сумма");
	
	Для Каждого СтрокаВыплат Из РасчетыССотрудниками Цикл
		
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		Движение.Период					= Дата;
		Движение.Сотрудник				= СтрокаВыплат.Сотрудник;		
		Движение.Сумма					= СтрокаВыплат.Сумма;
	
	КонецЦикла;

КонецПроцедуры // ОбработкаПроведения()

#КонецОбласти