#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПодтверждение(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ДанныеДляПодтверждения = ПолучитьДанныеДляПодтверждения(Элементы.Список.ТекущиеДанные.Документ);
		РаботаСДокументамиКлиент.ОтправитьПодтверждениеНСПК(ДанныеДляПодтверждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляПодтверждения(Документ)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураДокумент = Новый Структура;
	СтруктураДокумент.Вставить("ИдентификаторКорзиныНСПК", Документ.ИдентификаторКорзиныНСПК);
	СтруктураДокумент.Вставить("СостояниеЧековККМ", Документ.СостояниеЧековККМ);
	СтруктураДокумент.Вставить("Ссылка", Документ.Ссылка);
	
	СтруктураВозврата.Вставить("Объект", СтруктураДокумент);
	СтруктураВозврата.Вставить("НСПК_СпособОплаты", Документы.ОказаниеУслуг.ПолучитьСпособОплатыНСПК(Документ));
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

