#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.ЕдинственнаяОрганизация();
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		ТекущийЭлемент = Элементы.УИД;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
