#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	ЗаполнениеТаблДатВремени();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект, Ложь, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнениеТаблДатВремени()
	
	Если Объект.ГрафикиПоДнямНедели.Количество() = 0 Тогда
		Для Каждого ДеньНедели Из ПолучитьДниНеделиПеречисление() Цикл
			НовСтр = Объект.ГрафикиПоДнямНедели.Добавить();
			НовСтр.ДеньНедели = ДеньНедели;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДниНеделиПеречисление()
	
	ДниНедели = Новый Массив;
	
	Для Каждого ДеньНедели Из Перечисления.ДниНедели Цикл
		ДниНедели.Добавить(ДеньНедели);
	КонецЦикла;
	
	Возврат ДниНедели;
	
КонецФункции

#КонецОбласти

