#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		ЗначенияЗаполнения = Новый Структура("Клиент", ПараметрКоманды);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ОбратнаяСвязь.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти