#Область ПрограммныйИнтерфейс

// Возвращает дополнительные параметры обработки
//
// Параметры:
//  ОбластьПрименения	 - ДокументСсылка, СправочникСсылка	 - Пустая ссылка на ужный документ/справочник
// 
// Возвращаемое значение:
//  ХранилищеЗначения, Неопределено - Параметры обработки
//
Функция ПолучитьДополнительныеПараметрыВнешнейОбработки(ВнешняяОбработка, ОбластьПрименения) Экспорт

	Если ТипЗнч(ОбластьПрименения) = Тип("СправочникСсылка.ПакетыПечати")
		И Не ОбластьПрименения.Пустая()
	Тогда
		ОбластьПрименения = ОбластьПрименения.МестоВызоваСсылка;
	Иначе
		ОбластьПрименения = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбластьПрименения).ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ВнешниеОбработкиПринадлежность.ДополнительныеПараметрыОбработки КАК ДополнительныеПараметрыОбработки
	                |ИЗ
	                |	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	                |ГДЕ
	                |	ВнешниеОбработкиПринадлежность.Ссылка = &ВнешняяОбработка
	                |	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &ОбластьПрименения";
	
	Запрос.УстановитьПараметр("ВнешняяОбработка", ВнешняяОбработка);
	Запрос.УстановитьПараметр("ОбластьПрименения", ОбластьПрименения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДополнительныеПараметрыОбработки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти