#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Если для классификатора поменяли режим обновления на более полный (ручной->полный или выкл->любой другой),
	//	то очищаем версию классификатора, чтобы следующее обновление актуализировано классификатор.
	Если ЭтотОбъект.Количество() = 1 Тогда
		
		пчРежимы = Перечисления.РежимыАвтоОбновленияСправочниковЕГИСЗ;
		
		Запись = ЭтотОбъект[0];
		Если Запись.РежимОбновления <> пчРежимы.Выключено Тогда
			
			ПредыдущееЗначение = РегистрыСведений.НастройкиОбновленияСправочниковЕГИСЗ.СоздатьМенеджерЗаписи();
			ПредыдущееЗначение.Классификатор = Запись.Классификатор;
			ПредыдущееЗначение.Прочитать();
			Если ПредыдущееЗначение.Выбран() Тогда
				Если Запись.РежимОбновления <> ПредыдущееЗначение.РежимОбновления
					И ((ПредыдущееЗначение.РежимОбновления = пчРежимы.Выключено) 
						Или ПредыдущееЗначение.РежимОбновления = пчРежимы.ТолькоЗагруженных И Запись.РежимОбновления = пчРежимы.Полное)
				Тогда
					Запись.Версия = ""; // Очищаем версию.
					Запись.ДатаВерсии = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
