#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияЗаполнения = CRMСервер.ПолучитьЗначенияЗаполненияДляЛистаОжиданияПоОбъекту(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Клиент, ЗначенияЗаполнения, ДатаНачала", ЗначенияЗаполнения.Клиент, ЗначенияЗаполнения, ТекущаяДата());
		
	мсДокументыОчереди = CRMСервер.ПолучитьАктуальныеДокументыОчередиКлиента(ЗначенияЗаполнения.Клиент);
	
	Если мсДокументыОчереди.Количество() > 0 Тогда
		ОткрытьФорму("Документ.ЛистОжидания.ФормаСписка", ПараметрыФормы);
	Иначе
		ОткрытьФорму("Документ.ЛистОжидания.Форма.ФормаБыстрогоСоздания", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

