#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокированныеЗаявкиНаДень.Загрузить(Параметры.ЗаблокированныеЗаявкиНаДень.Выгрузить());
	
	ТекущаяЗаявка = ЗаблокированныеЗаявкиНаДень.Добавить();
	ТекущаяЗаявка.Ссылка = Параметры.Заявка;
	ТекущаяЗаявка.Клиент = Параметры.Заявка.Клиент;
	
	Клиент = Параметры.Заявка.Клиент;
	ДатаОтменыЗаявок = Параметры.Заявка.ДатаНачала;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ПричинаОтменыЗаявки.Пустая() Тогда
		ПоказатьПредупреждение(,"Не указана причина закрытия заявок!");
		Возврат;
	Иначе
		Для Каждого ЗаблокированнаяЗаявка Из ЗаблокированныеЗаявкиНаДень Цикл
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("Период", 					ДатаОтменыЗаявок);
			СтруктураЗаписи.Вставить("Заявка", 					ЗаблокированнаяЗаявка.Ссылка);
			СтруктураЗаписи.Вставить("ПричинаОтменыЗаявки", 	ПричинаОтменыЗаявки);
			СтруктураЗаписи.Вставить("Комментарий",				Комментарий);
			СтруктураЗаписи.Вставить("Ответственный",			Ответственный);
			Модифицированность = Ложь;
			
			КалендарьПланирования.ОтменитьЗаявкуСервер(СтруктураЗаписи, ЗаблокированнаяЗаявка.Ссылка);
			Оповестить("ЗаявкаИзменение", Новый Структура("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаблокированнаяЗаявка.Ссылка,"ДатаНачала")));
			ОповеститьОбИзменении(ЗаблокированнаяЗаявка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

