#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Тип = Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ПроверяемыеРеквизиты.Добавить("ЭквайрингНСПК");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Тип <> Перечисления.ТипыСпособовОплат.Эквайринг Тогда
		ИспользоватьЭТАвтономно = Ложь;
		Оборудование.Очистить();
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СБП Тогда
		ТорговаяТочкаСБП = Неопределено;
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ЭквайрингНСПК = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти