#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИдентификаторТипаАсинхроннойЗадачи(ТипЗадачи) Экспорт
	
	ИмяЗначения = ОбщегоНазначения.ИмяЗначенияПеречисления(ТипЗадачи);
	Возврат ТипЗадачи.Метаданные().ЗначенияПеречисления[ИмяЗначения].Комментарий;
	
КонецФункции

Функция ТипАсинхроннойЗадачиПоИдентификатору(ИдентификаторЗадачи) Экспорт
	
	ТипЗадачи = ПустаяСсылка();
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТипЗадачи);
	
	Для Каждого МетаданныеТипаЗадачи Из ТипЗадачи.Метаданные().ЗначенияПеречисления Цикл
		Если ВРег(МетаданныеТипаЗадачи.Комментарий) = ВРег(ИдентификаторЗадачи) Тогда
			ТипЗадачи = Менеджер[МетаданныеТипаЗадачи.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТипЗадачи;
	
КонецФункции

#КонецОбласти

#КонецЕсли