#Область ПрограммныйИнтерфейс

// Процедура УстановитьАктивностьПоРегистратору.
//
// Параметры:
//  Регистратор	 - ДокументСсылка	 - документ.
//  Значение	 - Булево			 - значение выполнения.
//
Процедура УстановитьАктивностьПоРегистратору(Регистратор, Значение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтметкиВыполненияДействий.Период,
	               |	ОтметкиВыполненияДействий.Действие,
	               |	ОтметкиВыполненияДействий.ПрохождениеМедОсмотра,
	               |	ОтметкиВыполненияДействий.Выполнено,
	               |	ОтметкиВыполненияДействий.ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.ОтметкиВыполненияДействий КАК ОтметкиВыполненияДействий
	               |ГДЕ
	               |	ОтметкиВыполненияДействий.ДокументРегистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", Регистратор);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		МЗ = РегистрыСведений.ОтметкиВыполненияДействий.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		МЗ.АктивностьЗаписи = НЕ Значение;
		МЗ.Записать();
	
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти