#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУдалятьЧужие = ПравоДоступа("ЧтениеИсторииДанных", Метаданные.РегистрыСведений.ОбращенияВТехПоддержкуБИТ);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БылаПопыткаОтправитьЗапросНаЛК" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗапросНаЛК(Команда)
	ОткрытьФорму("РегистрСведений.ОбращенияВТехПоддержкуБИТ.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаЛК(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ОтправитьЗапросНаЛКСервер(ТД.УИДСообщения);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапросыНаЛКПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <> 1 Тогда
		Отказ = Истина;
	Иначе
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОтправки) Тогда
			Отказ = Истина;
			
		ИначеЕсли Не ЕстьПравоУдалятьЧужие
				И ТекущийПользователь <> ТекущиеДанные.Пользователи
		Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Состояние("Недопустимое удаление");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтправитьЗапросНаЛКСервер(УИДСообщения)
	РегистрыСведений.ОбращенияВТехПоддержкуБИТ.СоздатьНаборЗаписей().ОбработатьОтправкуЗапросаНаЛКПоУИД(УИДСообщения);		
КонецПроцедуры

#КонецОбласти