#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если Выполнена Или НЕ ЗначениеЗаполнено(СрокОповещения)	Тогда
		Оповещение = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Задача выполнена'") + ": "+""""+Наименование+"""");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Событие") Тогда
		ЭтотОбъект.Объект = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
