#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВидДокумента.Видимость = ИнтеграцияЕГИСЗСерверПовтИсп.ИспользуетсяИнтеграцияРЭМД();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Импортировать(Команда)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр = "(*.xml)|*.xml"; 
	
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ДиалогФыбораФайла.ПолноеИмяФайла);
		ИмпортироватьСервер(ДвоичныеДанныеФайла);
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИмпортироватьСервер(ДвоичныеДанныеФайла)
	
	ВремФайл = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеФайла.Записать(ВремФайл);
	Справочники.ШаблоныHTML.Импортировать(ВремФайл);
	Попытка
		УдалитьФайлы(ВремФайл);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьHTMLОбработка(Команда)
	
	ЗначенияЗаполнения = Новый Структура("Родитель", Элементы.Список.ТекущийРодитель);
	ОткрытьФорму("Справочник.ШаблоныHTML.Форма.ФормаЭлемента", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТабличныйДокумент(Команда)
	
	ЗначенияЗаполнения = Новый Структура("Родитель", Элементы.Список.ТекущийРодитель);
	ОткрытьФорму("Справочник.ШаблоныHTML.Форма.ФормаЭлементаТабличногоШаблонаСправки", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры

#КонецОбласти