// Формирует новую структуру данных описания расширенного представления ошибки.
// 
// Возвращаемое значение:
// 	Структура:
// * Статус             - Неопределено, ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - Ошибочный статус.
// * Владелец           - Булево - Признак ошибки владельца.
// * ОбщаяОшибка        - Булево - Признак общей ошибки.
Функция ПараметрыРасширенногоОписанияОшибки() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("Статус",          Неопределено);
	ВозвращаемоеЗначение.Вставить("Владелец",        Ложь);
	ВозвращаемоеЗначение.Вставить("ВидОперацииИСМП", Ложь);
	ВозвращаемоеЗначение.Вставить("ОбщаяОшибка",     Ложь);
	ВозвращаемоеЗначение.Вставить("ВозможноИгнорировать", Ложь);
	ВозвращаемоеЗначение.Вставить("ДанныеПроверкиНаККТ",  Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗаголовокПродолжить",  Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ДанныеПредставленияРезультатовПроверкиСредствамиККТ(СтрокаДанных, ДополнятьТекстомОшибки = Истина) Экспорт
	
	ВозвращаемоеЗначение  = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                   Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяПолныйКодМаркировки", Ложь);
	ВозвращаемоеЗначение.Вставить("ОписаниеОшибок",               "");
	ВозвращаемоеЗначение.Вставить("ПредставлениеВЧеке",           Неопределено);
	
	ПредставленияВЧеке  = ПредставлениеКодаМаркировкиВЧеке();
	МассивТекстовОшибки = Новый Массив;
	
	Если СтрокаДанных.ТребуетсяПолныйКодМаркировки Тогда
		
		ТекстОшибки = НСтр("ru = 'Отсутствует полный код маркировки'");
		МассивТекстовОшибки.Добавить(ТекстОшибки);
		ВозвращаемоеЗначение.ТребуетсяПолныйКодМаркировки = Истина;
		
		ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.Отсутствует);
		
	Иначе
		
		ОшибочныеКодыПроверки = КодыРезультатаПроверкиДляОтображенияОшибки();
		ДанныеОписания        = ОшибочныеКодыПроверки.Получить(СтрокаДанных.ПредставлениеРезультатаПроверки);
		
		Если ДанныеОписания <> Неопределено Тогда
			
			ВозвращаемоеЗначение.ПредставлениеВЧеке = ДанныеОписания.ПредставлениеВЧеке;
			МассивТекстовОшибки.Добавить(ДанныеОписания.Описание);
			
		КонецЕсли;
	
		Если СтрокаДанных.КодМаркировкиПроверен
			И Не СтрокаДанных.РезультатПроверки
			И ДанныеОписания = Неопределено Тогда
			
			МассивТекстовОшибки.Добавить(НСтр("ru = 'Результат проверки КП КМ фискальным накопителем с использованием ключа проверки КП отрицательный.'"));
			ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.ММинус);
			
		КонецЕсли;
		
		Если СтрокаДанных.КодОбработкиЗапроса = "1" Тогда
			МассивТекстовОшибки.Добавить(НСтр("ru = 'Запрос проверки статуса ОИСМ имеет некорректный формат.'"));
			ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.ММинус);
		ИначеЕсли СтрокаДанных.КодОбработкиЗапроса = "2" Тогда
			МассивТекстовОшибки.Добавить(НСтр("ru = 'Указанный в запросе код маркировки имеет некорректный формат (не распознан).'"));
			ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.ММинус);
		КонецЕсли;
		
		Если Не СтрокаДанных.РезультаПроверкиОИСМ
			И ДанныеОписания = Неопределено Тогда
			
			МассивТекстовОшибки.Добавить(НСтр("ru = 'Проверка статуса товара ОИСМ завершилась с отрицательным результатом.'"));
			ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.М);
			
		КонецЕсли;
		
		Если СтрокаДанных.СтатусТовара = ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ОборотТовараПриостановлен")
			Или СтрокаДанных.СтатусТовара = ПредопределенноеЗначение("Перечисление.ОтветОИСМОСтатусеТовара.ПланируемыйСтатусТовараНекорректен") Тогда
			
			МассивТекстовОшибки.Добавить(Строка(СтрокаДанных.СтатусТовара));
			ДополнитьПредставлениеВЧеке(ВозвращаемоеЗначение, ПредставленияВЧеке.ММинус);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивТекстовОшибки.Количество() Тогда
		
		ВозвращаемоеЗначение.ЕстьОшибки = Истина;
		Если ДополнятьТекстомОшибки
			И ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
			МассивТекстовОшибки.Добавить(СтрокаДанных.ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение.ОписаниеОшибок = СтрСоединить(МассивТекстовОшибки, Символы.ПС);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ДополнитьПредставлениеВЧеке(ПараметрыПредставления, Значение)
	
	Если Не ЗначениеЗаполнено(ПараметрыПредставления.ПредставлениеВЧеке) Тогда
		ПараметрыПредставления.ПредставлениеВЧеке = Значение;
	КонецЕсли;
	
КонецПроцедуры

// Представление кода маркировки в чеке.
// 
// Возвращаемое значение:
//  Структура - Представление кода маркировки в чеке:
// * Отсутствует - Строка - "[М] отсутствует".
// * МПлюс       - Строка - "[М+]".
// * ММинус      - Строка - "[М-]".
// * М           - Строка - "[М]".
Функция ПредставлениеКодаМаркировкиВЧеке() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("Отсутствует", "[М] отсутствует");
	ВозвращаемоеЗначение.Вставить("МПлюс",       "[М+]");
	ВозвращаемоеЗначение.Вставить("ММинус",      "[М-]");
	ВозвращаемоеЗначение.Вставить("М",           "[М]");
	ВозвращаемоеЗначение.Вставить("НепроверенныйКМ","[!М]");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция КодыРезультатаПроверкиДляОтображенияОшибки()
	
	ВозвращаемоеЗначение = Новый Соответствие();
	ПредставленияВЧеке   = ПредставлениеКодаМаркировкиВЧеке();
	
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00000000",
		ПредставленияВЧеке.М,
		НСтр("ru = 'Проверка КП КМ не выполнена, статус товара ОИСМ не проверен'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00000001",
		ПредставленияВЧеке.ММинус,
		НСтр("ru = 'Проверка КП КМ выполнена в ФН с отрицательным результатом, статус товара ОИСМ не проверен'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00000011",
		ПредставленияВЧеке.М,
		НСтр("ru = 'Проверка КП КМ выполнена с положительным результатом, статус товара ОИСМ не проверен'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00010000",
		ПредставленияВЧеке.М,
		НСтр("ru = 'Проверка КП КМ не выполнена, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00010001",
		ПредставленияВЧеке.ММинус,
		НСтр("ru = 'Проверка КП КМ выполнена в ФН с отрицательным результатом, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"_00010011",
		ПредставленияВЧеке.М,
		НСтр("ru = 'Проверка КП КМ выполнена в ФН с положительным результатом, статус товара ОИСМ не проверен (ККТ функционирует в автономном режиме)'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00000101",
		ПредставленияВЧеке.ММинус,
		НСтр("ru = 'Проверка КП КМ выполнена с отрицательным результатом, статус товара у ОИСМ некорректен'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"00000111",
		ПредставленияВЧеке.ММинус,
		НСтр("ru = 'Проверка КП КМ выполнена с положительным результатом, статус товара у ОИСМ некорректен'"));
	ДобавитьОписаниеРезультатаПроверки(
		ВозвращаемоеЗначение,
		"_00001111",
		ПредставленияВЧеке.МПлюс,
		НСтр("ru = 'Проверка КП КМ выполнена с положительным результатом, статус товара у ОИСМ корректен'"));
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ДобавитьОписаниеРезультатаПроверки(Коллекция, Код, ПредставлениеВЧеке, Описание)
	
	ДанныеОписания = Новый Структура();
	ДанныеОписания.Вставить("ПредставлениеВЧеке", ПредставлениеВЧеке);
	ДанныеОписания.Вставить("Описание",           Описание);
	
	Коллекция.Вставить(Код, ДанныеОписания);
	
КонецПроцедуры
