#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	ТекстЗапрос = "";

	//Если ЗначениеЗаполнено(ТекстЗапрос) Тогда
	//	ЭтаФорма.Список.ТекстЗапроса = ТекстЗапрос;

	//	DICOMПереопределяемый.УстановитьПараметрыЗапросаWorkList(ЭтаФорма, Список.Параметры);

	//КонецЕсли;

	Попытка
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		ЭтаФорма.РольДоступнаПолныеПрава = РольДоступна("ПолныеПрава");
	Исключение
		ЭтаФорма.РольДоступнаПолныеПрава = Истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметкаИсполнения(Команда)
	Если ЭтаФорма.Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		КлючиЗаписи = ПоставитьОтметкуИсполненияНаСервере();
		
		Для Каждого КлючЗаписи Из КлючиЗаписи Цикл
			ОповеститьОбИзменении(КлючЗаписи);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуИсполнения(Команда)
	Если ЭтаФорма.Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		КлючиЗаписи = СнятьОтметкуИсполненияНаСервере();
		
		Для Каждого КлючЗаписи Из КлючиЗаписи Цикл
			ОповеститьОбИзменении(КлючЗаписи);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Если Не ЭтаФорма.РольДоступнаПолныеПрава Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Требуются полные права для выполнения данной операции.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не ЭтаФорма.РольДоступнаПолныеПрава Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Требуются полные права для выполнения данной операции.");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоставитьОтметкуИсполненияНаСервере()

	Исследования = Новый ТаблицаЗначений;
	Исследования.Колонки.Добавить("УникальныйИдентификаторИсследования", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	КлючиЗаписи = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ЭтаФорма.Элементы.Список.ВыделенныеСтроки Цикл
		строкаТЗ = Исследования.Добавить();
		строкаТЗ.УникальныйИдентификаторИсследования = ВыделеннаяСтрока.УникальныйИдентификаторИсследования;
		
		КлючиЗаписи.Добавить(РегистрыСведений.DicomWorkLists.СоздатьКлючЗаписи(
				Новый Структура("УникальныйИдентификаторИсследования",
					ВыделеннаяСтрока.УникальныйИдентификаторИсследования)
				)
		);
	КонецЦикла;

	DICOMРаботаСДрайвером.ПоставитьОтметкуИсполнения(Исследования);
	
	Возврат КлючиЗаписи;

КонецФункции

&НаСервере
Функция СнятьОтметкуИсполненияНаСервере()

	Исследования = Новый ТаблицаЗначений;
	Исследования.Колонки.Добавить("УникальныйИдентификаторИсследования", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	КлючиЗаписи = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ЭтаФорма.Элементы.Список.ВыделенныеСтроки Цикл
		строкаТЗ = Исследования.Добавить();
		строкаТЗ.УникальныйИдентификаторИсследования = ВыделеннаяСтрока.УникальныйИдентификаторИсследования;
		
		КлючиЗаписи.Добавить(РегистрыСведений.DicomWorkLists.СоздатьКлючЗаписи(
				Новый Структура("УникальныйИдентификаторИсследования",
					ВыделеннаяСтрока.УникальныйИдентификаторИсследования)
				)
		);
	КонецЦикла;

	DICOMРаботаСДрайвером.СнятьОтметкуИсполнения(Исследования);
	
	Возврат КлючиЗаписи;

КонецФункции

#КонецОбласти





