#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	мПоказыватьСопутствующиеТовары = УправлениеНастройками.ПолучитьУчетнуюПолитику().ПоказыватьСопутствующиеТовары;
	Элементы.Группа2.Видимость = мПоказыватьСопутствующиеТовары;
	
	Если мУчетнаяПолитика.ПоказыватьСопутствующиеТовары Тогда
		ОбновитьСопутствующиеУнаследованныеСервер();	
	КонецЕсли;
	
	РаботаСФормамиСервер.УстановитьВидимостьВнешнегоКода(Элементы.ВнешнийКод, Истина, "Номенклатура");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьСопутствующиеУнаследованные(Команда)
	ОбновитьСопутствующиеУнаследованныеСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСопутствующиеУнаследованныеСервер()
	
	Значение = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.Номенклатура"));
	
	мас = Значение.ОбновитьСопутствующиеУнаследованные();
	
	ТабличнаяЧастьУнаследованные.Очистить();
	Если мас <> Неопределено Тогда
		Для Инд = 0 По мас.Количество() - 1 Цикл
			нс = ТабличнаяЧастьУнаследованные.Добавить();
			нс.Код = мас[Инд].Код;
			нс.Артикул = мас[Инд].Артикул;
			нс.Номенклатура = мас[Инд].Номенклатура;
			нс.ВидНоменклатуры = мас[Инд].ВидНоменклатуры;
			нс.Владелец = мас[Инд].Владелец;
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти