#Область ПрограммныйИнтерфейс

// Процедура формирует движения в регистры по прочим затратам
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - ссылка на документ
//  ТабЧасть	 - ТаблицаЗначений	 - таб. часть по которой формируются движения
//  	В ней обязательно должны быть реквизиты "СтатьяЗатрат", "Сумма"
//  	"Заказ", "Подразделение",
//  	"НоменклатурнаяГруппа"
//  ДопПараметры - Структура		 - структура с доп. параметрами. Возможные значения.
//
Процедура ДвиженияПоПрочимЗатратам(ДокОбъект, ТабЧасть, ДопПараметры = Неопределено) Экспорт

	НаборДвиженийЗатраты      = ДокОбъект.Движения.Затраты;
	ТаблицаДвиженийЗатраты    = НаборДвиженийЗатраты.ВыгрузитьКолонки();

	// Определим доп. параметры.
	ДокСтатьяЗатрат = Неопределено;
	ВидДвижения     = "Приход";
	
	Если Не ДопПараметры = Неопределено Тогда
		Если ДопПараметры.Свойство("СтатьяЗатрат") Тогда
			ДокСтатьяЗатрат = ДопПараметры["СтатьяЗатрат"];
		КонецЕсли;
		Если ДопПараметры.Свойство("КатегорияВыработки") Тогда
			КратДок = ДопПараметры["КатегорияВыработки"];
		КонецЕсли;
		Если ДопПараметры.Свойство("Знак") Тогда
			Знак = ДопПараметры["Знак"];
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ТабЧасть) <> Тип("ТаблицаЗначений") Тогда
		ТабличнаяЧасть = ТабЧасть.Выгрузить();
	Иначе
		ТабличнаяЧасть = ТабЧасть;
	КонецЕсли;
	
	// Обход таб. части.
	Для Каждого СтрокаТЧ Из ТабЧасть Цикл
		
		СтатьяЗатрат = ?(ДокСтатьяЗатрат = Неопределено, СтрокаТЧ.СтатьяЗатрат,  ДокСтатьяЗатрат);
		
		Если НЕ ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Продолжить;
		КонецЕсли;
				
		Сумма = СтрокаТЧ.Сумма;

		НоваяСтрока = ТаблицаДвиженийЗатраты.Добавить();
		НоваяСтрока.КатегорияВыработки		= СтрокаТЧ.КатегорияВыработки;
		НоваяСтрока.СтатьяЗатрат			= СтатьяЗатрат;
		НоваяСтрока.НоменклатураПолучатель	= СтрокаТЧ.НоменклатураПолучатель;
		Если ПроцедурыСпециализацииПоставки.ПоддерживаетсяУчетПоНесколькимФилиалам() Тогда
			НоваяСтрока.Филиал				= СтрокаТЧ.Филиал;
		КонецЕсли;
		НоваяСтрока.Номенклатура			= СтрокаТЧ.Номенклатура;
		
		НоваяСтрока.Сумма					= Сумма;

	КонецЦикла;

	// Записать движения.
	НаборДвиженийЗатраты.мПериод             = ДокОбъект.Дата;
	НаборДвиженийЗатраты.мТаблицаДвижений    = ТаблицаДвиженийЗатраты;

	НаборДвиженийЗатраты.ВыполнитьДвижения();
	НаборДвиженийЗатраты.Записать(Истина);

КонецПроцедуры // ДвиженияПоПрочимЗатратам()

#КонецОбласти
