#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОбщаяСуммаДляПроведения = 0;
	
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаУслуги.Полис)
			И ТекСтрокаУслуги.Полис.ВидПолиса.ФиксироватьДолгКонтрагентаПриПроведенииРеестраОУ
		Тогда
			ОбщаяСуммаДляПроведения = ОбщаяСуммаДляПроведения + ТекСтрокаУслуги.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбщаяСуммаДляПроведения <> 0 Тогда
		
		// Движение по регистру ВзаиморасчетыСКонтрагентами Приход.
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		//Движение.Сделка = Ссылка;
		Движение.Сумма = ОбщаяСуммаДляПроведения;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти