#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ИнтеграцияСВнешнимСервисом Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиОбменаССайтом.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиОбменаССайтом КАК НастройкиОбменаССайтом
	|ГДЕ
	|	НастройкиОбменаССайтом.Клиника = &Клиника
	|	И НЕ НастройкиОбменаССайтом.ИнтеграцияСВнешнимСервисом
	|	И НЕ НастройкиОбменаССайтом.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Клиника", Клиника);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru ='Настройки на филиал ""%1"" уже созданы!'"),
				Клиника));
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ПометкаУдаления И ПриоритетПоискаКлиента.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Заполните табличную часть приоритетов поиска клиента!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
