
#Область БИТ //+БИТ

// Удалить идентификатор у каждого рег.задания из его параметров (при обновлении может быть в первом параметре).
//
Процедура УдалитьУИДИзПараметровРегЗаданий() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Задание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
		Если Задание.Параметры.Количество() > 0
			И Строка(Задание.Параметры[0]) = Строка(Задание.УникальныйИдентификатор)
		Тогда
			Задание.Параметры.Удалить(0);
		КонецЕсли;
		Задание.Записать();
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти