#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("КлиентПриемник",ПараметрКоманды));
		ОткрытьФорму("Документ.КорректировкаДолгаКлиента.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
