
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерСерииПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГоденДоПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	ШаблонСтроки = НСтр("ru='%1%2%3'");
	Объект.Наименование = СтрШаблон(ШаблонСтроки, Объект.НомерСерии,
		?(ЗначениеЗаполнено(Объект.НомерСерии) И ЗначениеЗаполнено(Объект.ГоденДо), " ", ""), 
		?(ЗначениеЗаполнено(Объект.ГоденДо), "(годен до " + Формат(Объект.ГоденДо, "ДЛФ=D") + ")", "")); 
	
КонецПроцедуры 

#КонецОбласти
