
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверГексагонТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Гексагон:Терминалы сбора данных Goods'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ProtonTSD"; 
	Драйвер.ВерсияДрайвера = "8.4.2"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверКлеверенсТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'CLEVERENCE:Терминалы сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "Cleverence_TO_TSD"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверАтолТерминалыСбораДанныхMobileLogistics";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Терминалы сбора данных Mobile Logistics 8.Х'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "PDX1C_Int"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверRightScanТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'RightScan:Терминалы сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "RSExchange"; 
	Драйвер.ВерсияДрайвера = "3.10"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхNative";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher LAB 8x00 (Native Api)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CipherLab8"; 
	Драйвер.ВерсияДрайвера = "1.0.0.9"; 
	Драйвер.СнятСПоддержки = Истина;
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодТерминалыСбораДанныхCipherLab8G2";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Терминалы сбора данных Cipher Lab 8 G2'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CipherLab8G2"; 
	Драйвер.ВерсияДрайвера = "2.0.0.24"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftBusiness";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Business'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftBusinessDriver"; 
	Драйвер.ВерсияДрайвера = "4.0.12.747"; 
	Драйвер.СнятСПоддержки = Истина;       
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftLite";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Lite'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftLiteEquipmentDriver"; 
	Драйвер.ВерсияДрайвера = "5.8.3.260"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиТерминалСбораДанныхCitySoftStandart";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Терминал сбора данных City-Soft Standart'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "CitySoftStandartDriver"; 
	Драйвер.ВерсияДрайвера = "4.5.0.881"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверХарвестрТерминалыСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Харвестр:Приложение сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "HarvesterEquipmentNative"; 
	Драйвер.ВерсияДрайвера = "1.2.3.8";   
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных;
	Драйвер.ИмяДрайвера  = "ДрайверСканпортТерминалСбораДанных";
	Драйвер.Наименование = НСтр("ru = 'Сканпорт:Терминал сбора данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "DmTsdDriver"; 
	Драйвер.ВерсияДрайвера = "1.0.1"; 
	
КонецПроцедуры

#КонецОбласти