#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	ИнтеграцияЕГИСЗКлиент.ОткрытьФормуОбновленияСправочника("ИнструментальныеИсследования",Элементы.Список,ЭтаФорма); 
	Элементы.Список.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)

	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)

	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктуальность(Команда)
	РезультатПроверки = ИнтеграцияЕГИСЗВызовСервера.ПроверитьНеобходимостьАвтоОбновления("ИнструментальныеИсследования");
	ТаблДокумент = Новый ТабличныйДокумент();
	ТаблДокумент.Область(1,1).Текст = "Текущая версия:";	
	ТаблДокумент.Область(1,2).Текст = РезультатПроверки.ТекущаяВерсия;
	
	ТаблДокумент.Область(2,1).Текст = "Дата текущей версии:";
	ТаблДокумент.Область(2,2).Текст = РезультатПроверки.ДатаТекущейВерсии;
	
	ТаблДокумент.Область(4,1).Текст = "Актуальная версия:";	
	ТаблДокумент.Область(4,2).Текст = РезультатПроверки.ПоследняяВерсия;
	
	ТаблДокумент.Область(5,1).Текст = "Дата актуальной версии:";
	ТаблДокумент.Область(5,2).Текст = РезультатПроверки.ДатаПоследнейВерсии;
	
	ТаблДокумент.Показать();
КонецПроцедуры

#КонецОбласти