#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РаспределениеЗатрат.Загрузить(Распределение.Выгрузить());
	ТаблицаДвижений = Движения.РаспределениеЗатрат.Выгрузить();
	ТаблицаДвижений.ЗаполнитьЗначения(КонецМесяца(Дата), "Период");
	Движения.РаспределениеЗатрат.Загрузить(ТаблицаДвижений);
	
	Для Каждого СтрокаЗатраты Из Затраты Цикл
		Если СтрокаЗатраты.ИсточникЗаполненияЗатрат = Перечисления.ИсточникиЗаполненияЗатрат.РаспределенныеЗатраты
			И Не ЗначениеЗаполнено(СтрокаЗатраты.ОшибкаРаспределения)
		Тогда
			Движение = Движения.РаспределениеЗатрат.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаЗатраты);
			Движение.Период	= КонецМесяца(Дата);
			Движение.Сумма	= -Движение.Сумма;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти