#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Если ПараметрКоманды.Количество() <> 0 Тогда  
			Отбор = Новый Структура("СписокНаПрохождениеМедосмотра", ПараметрКоманды[0]);
			ПараметрыФормы = Новый Структура("Отбор", Отбор);
			ОткрытьФорму("Документ.ПрохождениеМедосмотра.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти