#Область ПрограммныйИнтерфейс

// Функция НаименованияПоКоду.
//
// Параметры:
//  КодУФМС - Неопределено
//	Дата - Дата.
//
// Возвращаемое значение:
//  Неопределено.
//
Функция НаименованияПоКоду(КодУФМС, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Дата < ДатаРеформыМДВПереходаНаГУ() Тогда
		ИмяМакета = "КодыУФМС";
		Код = СтрЗаменить(КодУФМС,"-","");
		ДлинаПоиска = 6;
	Иначе
		ИмяМакета = "КодыГУМВД";
		Код = Лев(КодУФМС, 2);
		ДлинаПоиска = 2;
	КонецЕсли;
	
	Макет = РегистрыСведений.ПаспортныеДанные.ПолучитьМакет(ИмяМакета);

	
	Наименования = Новый Массив;
	
	Для Сч = 1 По Макет.ВысотаТаблицы Цикл
		
		Область = Макет.Область(Сч, 1);
	
		Если Код = Лев(СтрЗаменить(Область.Текст,"-",""), ДлинаПоиска) Тогда
			НаименованиеУчреждения = Макет.Область(Сч, 2).Текст;
			Если Наименования.Найти(НаименованиеУчреждения) = Неопределено Тогда
				Наименования.Добавить(НаименованиеУчреждения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Наименования.Количество() = 1 Тогда
		Возврат Наименования[0];
	ИначеЕсли Наименования.Количество() <> 0 Тогда
		Возврат Наименования;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатаРеформыМДВПереходаНаГУ()
	
	Возврат Дата(2019,1,1);
	
КонецФункции

#КонецОбласти

