#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		ЗначенияЗаполнения = Новый Структура("Клиент", ПараметрКоманды);
		Рекламация = CRMСервер.ПолучитьАктуальныеРекламацииПоКлиенту(ПараметрКоманды, Истина);
		Если Рекламация <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("Рекламация", Рекламация);
		КонецЕсли;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.РаботыПоРекламации.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти