#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пользователь") И ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Пользователь = Параметры.Пользователь;
		Элементы.Пользователь.ТолькоПросмотр= Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	Если СобытиеСуществует(Пользователь, Дата, Событие) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='На выбранную дату уже существует событие'"));
		Возврат;
	Иначе
		Закрыть(Новый Структура("Пользователь, Дата, Событие", Пользователь, Дата, Событие));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СобытиеСуществует(Пользователь, Дата, Событие)
	
	МЗ = РегистрыСведений.бит_СобытияБитФон.СоздатьМенеджерЗаписи();
	МЗ.Дата = Дата;
	МЗ.Пользователь = Пользователь;
	МЗ.Событие = Событие;
	МЗ.Прочитать();
	
	Возврат МЗ.Выбран();
	
КонецФункции

#КонецОбласти