#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	спПМО = ПолучитьПМО(ПараметрКоманды);
	Если спПМО.Количество() <> 0 Тогда  
		мсПФ = Новый Массив;
		мсПФ = УниверсальныеМеханизмыКлиент.ОткрытьФормуВыбораПечатныхФормОбъектаМножественнаяПечать(ПредопределенноеЗначение("Документ.ПрохождениеМедосмотра.ПустаяСсылка"), ПараметрыВыполненияКоманды.Источник);
		Если мсПФ.Количество() > 0 Тогда 
			Для Каждого Элемент Из спПМО Цикл
				УниверсальныеМеханизмыКлиент.ПечатьДокументовМножественнаяПечать(мсПФ,Элемент,РежимИспользованияДиалогаПечати.НеИспользовать);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Документы прохождения медосмотра отсутствуют.'"));
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПМО(СсылкаНаОбъект)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокНаПрохождениеМедосмотра", СсылкаНаОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрохождениеМедосмотра.Ссылка КАК ПМО
	|ИЗ
	|	Документ.СписокНаПрохождениеМедосмотра.Клиенты КАК СписокНаПрохождениеМедосмотраКлиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрохождениеМедосмотра КАК ПрохождениеМедосмотра
	|		ПО СписокНаПрохождениеМедосмотраКлиенты.Ссылка = ПрохождениеМедосмотра.СписокНаПрохождениеМедосмотра
	|			И СписокНаПрохождениеМедосмотраКлиенты.Клиент = ПрохождениеМедосмотра.Клиент
	|			И (ПрохождениеМедосмотра.Проведен)
	|ГДЕ
	|	СписокНаПрохождениеМедосмотраКлиенты.Ссылка В(&СписокНаПрохождениеМедосмотра)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПМО");
	
КонецФункции

#КонецОбласти
