#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленСписокВидовСегментаций" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Импортировать(Команда)
		
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр = "(*.xml)|*.xml"; 
	
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда

		ФайлДД = Новый ДвоичныеДанные(ДиалогФыбораФайла.ПолноеИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(ФайлДД);
		ИмпортироватьСервер(Адрес);
		
	КонецЕсли;
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	Форма = ПолучитьФорму("Справочник.ВидыСегментации.Форма.ДобавлениеИзВстроенных");
	Форма.Открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ИмпортироватьСервер(АдресВременногоХранилища);
	ФайлДД = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Справочники.ВидыСегментации.Импортировать(ФайлДД);	
КонецПроцедуры

#КонецОбласти

