#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КнопкаИстина(Команда)
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЛожь(Команда)
	Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНичего(Команда)
	Закрыть("[...]");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.НачальноеЗначение = Истина Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаИстина;
	ИначеЕсли Параметры.НачальноеЗначение = Ложь Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаЛожь;
	ИначеЕсли Параметры.НачальноеЗначение = "[...]" Тогда
	    ЭтаФорма.ТекущийЭлемент = Элементы.КнопкаНичего;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.КнопкаОтмена;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
