#Область ПрограммныйИнтерфейс

// Первоначальное заполнение
Процедура ПерезаполнитьКлассификатор() Экспорт
	
	Справочник = Справочники.ТипыНарушенийРежима;
	
	// Получение классификтора (из макета).
	Классификатор = Новый ТаблицаЗначений;
	Классификатор.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	Классификатор.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	
	МакетКлассификатор = Справочник.ПолучитьМакет("СоставКлассификатора");
	
	Для Сч = 3 По МакетКлассификатор.ВысотаТаблицы Цикл
		НоваяСтрока = Классификатор.Добавить();
		НоваяСтрока.Код	 = МакетКлассификатор.Область(Сч, 1).Текст;
		
		Наименование	 = МакетКлассификатор.Область(Сч, 2).Текст;
		НоваяСтрока.Наименование = СтрШаблон("%1 - %2", НоваяСтрока.Код, Наименование);
	КонецЦикла;
	
	// Перезаполнение справочника.
	Для Каждого ОписаниеЭлемента Из Классификатор Цикл
		
		НайденныйЭлемент = Справочник.НайтиПоКоду(ОписаниеЭлемента.Код);
		Если Не ЗначениеЗаполнено(НайденныйЭлемент) Тогда
			
			// Создаем новый элемент справочника.
			НовыйЭлемент = Справочник.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ОписаниеЭлемента);
			НовыйЭлемент.Записать();
		Иначе
			// Обновляем реквизиты найденного элемента.
			ТекЭлемент = НайденныйЭлемент.ПолучитьОбъект();
			Если ТекЭлемент.Наименование <> ОписаниеЭлемента.Наименование Тогда
				ТекЭлемент.Наименование = ОписаниеЭлемента.Наименование;
				ТекЭлемент.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
