#Область ПрограммныйИнтерфейс

// Возвращает URI часто используемых пространств имен.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - префикс.
//   * Значение - Строка - пространство имени.
//
Функция URIПростанств() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить("xs", "http://www.w3.org/2001/XMLSchema");
	Результат.Вставить("xsi","http://www.w3.org/2001/XMLSchema-instance");
	Результат.Вставить("xmldsig","http://www.w3.org/2000/09/xmldsig#");
	Результат.Вставить("wsse","http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd");
	Результат.Вставить("wsu","http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd");
	Результат.Вставить("wsa","http://www.w3.org/2005/08/addressing");
	
	Возврат Результат;
	
КонецФункции

// Возвращает URI пространства имён.
//
// Параметры:
//  ПростанствоИмен	 - Строка - наименование пространства имен
// 
// Возвращаемое значение:
//  Строка - URI.
//
Функция URI(ПростанствоИмен) Экспорт
	
	URIПростанств = URIПростанств();
	
	URIПространства = URIПростанств.Получить(ПростанствоИмен);
	
	Если URIПространства <> Неопределено Тогда
		Возврат URIПространства;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// URI пространства Xmldsig
// 
// Возвращаемое значение:
//  Соответствие - URI пространств
//
Функция xmldsig() Экспорт
	
	Возврат URI("xmldsig");
	
КонецФункции

// URI пространства Soap
//
// Параметры:
//  Версия	 - Строка	 - версия ("1.1", "1.2")
// 
// Возвращаемое значение:
//  Соответствие - URI пространств.
//
Функция soap(Версия = "1.1") Экспорт
	
	Версии = Новый Соответствие;
	Версии.Вставить("1.1", "http://schemas.xmlsoap.org/soap/envelope/");
	Версии.Вставить("1.2", "http://schemas.xmlsoap.org/soap/envelope/");
	
	URIВерсии = Версии.Получить(Версия);
	
	Если URIВерсии <> Неопределено Тогда
		Возврат URIВерсии;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// URI пространства wsse
// 
// Возвращаемое значение:
//  Соответствие - URI пространств
//
Функция wsse() Экспорт
	
	Возврат URI("wsse");
	
КонецФункции

// URI пространства wsu
// 
// Возвращаемое значение:
//  Соответствие - URI пространств
//
Функция wsu() Экспорт
	
	Возврат URI("wsu");
	
КонецФункции

// URI пространства xs
// 
// Возвращаемое значение:
//  Соответствие - URI пространств 
//
Функция xs() Экспорт
	
	Возврат URI("xs");
	
КонецФункции

// URI пространства wsa
// 
// Возвращаемое значение:
// 	Соответствие - URI пространств
//
Функция wsa() Экспорт
	
	Возврат URI("wsa");
	
КонецФункции

#КонецОбласти
