#Область ПрограммныйИнтерфейс

Функция ОписаниеНепереносимостейКлиента(Клиент) Экспорт
	
	Описание = "";
	
	ШаблонЗаписи = "%1 на: %2";
	
	НЗ = РегистрыСведений.ЛекарственнаяНепереносимость.СоздатьНаборЗаписей();
	НЗ.Отбор.Клиент.Установить(Клиент);
	НЗ.Прочитать();
	
	ТЗ = НЗ.Выгрузить();
	
	Реакции = ОбщегоНазначения.ВыгрузитьКолонку(ТЗ, "Реакция");
	
	Для Каждого Реакция Из Реакции Цикл
		
		ОписаниеЗаписи = "";
		Вещества = "";
		
		Записи = ТЗ.НайтиСтроки(Новый Структура("Реакция", Реакция));
		Для Каждого Запись Из НЗ Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Вещества, Запись.ДействующееВещество, ", ", Истина);
		КонецЦикла;
		
		ОписаниеЗаписи = СтрШаблон(ШаблонЗаписи, Реакция, Вещества);
		
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Описание, ОписаниеЗаписи, "; ");
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти