#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщенияXML = Запись.ДанныеXML;
	
	Если ЗначениеЗаполнено(ТекстСообщенияXML) Тогда
		Попытка
			ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ТекстСообщенияXML);
			Если ОбщиеПараметры.Свойство("ДатаВремя") И ЗначениеЗаполнено(Запись.Дата) Тогда
				ОбщиеПараметры.ДатаВремя = Дата("00010101");	
			КонецЕсли;
			
			ТабДок = ОборудованиеЧекопечатающиеУстройстваВызовСервера.СформироватьФискальныйДокумент(0, ОбщиеПараметры, ПолучитьДанныФискальнойОперации());
		Исключение КонецПопытки;
	Иначе
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныФискальнойОперации()
	
	ФискальнаяОперация = Новый Структура;
	ФискальнаяОперация.Вставить("ИдентификаторЗаписи");
	ФискальнаяОперация.Вставить("Дата");
	ФискальнаяОперация.Вставить("НомерЧекаККМ");
	ФискальнаяОперация.Вставить("НомерСменыККМ");
	ФискальнаяОперация.Вставить("ЗаводскойНомерФН");
	ФискальнаяОперация.Вставить("РегистрационныйНомерККТ");
	ФискальнаяОперация.Вставить("ТипДокумента");
	ФискальнаяОперация.Вставить("ТипРасчета");
	ФискальнаяОперация.Вставить("Организация");
	ФискальнаяОперация.Вставить("ТорговыйОбъект");
	ФискальнаяОперация.Вставить("Сумма");
	ФискальнаяОперация.Вставить("ДокументОснование");
	ФискальнаяОперация.Вставить("КорректируемыйДокумент");
	ФискальнаяОперация.Вставить("ФискальныйПризнак");
	ФискальнаяОперация.Вставить("ДополнительныйРеквизит");  	
	ФискальнаяОперация.Вставить("ЕдиныйЧек");
	ФискальнаяОперация.Вставить("ДанныеXML", Запись.ДанныеXML);
	ФискальнаяОперация.Вставить("ИдентификаторОплатыПлатежнойСистемы"); 
	ФискальнаяОперация.Вставить("ТипПлатежнойСистемы"); 
	Возврат ФискальнаяОперация;	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НапечататьКопию(Команда)
	РаботаСДокументамиКлиент.ПечатьКопииЧекаПоИсторииПечати(Запись.ДанныеXML, Запись.Документ, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти