#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		УзелОбъект = РеквизитФормыВЗначение("Объект");
		
		УзелОбъект.УстановитьНовыйКод("0");
		
		ЗначениеВРеквизитФормы(УзелОбъект, "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БазовыйКаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог хранения файлов";
	
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		Объект.БазовыйКаталогФайлов = ДиалогОткрытияФайла.Каталог +"\";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
