#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("Источник") И ЗначениеЗаполнено(Параметры.Источник)) И (Параметры.Свойство("Пакет") И ЗначениеЗаполнено(Параметры.Пакет)) Тогда 
		Источник = Параметры.Источник;
		СоставПакета.Загрузить(ПечатьДокументовСервер.ПолучитьСоставПакета(Параметры.Пакет, Параметры.Источник));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Напечатать(Команда)
	
	СсылкаНаОбъект		= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Источник,"Ссылка");
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета,Источник),СсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти

