
// Инициализирует глобальные переменные, подключает обработчик ожидания
Процедура Инициализация() Экспорт
	
	сл2_Сервер.ПреИнициализация();
	
	ПараметрыИнициализацииПродукта = сл2_Сервер.TClientInitializationSettings(); 	
	сл2_Переопределяемый.ИнициализацияПродукта(ПараметрыИнициализацииПродукта);
	
	Если Не сл2_Сервер.Инициализация(ПараметрыИнициализацииПродукта) Тогда
		ОткрытьФормуКлиентаЛицензирования();		
	КонецЕсли;
	
	Если Не сл2_СерверКэшируемый.ЭтоСервернаяБаза() Тогда		
		ПодключитьОбработчикОжидания("сл2_ОбработчикОжиданияФайловойБазыКлиент", 12, Ложь);		
	КонецЕсли;
	
КонецПроцедуры

// Открывает на клиенте форму системы лицензирования
//
Процедура ОткрытьФормуКлиентаЛицензирования() Экспорт
		
КонецПроцедуры

// Открывает на клиенте форму системы лицензирования
//
Процедура СЛ20ОткрытьФормуКлиентаЛицензирования() Экспорт
	
	ФормаКлиентаЛицензирования = ПолучитьФорму("Обработка.сл2_КлиентЛицензирования.Форма.ОсновнаяФорма",,, "24a77819-277f-4773-a32c-bc5b7116770d");	
	ФормаКлиентаЛицензирования.Открыть();
	
КонецПроцедуры