#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Источник = ПараметрыВыполненияКоманды.Источник.Параметры.Ключ;
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Клиенты") Тогда 
		Отбор = Новый Структура("Клиент", Источник);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ГарантийноеПисьмоПоПолису") Тогда
		Отбор = Новый Структура("ГарантийноеПисьмо", Источник);
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.СтраховыеПолисы") Тогда
		Отбор = Новый Структура("Полис", Источник);
	Иначе
		Отбор = Новый Структура;
	КонецЕсли;	
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
		
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Отбор, Истина);
	
	ОткрытьФорму("Отчет.ОстаткиПоГарантийнымПисьмам.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
	
#КонецОбласти