#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Порядок = 0; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Индекс = ПроверяемыеРеквизиты.Найти("Порядок");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Порядок = 0 Тогда 
		Порядок = Справочники.РазделыМедицинскихКарт.ПолучитьПорядковыйНомер(ТипМедкарты, Ссылка);	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти