#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеОтбора = Параметры.ВладелецПараметра;
	
	Если ЗначениеОтбора <> ПланыВидовХарактеристик.ПараметрыHTML.ПустаяСсылка() Тогда
		
		ЭО = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭО.ПравоеЗначение = ЗначениеОтбора;
		ЭО.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
