#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегиструОплаты()
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Клиенты") Тогда
		Движение = Движения.Оплаты.Добавить();
		Движение.Период		= Дата;
		Движение.ВидОплаты	= Перечисления.ВидыОплаты.Безналичные;
		Движение.Клиент		= Контрагент;
		Движение.Сумма		= -СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Оплачено Тогда
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Сделка = ДокументОснование;
		Движение.Сумма = СуммаДокумента;

		// Записываем движения регистров.
		Движения.ВзаиморасчетыСКонтрагентами.Записать();
		
		РегистрыНакопления.ДвиженияДенежныхСредств.СформироватьДвиженияПоШапкеДокумента(Новый Структура("Дата, Касса, СуммаДокумента,СтатьяДвиженияДенежныхСредств",ДатаОплаты,Неопределено,СуммаДокумента, СтатьяДвиженияДенежныхСредств),Движения.ДвиженияДенежныхСредств, Ложь, Отказ);
		
		ДвиженияПоРегиструОплаты();

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		// Заполнение шапки
		Контрагент = Основание.Контрагент;
		ДокументОснование = Основание.Ссылка;
		СуммаДокумента = Основание.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти