#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		// Дополнительная нормализация шаблона.
		Если ЭтотОбъект.ВидШаблона = Перечисления.ВидыШаблонов.HTMLШаблон И Не ПустаяСтрока(ЭтотОбъект.ТекстHTML) Тогда
			
			Если ДополнительныеСвойства.Свойство("НормализоватьШаблон") Тогда
				ЭтотОбъект.ТекстHTML = РаботаСШаблонамиHTMLКлиентСервер.НормализоватьТекстHTMLШаблона(ЭтотОбъект.ТекстHTML);
			КонецЕсли;
			
			Если ДополнительныеСвойства.Свойство("ОбновитьСтроковыеЗначенияПараметровШаблона") Тогда
				ЭтотОбъект.ТекстHTML = РаботаСШаблонамиHTML.ОбновитьСтроковыеЗначенияПараметровШаблона(
					ЭтотОбъект.ТекстHTML, ЭтотОбъект.СоответствияПараметрам.ВыгрузитьКолонку("Параметр"));
			КонецЕсли;
			
			ЭтотОбъект.ТекстHTML = РаботаСШаблонамиHTMLКлиентСервер.УбратьДвойныеКавычкиИзАтрибутов(ЭтотОбъект.ТекстHTML);
			
			Попытка
				ЭтотОбъект.ТекстHTML = РаботаСШаблонамиHTMLКлиентСервер.НормализоватьОтступы(ЭтотОбъект.ТекстHTML);
			Исключение КонецПопытки;
		КонецЕсли;
		
		Если ТипЗнч(ЭтотОбъект.РасположениеПодписи) = Тип("Число") Тогда
			ЭтотОбъект.РасположениеПодписи = Справочники.ШаблоныHTML.ЧисловыеРасположенияПодписи().Получить(ЭтотОбъект.РасположениеПодписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ВидШаблона) Тогда
			ЭтотОбъект.ВидШаблона = Перечисления.ВидыШаблонов.HTMLШаблон;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для Каждого СтрокаРоли Из ОбъектКопирования.РолиПодписей Цикл
		СтрокаРоли.ИдентификаторРоли = Новый УникальныйИдентификатор;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти