#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДекорацияСсылкаНаПулНомеров.Видимость = Запись.ИспользоватьПечатьЭтикеток;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВидЛаборатории = ПредопределенноеЗначение("Перечисление.ВнешниеЛаборатории.Helix");
	Если Не ЛабораторияСервер.ПараметрыЗабораАнализовЗаполненыЛаборатории(ВидЛаборатории) Тогда
		Ответ = Вопрос("Заполнить параметры забора анализов?",РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЛабораторияСервер.ЗагрузитьПараметрыЗабораИзВнутреннихМакетов(ВидЛаборатории);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	
	Если Запись.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант") Тогда
		Запись.Прейскурант = ПредопределенноеЗначение("Справочник.Прейскуранты.ПустаяСсылка");
		
		СообщениеПользователю = Новый СообщениеПользователю; 
		СообщениеПользователю.Поле = "Прейскурант";
		СообщениеПользователю.Текст = "Нельзя выбирать основной прейскурант!";
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаПулНомеровНажатие(Элемент)
	Отбор = Новый Структура("Лаборатория", Запись.Лаборатория);
	ОткрытьФорму("РегистрСведений.ПулыНомеровЗаявокЛабораторий.ФормаСписка", Новый Структура("Отбор", Отбор) , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПечатьЭтикетокПриИзменении(Элемент)
	Элементы.ДекорацияСсылкаНаПулНомеров.Видимость = Запись.ИспользоватьПечатьЭтикеток;
КонецПроцедуры

#КонецОбласти
