#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		
		РеквизитНомерППДляСортировки = "НомерППДляСортировки";
		РеквизитНомерПП = "НомерПП";
		
		РеквизитНомерППДляСортировкиЗначение = "";
		мсСтр = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ЭтотОбъект.НомерПП, ".");
		Для Каждого СтрокаПП Из мсСтр Цикл
			Если СтрДлина(СтрокаПП) = 1 Тогда
				РеквизитНомерППДляСортировкиЗначение = РеквизитНомерППДляСортировкиЗначение + ?(ПустаяСтрока(РеквизитНомерППДляСортировкиЗначение), "", ".") + "0" + СтрокаПП;
			Иначе
				РеквизитНомерППДляСортировкиЗначение = РеквизитНомерППДляСортировкиЗначение + ?(ПустаяСтрока(РеквизитНомерППДляСортировкиЗначение), "", ".") + СтрокаПП;	
			КонецЕсли;
		КонецЦикла;
		ЭтотОбъект.НомерППДляСортировки = РеквизитНомерППДляСортировкиЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
