#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаОбновитьСхематроны.Видимость = ОбщегоНазначенияСервер.РежимРасширенныхВозможностейРедактированияДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	ИнтеграцияЕГИСЗКлиент.КомандаСпискаЗагрузитьКлассификаторФРНСИ(ЭтаФорма, Элементы.Список, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСхематроныИлиСхемыВизуализации(Команда)
	
	Если Команда.Имя = "ОбновитьСхематроны" Тогда
		ОбновитьСхематроныИлиСхемыВизуализацииНаСервере(Истина);
	ИначеЕсли Команда.Имя = "ОбновитьСхемыВизуализации" Тогда
		ОбновитьСхематроныИлиСхемыВизуализацииНаСервере(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Если ЗагружатьСхематроны = Истина, то загружаются только схематроны, если Ложь, то только схемы визуализации
Процедура ОбновитьСхематроныИлиСхемыВизуализацииНаСервере(ЗагружатьСхематроны = Истина)
	
	ЗагрузкаКлассификаторовНСИЕГИСЗ.ОбновитьСхематроныИСхемыВизуализации(ЗагружатьСхематроны, Не ЗагружатьСхематроны);
	
КонецПроцедуры

#КонецОбласти