#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РаспечататьБланк(Команда)
	ИНЗ = РаспечататьБланкНаСервере();
	БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	ПутьЗаписи = КаталогВременныхФайлов() + ИНЗ + ".pdf";
    БланкДД.Записать(ПутьЗаписи);
    ЗапуститьПриложение(ПутьЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШтрихКод(Команда)
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		ШК = ПолучитьШКНаСервере(Элементы.Контейнеры.ТекущиеДанные.ИЛН);
		ПортПринтера = ПолучитьПортПринтераНаСервере();
		Если ЗначениеЗаполнено(ШК) Тогда
			Запись = Новый ЗаписьДанных(ПортПринтера);
			Запись.Записать(ШК);
			Запись.Закрыть();
			//ВременныйФайл = КаталогВременныхФайлов() + Элементы.Контейнеры.ТекущиеДанные.ИЛН + ".txt";
			//ШК.Записать(ВременныйФайл);
			//ТекстДок = Новый ТекстовыйДокумент;
			//ТекстДок.Прочитать(ВременныйФайл);
			//ТекстДок.Записать(ПортПринтера,"utf-8");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШКЗаявки(Команда)
	//Для каждого Контейнер Из Объект.Контейнеры Цикл 
	//	//Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
	//		ТекстДок = Новый ТекстовыйДокумент;
	//		ТекстДок.УстановитьТекст(Контейнер.ШтрихКод);
	//		ТекстДок.Записать("\\ws-00464\zebra","cp866");
	//	//КонецЕсли;
	//КонецЦикла;
	ШК = РаспечататьВсеШКНаСервере();
	ПортПринтера = ПолучитьПортПринтераНаСервере();
	Для Каждого стрШК Из ШК Цикл
		Если стрШК <> Неопределено Тогда
			Запись = Новый ЗаписьДанных(ПортПринтера);			
			Запись.Записать(стрШК);			
			Запись.Закрыть();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция РаспечататьБланкНаСервере()
	Документ = ДанныеФормыВЗначение(Объект,тип("ДокументОбъект.invЗаявкаНаИсследование"));
	АдресБланка = ПоместитьВоВременноеХранилище(Документ.Бланк.Получить());
	//ТД = Новый ТабличныйДокумент;
	//БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	//ПутьЗаписи = КаталогВременныхФайлов() + Документ.ИНЗ + ".pdf";
    //БланкДД.Записать(ПутьЗаписи);
	Возврат Документ.Номер
КонецФункции

&НаСервере
Функция РаспечататьВсеШКНаСервере()
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	МассивШК = Новый Массив;
	Для каждого Контейнер Из Док.Контейнеры Цикл
		МассивШК.Добавить(Контейнер.ШтрихКод.Получить());
	КонецЦикла;
	Возврат МассивШК
КонецФункции

&НаСервере
Функция ПолучитьШКНаСервере(ИЛН)
	ШК = "";
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	стрКонтейнеры = Док.Контейнеры.Найти(ИЛН,"ИЛН");
	Если стрКонтейнеры <> Неопределено Тогда
		ШК = стрКонтейнеры.ШтрихКод.Получить();
	КонецЕсли;
	Возврат ШК
КонецФункции

&НаСервере
Функция ПолучитьПортПринтераНаСервере()
 Возврат РегистрыСведений.invНастройкиПодразделения.Получить(Новый Структура("Подразделение",Объект.Подразделение)).ПортПринтера;
КонецФункции

#КонецОбласти
