#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныйОбъект = Параметры.ВыбранныйОбъект;
	ВыбранныйКлиент = Параметры.ВыбранныйКлиент;
	
	Запись = РегистрыСведений.КомментарииПоЗвонкам.СоздатьМенеджерЗаписи();
	Запись.Объект			= ВыбранныйОбъект;
	Запись.ВторичныйОбъект	= ВыбранныйКлиент;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Комментарий = Запись.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбновитьКомментарий(ВыбранныйОбъект, ВыбранныйКлиент, Комментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбновитьКомментарий(ВыбранныйОбъект, ВыбранныйКлиент, Комментарий)
	
	Запись = РегистрыСведений.КомментарииПоЗвонкам.СоздатьМенеджерЗаписи();
	Запись.Объект			= ВыбранныйОбъект;
	Запись.ВторичныйОбъект	= ВыбранныйКлиент;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Комментарий = Комментарий;
		Попытка
			Запись.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти