#Область ПрограммныйИнтерфейс

// Процедура ЗаполнитьПустыеПолныеНаименования
Процедура ЗаполнитьПустыеПолныеНаименования() Экспорт 
	
	Выборка = Справочники.СтруктураПрайслистов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.НаименованиеПолное) Тогда 
			Продолжить;
		КонецЕсли;
		Объект = Выборка.ПолучитьОбъект();
		Объект.НаименованиеПолное = Объект.Наименование;
		Объект.Записать();
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Завершено заполнение полных наименований в структуре прайс-листов.'"));
	
КонецПроцедуры
#КонецОбласти