
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сотрудник.Доступность = Не ЗначениеЗаполнено(Запись.Сотрудник);
	
	ПараметрыВыбораЗначения = Новый Массив;
	Параметр = Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций);
	ПараметрыВыбораЗначения.Добавить(Параметр);
	Элементы.ДолжностьМинздрава.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);
	
КонецПроцедуры

#КонецОбласти