#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаблокированныйОбъект = Параметры.ЗаблокированныйОбъект;
	ЗаблокированныйКлиент = Параметры.ЗаблокированныйКлиент;
	
	Если ТипЗнч(ЗаблокированныйОбъект) = Тип("ЗадачаСсылка.ЗадачиПользователя")
		Или ТипЗнч(ЗаблокированныйОбъект) = Тип("ДокументСсылка.бит_СписокОбзвона")
	Тогда
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(1,"Выполнено");
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(2,"Не выполнено");
		Элементы.Комментарий.Доступность = Истина;
	ИначеЕсли ТипЗнч(ЗаблокированныйОбъект) = Тип("ДокументСсылка.Заявка") Тогда
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(1,"Выполнено");
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(3,"Выполнено(все записи клиента на день)");
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(4,"Отменена");
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(5,"Отменены все записи на день");
		Элементы.РезультатЗвонка.СписокВыбора.Добавить(2,"Не выполнено");
		Элементы.Комментарий.Доступность = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	РезультатЗвонка = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СписокПараметров = Новый Соответствие;
	СписокПараметров.Вставить("РезультатЗвонка", РезультатЗвонка);
	СписокПараметров.Вставить("Комментарий", Комментарий);
	Оповестить("СобытиеЗакрытияФормыЗавершенияЗвонка", СписокПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РезультатЗвонкаПриИзменении(Элемент)
	
	Если ТипЗнч(ЗаблокированныйОбъект) = Тип("ДокументСсылка.Заявка") Тогда
		Если РезультатЗвонка = 2 Тогда
			Элементы.Комментарий.Доступность = Истина;
		Иначе
			Элементы.Комментарий.Доступность = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти