#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Параметры.Заявка) Тогда
		
		Заявка = Параметры.Заявка;
		
		Если ТипЗнч(Параметры.ПриемыЗаявки) = Тип("Массив")	Тогда
			ЗначениеОтбора = Новый СписокЗначений;
			ЗначениеОтбора.ЗагрузитьЗначения(Параметры.ПриемыЗаявки);
			
			РаботаСФормамиКлиент.УстановитьОтборСписка("Ссылка", ЗначениеОтбора, Список);
		Иначе		
			РаботаСФормамиКлиент.УстановитьОтборСписка("ДокументОснование", Заявка, Список);
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПрием(Команда)
	
	ЗначенияЗаполнения = Новый Структура("ДокументОснование, Врач", Заявка, Параметры.Сотрудник);
	ОткрытьФорму("Документ.Прием.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),,Заявка);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти