#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.ТекущийЭлемент = Элементы.МНН;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список.Отбор.Элементы.Очистить();
	РаботаСФормамиКлиент.УстановитьОтборСписка("ПометкаУдаления", Ложь, Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборМННПриИзменении(Элемент)
	ВыполнитьОтбор(ОтборМНН);
КонецПроцедуры

&НаКлиенте
Процедура ОтборМННАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание <> 0 Тогда
		ВыполнитьОтбор(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтбор(Знач Текст)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("МНН", Текст, Список, ВидСравненияКомпоновкиДанных.Содержит);
	Иначе
		РаботаСФормамиКлиент.СнятьОтборСписка("МНН", Список);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти