#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПолеВладелец = Новый ПолеКомпоновкиДанных("ВладелецКарты");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование 
			И ЭлементОтбора.ЛевоеЗначение = ПолеВладелец
		Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецКарты", ЭлементОтбора.ПравоеЗначение));
			ОткрытьФорму("Справочник.КартыСкидок.ФормаОбъекта", ПараметрыФормы);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти