#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТипыЗвонковПоИсходам, "ИсходЗвонка", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.СоздаватьЛистОжидания И Не Объект.ОбщениеСостоялось Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Признак ""Создавать лист ожидания"" разрешен только для исходов звонка с признаком ""Общение состоялось""'")); 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТипыЗвонковПоИсходам, "ИсходЗвонка", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СоздаватьЛистОжиданияПриИзменении(Элемент)
	Если Объект.СоздаватьЛистОжидания Тогда
		Объект.ОбщениеСостоялось = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипыЗвонковПоИсходамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	РаботаСДиалогамиКлиент.ПередНачаломДобавленияВПодчиненныйСписокНаФормеОбъекта(ЭтаФорма, Элемент, Отказ);
КонецПроцедуры

#КонецОбласти