#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Анализы = ОтобратьАнализыИзОснования(ПараметрКоманды);
	
	Если Анализы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru='В документе нет номенклатуры, отмеченной как анализ'"), 30);
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Основание, Анализы", ПараметрКоманды, Анализы));
		ОткрытьФорму("Документ.ДействияНадАнализами.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтобратьАнализыИзОснования(Документ)
	
	Анализы = Новый Массив;
	
	НоменклатураДокумента = Документ.Работы.ВыгрузитьКолонку("Номенклатура");
	Клиент = Документ.Клиент;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураДокумента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Номенклатура)
	|	И Номенклатура.Анализ"
	;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Анализы.Добавить(Выб.Ссылка);
	КонецЦикла;
	
	Возврат Анализы;
	
КонецФункции

#КонецОбласти
