#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийНомер = Запись.ТекущийНомер;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийНомерПриИзменении(Элемент)
	
	Если	Запись.ТекущийНомер < Запись.НачалоДиапазона
		Или	Запись.ТекущийНомер > Запись.ОкончаниеДиапазона
	Тогда    
		ПоказатьПредупреждение( , "Введенный номер не входит в указанный диапазон!");
		Запись.ТекущийНомер = ТекущийНомер;
	Иначе
		ТекущийНомер = Запись.ТекущийНомер;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
