#Область РазделОписанияПеременных
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений
#КонецОбласти

#Область ПрограммныйИнтерфейс
// Выполняет приход по регистру.
Процедура ВыполнитьПриход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход,,Ложь);
КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
Процедура ВыполнитьРасход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход,,Ложь);
КонецПроцедуры // ВыполнитьРасход()
#КонецОбласти

